{
  "name": "furkies-purrkies-poetry-0633",
  "id": "furkies-purrkies-poetry-0633",
  "title": "On Understanding Divisions",
  "date": "2021-11-24T00:08:23.850Z",
  "image": "poetry-0633-illustration.jpg",
  "artwork": "https://unsplash.com/photos/PDRFeeDniCk",
  "audio": "poetry-0633.mp3",
  "html": "<div class=\"section\">\n  <p>Let us examine roots and gravity of young wisdom,<br>that which we come across, when we are still children.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>My first wisdom was in how I faced violence,<br>I nobly took no part in it, I only pushed people back, I never became like they were.</p>\n  <p>And right here,<br>we have a wisdom that we can examine.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>My main bully was twisted and cunning,<br>likely instructed by his father.</p>\n  <p>We used to be school friends,<br>and then he started fighting me for no reason.</p>\n  <p>He didn't just attack me,<br>but turned everyone against me.</p>\n  <p>He was probably a puppet,<br>in his father's sick game.</p>\n  <p>And if not, then pretending to be hurt by someone,<br>was maybe his way of making friends.</p>\n  <p>I remember when he was forced to share his glue in 4th grade,<br>when he got back a mangled tube he cried that his father would beat him.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>The change in that boy was irreversible,<br>his attacks continued, and at least in my view they were elaborate.</p>\n  <p>This is a young person,<br>who became completely unreachable, and incapable of reason, possibly emotion.</p>\n  <p>He was a normal person at first,<br>but then became warped, and to me he became a monster.</p>\n  <p>Whatever happened to him in the span of a day or two,<br>happened because he was too young to see he was being manipulated or warped.</p>\n  <p>If that event could have been prevented,<br>he would continue growing up like a normal boring person.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Even though this was fourth grade,<br>we were perfectly capable of spotting trouble.</p>\n  <p>Whatever got him, was invisible to him,<br>his father most likely, used his lack of experience to warp him.</p>\n  <p>As he started making friends and perhaps spreading whatever lies about me,<br>it was more advantageous to him to remain a bully that plays a victim.</p>\n  <p>His father was no longer needed,<br>he entered a different life line.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>He and his friends, eventually got caught lying,<br>and the school psychologist who intervened in me pushing him away the last time.</p>\n  <p>Cracked the case, as two of his friends were supporting his side of the story,<br>and she made them confess the truth.</p>\n  <p>The young Psychologist woman came into the class room,<br>put her hand on my shoulder and said everything is going to be OK.</p>\n  <p>But my class was manipulated by the boy,<br>few minutes later, one of the smart girls that I grew up with said that they didn't want me in the class room.</p>\n  <p>They saw me as the bully that starts fights,<br>the final skirmish begun as I was trying to save the class comedian from getting beat up.</p>\n  <p>To my surprise both of them started fighting me,<br>and the main bully joined in.</p>\n  <p>I grew up surrounded by bullies,<br>I had no trouble getting them away from me.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>The friends of the bully got together few days later,<br>and started kicking and spitting on me on our way back from school.</p>\n  <p>It was between eight and twelve of them,<br>as I was getting up maybe for the fourth time as they kept pushing me off balance.</p>\n  <p>With the concrete of the sidewalk digging into my fists,<br>I understood how powerful I have become for not fighting them back.</p>\n  <p>To me they were opportunistic predators,<br>some would come to kick when I was down others waited to knock me down again.</p>\n  <p>Eventually they got tired,<br>and allowed me to walk away without anymore shoving.</p>\n  <p>I took a different path,<br>and started crying, not because I was hurt, but because how alone I was.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>The main bully had another wave come in,<br>this time it was older kids that were five years older.</p>\n  <p>They made a circle around me and one of them kicked me in the head,<br>it was a spin kick no doubt, it didn't hurt.</p>\n  <p>But fighting older kids that I have not really seen before,<br>and seeing that they had outside clothes on, I stayed down.</p>\n  <p>No one came to help, the girls saw the whole thing bu they didn't come to help,<br>I think everyone was just sacred of older kids.</p>\n  <p>I wasn't hurt, I was just not moving,<br>this was Russian language class, and the teacher was mad that I was late.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>I stopped going to school as to me it became a circus,<br>then after few months I go punished and graduated fine, as the teachers didn't wan trouble.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Even though I lacked experience,<br>I still did all the right things.</p>\n  <p>I didn't attack back, I stayed down,<br>when I could smell a knife in the skinhead-jacket pocket of one of the bullies.</p>\n  <p>And set myself free from school,<br>by becoming a student of pixel art.</p>\n  <p>I spent my time away from school at the biggest arcade in the city,<br>I didn't have money to play, but I loved watching other people play.</p>\n  <p>My favorite games were <a href=\"https://www.youtube.com/watch?v=-LhEovW4Uqw\">Asterix & Obelix</a>, and <a href=\"https://www.youtube.com/watch?v=S9DE-KyZnLc\">The Simpsons</a>,<br>I liked <a href=\"https://www.youtube.com/watch?v=1eh417JtLm8\">Blanka from Street Fighter II</a>, and I liked how technical Streetfighter was.</p>\n  <p>When Wolfenstein 3D came out in Poland,<br>I was not impressed, 3D graphics destroyed Pixel Art, but Pixel Art will rule again someday.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>I had to make a choice to break away from everyone else,<br>as they were sick, or mislead.</p>\n  <p>The boys in my class wanted to keep together,<br>sometime after the event I described, I've noticed them role playing boxing.</p>\n  <p>They asked me if I wanted to fight too,<br>they were now honorable fighters in their head.</p>\n  <p>They kept together, because nobody want to be alone,<br>b8ut that also meant that they were reinforcing each other's behavior; rather than acting on their wisdom.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Where I experienced power, strengths, wisdom and independence,<br>they were not growing up correctly, they were drifting in the direction of where the group was going.</p>\n  <p>Sometimes I consider if mandatory military service that we had back then,<br>actually fueled violent behavior, in preparation for what seemed like more violence, but parents were causing most of the harm.</p>\n  <p>I remember I had a choke hold put on me by another friend,<br>but I had no interest in hurting him to get out, his father who beat him with the hose from the washer, was teaching him how to fight.</p>\n  <p>I probably caused the situation, but inflicting pain was not a healthy response on his part,<br>some years earlier he said that he wished he grew up watching horror movies so that he had no fear.</p>\n  <p>There was another boy who was violent but never towards me, when his father found out that his grades were bad,<br>he took him to girls' restroom and beat him up - his personality change was instant - it was very visible and painful to watch even then.</p>\n  <p>I remember him stealing stuff after that,<br>his father ruined his mind - though I think he is a good person now.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>I would have ran to help him if I was wiser,<br>if back then I knew what I know now, I would have sprinted to attack his father, to stop the boy from becoming a thief.</p>\n  <p>With all I have learned from the bullies,<br>I would take him down by sliding into his feat and punching his nose, really hard, as I was no stranger to nosebleeds.</p>\n  <p>I'd tell the police that his father was hurting him,<br>and I was just protecting him.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>That's probably why the girls didn't need much convincing that I was a bully,<br>I was breaking up fights, to get the bullies to stop hurting people because I sensed what it meant, and I saw bullies make bullies.</p>\n  <p>But it wasn't fighting,<br>just pushing the red faced snarling beasts back.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Do you now remember how there are these tiny events when we are young,<br>that dictate all the rest of our lives ahead?</p>\n  <p>That's wisdom; not philosophy, education, schooling, cultures, heritage,<br>but the most powerful force there is: wisdom.</p>\n  <p>It comes from our warrior nature,<br>but then it flourishes and grows to make us Great And Peaceful Philosophers.</p>\n  <p>It is easily stunted by group think,<br>by doing what others do to satay with them as friend.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>But more than that, these tiny events in our youth also often mark points of no return,<br>at least not for a long while.</p>\n  <p>I see myself as nothing if I took the disgusting path to be friends with the bullies,<br>who later ended up attacking one of the special needs girls, and again the other girls barely raised their voice, to their credit I remember it being raised.</p>\n  <p>Hopefully they figured out the cool boys were monsters,<br>and to stay safe and away from them, and and protect their sister, special needs does not mean that someone is broken, just that they need real friends.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>I felt like an outsider, I didn't know I belonged anywhere,<br>I didn't know I could find that Psychologist lady that helped a year or two before to rain her amazing wrath, I didn't know to become friends with the Principal, or call the Police.</p>\n  <p>I trust the girls that I grew up with to take care of her,<br>I just know they looked after her, we were a family together for almost a decade.</p>\n  <p>When I left for America,<br>I was glad to leave the bullies behind.</p>\n  <p>There was one more bully in Brooklyn,<br>but having watched NYPD Blue, I knew I could call the police, and to tell then not to press charges.</p>\n  <p>NYPD broke up the gang,<br>the mothers stepped in.</p>\n  <p>And right before I came to Michigan,<br>the bully barely whimpered \"Fuck Poles\".</p>\n  <p>He was not racist, he was just made sick,<br>he didn't hate white people, so he picked the Polish people to hate something.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>He too had a an opportunity to go to the Library and search for wisdom,<br>rather than going to the boxing club to get good at fighting.</p>\n  <p>In the 20 minute walk back from school,<br>he punched me maybe four times in the back of my head, full force, full theatrics.</p>\n  <p>Once we made it to the street we lived on,<br>I finally turned around to his punches.</p>\n  <p>I was ignoring them before, as I became an artist when it came to bullies,<br>we were maybe seventeen or so, and his boxing instructor was, bad.</p>\n  <p>He opened up with a full volley with punches to my face,<br>it only made it red for long enough for NYPD Blue to get a full picture of what they need to do.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Like the bullies in Poland,<br>this boy needed wisdom.</p>\n  <p>When his brother or cousin, or mad uncle was saying white people are crazy but poles are worse,<br>he needed to walk away from that conversation.</p>\n  <p>Better yet,<br>here is what he needed to say to his stupid uncles face:</p>\n  <p>Out of the night that covers me,<br> Black as the pit from pole to pole,<br>I thank whatever ides may be<br> For my unconquerable soul.</p>\n  <p>In the fell clutch of circumstance<br> I have not winced nor cried aloud.<br>In the bludgeonings of chance<br> My head is bloodied, but unbowed.</p>\n  <p>Beyond this place of wrath and tears<br> Looms but the Horror of the shade,<br>And yet the menace of the years<br> Finds and shall find me unafraid.</p>\n  <p>It matters not how narrow the gate,<br> How charged with punishments the scroll,<br>I am the master of my fate,<br> I am the captain of my soul.</p>\n  <p>In a a way all this boy needed was a poem,<br>a thing that would help him grow the necessary wisdom against hate.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>My bullies were monsters,<br>but they didn't hate, they relished inflicting pain, but they had no hate in them.</p>\n  <p>This boy,<br>did get poisoned by it.</p>\n  <p>I think the police to underline the gravity of the situation,<br>never told him I didn't press the charges, but just kind of left it hanging in the air.</p>\n  <p>Hate of any kind of group of people as a teenager,<br>is a lot of evil to handle.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Rejection of hate requires a culture of wisdom very early on,<br>a young person must immediately reject divisions.</p>\n  <p>In that case by Brooklyn Bully,<br>could chose to reject the family members that propagated hate, or permanently become a hater.</p>\n  <p>Though his Mom would be proud,<br>the path of rejection of hate and division could make him an outcast.</p>\n  <p>From the perspective of old man him,<br>he only had one real choice, Become a Philosopher, and and make those who spread hate the outcasts.</p>\n  <p>He needed to become someone capable of inspiring his family to Wisdom,<br>and away from that which is not worthy of us.</p>\n  <p>He had an opportunity to become a Philosopher, and change the world,<br>but he became a bully, that to me, is a big of a tragedy as the friend who got beat up by his father and instantly warped.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Do you see,<br>and are you able to see it in the strangers you came across in your lives.</p>\n  <p>They are being pushed,<br>because they lack wisdom and experience.</p>\n  <p>The trick made by a family member looking for affirmation to their own hate,<br>or looking to simplify their own life.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>I believe that every violent person,<br>had an opportunity to become a Philosopher, but it was stolen from them.</p>\n  <p>Violence, Division, and especially Hate,<br>are so incredibly alien to us, that it is like breathing toxic air.</p>\n  <p>Those things do not emerge in children,<br>they are put there, and always deliberately.</p>\n  <p>It takes root because like cults it holds answers,<br>plugging up questions, and offering a target for hate.</p>\n  <p>Long before a child is made ill by a broken, mind warping idea,<br>there is a long stretch of time when they are more than capable of comprehending Greatness.</p>\n  <p>Restraint, Dignity, Nobility, Unbreakability, Fortitude, Courage, Honor, Love;<br>and Insight; and Foresight; and Understanding; and Authenticity; and Heroism.</p>\n  <p>These are the ideas, that when taught early on,<br>will immunize against the easier wrong, and bring a young person a feeling of ennoblement for choosing the harder right.</p>\n  <p>Ladies and Gentlemen,<br>we are not divided, we are not different, we are one family.</p>\n  <p>We are to repair schools, and end poverty,<br>and prevent the propagation of broken ideas that only give an impression of answers while keeping a person imprisoned within the invisible walls of hate.</p>\n  <p>Walls that prevent a person's Wisdom and Greatness,<br>from ever reaching the heights that are worthy of them.</p>\n  <p>We are one,<br>one family under the sun.</p>\n</div>",
  "bootstrap": "<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Let us examine roots and gravity of young wisdom,<br>that which we come across, when we are still children.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">My first wisdom was in how I faced violence,<br>I nobly took no part in it, I only pushed people back, I never became like they were.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">And right here,<br>we have a wisdom that we can examine.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">My main bully was twisted and cunning,<br>likely instructed by his father.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">We used to be school friends,<br>and then he started fighting me for no reason.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">He didn't just attack me,<br>but turned everyone against me.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">He was probably a puppet,<br>in his father's sick game.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">And if not, then pretending to be hurt by someone,<br>was maybe his way of making friends.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I remember when he was forced to share his glue in 4th grade,<br>when he got back a mangled tube he cried that his father would beat him.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The change in that boy was irreversible,<br>his attacks continued, and at least in my view they were elaborate.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">This is a young person,<br>who became completely unreachable, and incapable of reason, possibly emotion.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">He was a normal person at first,<br>but then became warped, and to me he became a monster.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Whatever happened to him in the span of a day or two,<br>happened because he was too young to see he was being manipulated or warped.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">If that event could have been prevented,<br>he would continue growing up like a normal boring person.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Even though this was fourth grade,<br>we were perfectly capable of spotting trouble.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Whatever got him, was invisible to him,<br>his father most likely, used his lack of experience to warp him.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">As he started making friends and perhaps spreading whatever lies about me,<br>it was more advantageous to him to remain a bully that plays a victim.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">His father was no longer needed,<br>he entered a different life line.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">He and his friends, eventually got caught lying,<br>and the school psychologist who intervened in me pushing him away the last time.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Cracked the case, as two of his friends were supporting his side of the story,<br>and she made them confess the truth.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The young Psychologist woman came into the class room,<br>put her hand on my shoulder and said everything is going to be OK.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">But my class was manipulated by the boy,<br>few minutes later, one of the smart girls that I grew up with said that they didn't want me in the class room.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">They saw me as the bully that starts fights,<br>the final skirmish begun as I was trying to save the class comedian from getting beat up.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">To my surprise both of them started fighting me,<br>and the main bully joined in.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I grew up surrounded by bullies,<br>I had no trouble getting them away from me.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The friends of the bully got together few days later,<br>and started kicking and spitting on me on our way back from school.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">It was between eight and twelve of them,<br>as I was getting up maybe for the fourth time as they kept pushing me off balance.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">With the concrete of the sidewalk digging into my fists,<br>I understood how powerful I have become for not fighting them back.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">To me they were opportunistic predators,<br>some would come to kick when I was down others waited to knock me down again.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Eventually they got tired,<br>and allowed me to walk away without anymore shoving.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I took a different path,<br>and started crying, not because I was hurt, but because how alone I was.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The main bully had another wave come in,<br>this time it was older kids that were five years older.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">They made a circle around me and one of them kicked me in the head,<br>it was a spin kick no doubt, it didn't hurt.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">But fighting older kids that I have not really seen before,<br>and seeing that they had outside clothes on, I stayed down.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">No one came to help, the girls saw the whole thing bu they didn't come to help,<br>I think everyone was just sacred of older kids.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I wasn't hurt, I was just not moving,<br>this was Russian language class, and the teacher was mad that I was late.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I stopped going to school as to me it became a circus,<br>then after few months I go punished and graduated fine, as the teachers didn't wan trouble.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Even though I lacked experience,<br>I still did all the right things.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I didn't attack back, I stayed down,<br>when I could smell a knife in the skinhead-jacket pocket of one of the bullies.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">And set myself free from school,<br>by becoming a student of pixel art.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I spent my time away from school at the biggest arcade in the city,<br>I didn't have money to play, but I loved watching other people play.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">My favorite games were <a href=\"https://www.youtube.com/watch?v=-LhEovW4Uqw\">Asterix & Obelix</a>, and <a href=\"https://www.youtube.com/watch?v=S9DE-KyZnLc\">The Simpsons</a>,<br>I liked <a href=\"https://www.youtube.com/watch?v=1eh417JtLm8\">Blanka from Street Fighter II</a>, and I liked how technical Streetfighter was.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">When Wolfenstein 3D came out in Poland,<br>I was not impressed, 3D graphics destroyed Pixel Art, but Pixel Art will rule again someday.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I had to make a choice to break away from everyone else,<br>as they were sick, or mislead.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The boys in my class wanted to keep together,<br>sometime after the event I described, I've noticed them role playing boxing.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">They asked me if I wanted to fight too,<br>they were now honorable fighters in their head.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">They kept together, because nobody want to be alone,<br>b8ut that also meant that they were reinforcing each other's behavior; rather than acting on their wisdom.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Where I experienced power, strengths, wisdom and independence,<br>they were not growing up correctly, they were drifting in the direction of where the group was going.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Sometimes I consider if mandatory military service that we had back then,<br>actually fueled violent behavior, in preparation for what seemed like more violence, but parents were causing most of the harm.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I remember I had a choke hold put on me by another friend,<br>but I had no interest in hurting him to get out, his father who beat him with the hose from the washer, was teaching him how to fight.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I probably caused the situation, but inflicting pain was not a healthy response on his part,<br>some years earlier he said that he wished he grew up watching horror movies so that he had no fear.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">There was another boy who was violent but never towards me, when his father found out that his grades were bad,<br>he took him to girls' restroom and beat him up - his personality change was instant - it was very visible and painful to watch even then.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I remember him stealing stuff after that,<br>his father ruined his mind - though I think he is a good person now.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I would have ran to help him if I was wiser,<br>if back then I knew what I know now, I would have sprinted to attack his father, to stop the boy from becoming a thief.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">With all I have learned from the bullies,<br>I would take him down by sliding into his feat and punching his nose, really hard, as I was no stranger to nosebleeds.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I'd tell the police that his father was hurting him,<br>and I was just protecting him.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">That's probably why the girls didn't need much convincing that I was a bully,<br>I was breaking up fights, to get the bullies to stop hurting people because I sensed what it meant, and I saw bullies make bullies.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">But it wasn't fighting,<br>just pushing the red faced snarling beasts back.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Do you now remember how there are these tiny events when we are young,<br>that dictate all the rest of our lives ahead?</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">That's wisdom; not philosophy, education, schooling, cultures, heritage,<br>but the most powerful force there is: wisdom.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">It comes from our warrior nature,<br>but then it flourishes and grows to make us Great And Peaceful Philosophers.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">It is easily stunted by group think,<br>by doing what others do to satay with them as friend.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">But more than that, these tiny events in our youth also often mark points of no return,<br>at least not for a long while.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I see myself as nothing if I took the disgusting path to be friends with the bullies,<br>who later ended up attacking one of the special needs girls, and again the other girls barely raised their voice, to their credit I remember it being raised.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Hopefully they figured out the cool boys were monsters,<br>and to stay safe and away from them, and and protect their sister, special needs does not mean that someone is broken, just that they need real friends.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I felt like an outsider, I didn't know I belonged anywhere,<br>I didn't know I could find that Psychologist lady that helped a year or two before to rain her amazing wrath, I didn't know to become friends with the Principal, or call the Police.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I trust the girls that I grew up with to take care of her,<br>I just know they looked after her, we were a family together for almost a decade.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">When I left for America,<br>I was glad to leave the bullies behind.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">There was one more bully in Brooklyn,<br>but having watched NYPD Blue, I knew I could call the police, and to tell then not to press charges.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">NYPD broke up the gang,<br>the mothers stepped in.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">And right before I came to Michigan,<br>the bully barely whimpered \"Fuck Poles\".</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">He was not racist, he was just made sick,<br>he didn't hate white people, so he picked the Polish people to hate something.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">He too had a an opportunity to go to the Library and search for wisdom,<br>rather than going to the boxing club to get good at fighting.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">In the 20 minute walk back from school,<br>he punched me maybe four times in the back of my head, full force, full theatrics.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Once we made it to the street we lived on,<br>I finally turned around to his punches.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I was ignoring them before, as I became an artist when it came to bullies,<br>we were maybe seventeen or so, and his boxing instructor was, bad.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">He opened up with a full volley with punches to my face,<br>it only made it red for long enough for NYPD Blue to get a full picture of what they need to do.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Like the bullies in Poland,<br>this boy needed wisdom.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">When his brother or cousin, or mad uncle was saying white people are crazy but poles are worse,<br>he needed to walk away from that conversation.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Better yet,<br>here is what he needed to say to his stupid uncles face:</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Out of the night that covers me,<br> Black as the pit from pole to pole,<br>I thank whatever ides may be<br> For my unconquerable soul.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">In the fell clutch of circumstance<br> I have not winced nor cried aloud.<br>In the bludgeonings of chance<br> My head is bloodied, but unbowed.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Beyond this place of wrath and tears<br> Looms but the Horror of the shade,<br>And yet the menace of the years<br> Finds and shall find me unafraid.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">It matters not how narrow the gate,<br> How charged with punishments the scroll,<br>I am the master of my fate,<br> I am the captain of my soul.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">In a a way all this boy needed was a poem,<br>a thing that would help him grow the necessary wisdom against hate.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">My bullies were monsters,<br>but they didn't hate, they relished inflicting pain, but they had no hate in them.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">This boy,<br>did get poisoned by it.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I think the police to underline the gravity of the situation,<br>never told him I didn't press the charges, but just kind of left it hanging in the air.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Hate of any kind of group of people as a teenager,<br>is a lot of evil to handle.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Rejection of hate requires a culture of wisdom very early on,<br>a young person must immediately reject divisions.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">In that case by Brooklyn Bully,<br>could chose to reject the family members that propagated hate, or permanently become a hater.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Though his Mom would be proud,<br>the path of rejection of hate and division could make him an outcast.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">From the perspective of old man him,<br>he only had one real choice, Become a Philosopher, and and make those who spread hate the outcasts.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">He needed to become someone capable of inspiring his family to Wisdom,<br>and away from that which is not worthy of us.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">He had an opportunity to become a Philosopher, and change the world,<br>but he became a bully, that to me, is a big of a tragedy as the friend who got beat up by his father and instantly warped.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Do you see,<br>and are you able to see it in the strangers you came across in your lives.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">They are being pushed,<br>because they lack wisdom and experience.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The trick made by a family member looking for affirmation to their own hate,<br>or looking to simplify their own life.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I believe that every violent person,<br>had an opportunity to become a Philosopher, but it was stolen from them.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Violence, Division, and especially Hate,<br>are so incredibly alien to us, that it is like breathing toxic air.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Those things do not emerge in children,<br>they are put there, and always deliberately.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">It takes root because like cults it holds answers,<br>plugging up questions, and offering a target for hate.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Long before a child is made ill by a broken, mind warping idea,<br>there is a long stretch of time when they are more than capable of comprehending Greatness.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Restraint, Dignity, Nobility, Unbreakability, Fortitude, Courage, Honor, Love;<br>and Insight; and Foresight; and Understanding; and Authenticity; and Heroism.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">These are the ideas, that when taught early on,<br>will immunize against the easier wrong, and bring a young person a feeling of ennoblement for choosing the harder right.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Ladies and Gentlemen,<br>we are not divided, we are not different, we are one family.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">We are to repair schools, and end poverty,<br>and prevent the propagation of broken ideas that only give an impression of answers while keeping a person imprisoned within the invisible walls of hate.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Walls that prevent a person's Wisdom and Greatness,<br>from ever reaching the heights that are worthy of them.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">We are one,<br>one family under the sun.</div>\n  </div>\n</div>",
  "print": "<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Let us examine roots and gravity of young wisdom,<br>that which we come across, when we are still children.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">My first wisdom was in how I faced violence,<br>I nobly took no part in it, I only pushed people back, I never became like they were.</div>\n  <div class=\"paragraph\">And right here,<br>we have a wisdom that we can examine.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">My main bully was twisted and cunning,<br>likely instructed by his father.</div>\n  <div class=\"paragraph\">We used to be school friends,<br>and then he started fighting me for no reason.</div>\n  <div class=\"paragraph\">He didn't just attack me,<br>but turned everyone against me.</div>\n  <div class=\"paragraph\">He was probably a puppet,<br>in his father's sick game.</div>\n  <div class=\"paragraph\">And if not, then pretending to be hurt by someone,<br>was maybe his way of making friends.</div>\n  <div class=\"paragraph\">I remember when he was forced to share his glue in 4th grade,<br>when he got back a mangled tube he cried that his father would beat him.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">The change in that boy was irreversible,<br>his attacks continued, and at least in my view they were elaborate.</div>\n  <div class=\"paragraph\">This is a young person,<br>who became completely unreachable, and incapable of reason, possibly emotion.</div>\n  <div class=\"paragraph\">He was a normal person at first,<br>but then became warped, and to me he became a monster.</div>\n  <div class=\"paragraph\">Whatever happened to him in the span of a day or two,<br>happened because he was too young to see he was being manipulated or warped.</div>\n  <div class=\"paragraph\">If that event could have been prevented,<br>he would continue growing up like a normal boring person.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Even though this was fourth grade,<br>we were perfectly capable of spotting trouble.</div>\n  <div class=\"paragraph\">Whatever got him, was invisible to him,<br>his father most likely, used his lack of experience to warp him.</div>\n  <div class=\"paragraph\">As he started making friends and perhaps spreading whatever lies about me,<br>it was more advantageous to him to remain a bully that plays a victim.</div>\n  <div class=\"paragraph\">His father was no longer needed,<br>he entered a different life line.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">He and his friends, eventually got caught lying,<br>and the school psychologist who intervened in me pushing him away the last time.</div>\n  <div class=\"paragraph\">Cracked the case, as two of his friends were supporting his side of the story,<br>and she made them confess the truth.</div>\n  <div class=\"paragraph\">The young Psychologist woman came into the class room,<br>put her hand on my shoulder and said everything is going to be OK.</div>\n  <div class=\"paragraph\">But my class was manipulated by the boy,<br>few minutes later, one of the smart girls that I grew up with said that they didn't want me in the class room.</div>\n  <div class=\"paragraph\">They saw me as the bully that starts fights,<br>the final skirmish begun as I was trying to save the class comedian from getting beat up.</div>\n  <div class=\"paragraph\">To my surprise both of them started fighting me,<br>and the main bully joined in.</div>\n  <div class=\"paragraph\">I grew up surrounded by bullies,<br>I had no trouble getting them away from me.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">The friends of the bully got together few days later,<br>and started kicking and spitting on me on our way back from school.</div>\n  <div class=\"paragraph\">It was between eight and twelve of them,<br>as I was getting up maybe for the fourth time as they kept pushing me off balance.</div>\n  <div class=\"paragraph\">With the concrete of the sidewalk digging into my fists,<br>I understood how powerful I have become for not fighting them back.</div>\n  <div class=\"paragraph\">To me they were opportunistic predators,<br>some would come to kick when I was down others waited to knock me down again.</div>\n  <div class=\"paragraph\">Eventually they got tired,<br>and allowed me to walk away without anymore shoving.</div>\n  <div class=\"paragraph\">I took a different path,<br>and started crying, not because I was hurt, but because how alone I was.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">The main bully had another wave come in,<br>this time it was older kids that were five years older.</div>\n  <div class=\"paragraph\">They made a circle around me and one of them kicked me in the head,<br>it was a spin kick no doubt, it didn't hurt.</div>\n  <div class=\"paragraph\">But fighting older kids that I have not really seen before,<br>and seeing that they had outside clothes on, I stayed down.</div>\n  <div class=\"paragraph\">No one came to help, the girls saw the whole thing bu they didn't come to help,<br>I think everyone was just sacred of older kids.</div>\n  <div class=\"paragraph\">I wasn't hurt, I was just not moving,<br>this was Russian language class, and the teacher was mad that I was late.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">I stopped going to school as to me it became a circus,<br>then after few months I go punished and graduated fine, as the teachers didn't wan trouble.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Even though I lacked experience,<br>I still did all the right things.</div>\n  <div class=\"paragraph\">I didn't attack back, I stayed down,<br>when I could smell a knife in the skinhead-jacket pocket of one of the bullies.</div>\n  <div class=\"paragraph\">And set myself free from school,<br>by becoming a student of pixel art.</div>\n  <div class=\"paragraph\">I spent my time away from school at the biggest arcade in the city,<br>I didn't have money to play, but I loved watching other people play.</div>\n  <div class=\"paragraph\">My favorite games were <span>Asterix & Obelix<sup>[1]</sup></span>, and <span>The Simpsons<sup>[2]</sup></span>,<br>I liked <span>Blanka from Street Fighter II<sup>[3]</sup></span>, and I liked how technical Streetfighter was.</div>\n  <div class=\"paragraph\">When Wolfenstein 3D came out in Poland,<br>I was not impressed, 3D graphics destroyed Pixel Art, but Pixel Art will rule again someday.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">I had to make a choice to break away from everyone else,<br>as they were sick, or mislead.</div>\n  <div class=\"paragraph\">The boys in my class wanted to keep together,<br>sometime after the event I described, I've noticed them role playing boxing.</div>\n  <div class=\"paragraph\">They asked me if I wanted to fight too,<br>they were now honorable fighters in their head.</div>\n  <div class=\"paragraph\">They kept together, because nobody want to be alone,<br>b8ut that also meant that they were reinforcing each other's behavior; rather than acting on their wisdom.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Where I experienced power, strengths, wisdom and independence,<br>they were not growing up correctly, they were drifting in the direction of where the group was going.</div>\n  <div class=\"paragraph\">Sometimes I consider if mandatory military service that we had back then,<br>actually fueled violent behavior, in preparation for what seemed like more violence, but parents were causing most of the harm.</div>\n  <div class=\"paragraph\">I remember I had a choke hold put on me by another friend,<br>but I had no interest in hurting him to get out, his father who beat him with the hose from the washer, was teaching him how to fight.</div>\n  <div class=\"paragraph\">I probably caused the situation, but inflicting pain was not a healthy response on his part,<br>some years earlier he said that he wished he grew up watching horror movies so that he had no fear.</div>\n  <div class=\"paragraph\">There was another boy who was violent but never towards me, when his father found out that his grades were bad,<br>he took him to girls' restroom and beat him up - his personality change was instant - it was very visible and painful to watch even then.</div>\n  <div class=\"paragraph\">I remember him stealing stuff after that,<br>his father ruined his mind - though I think he is a good person now.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">I would have ran to help him if I was wiser,<br>if back then I knew what I know now, I would have sprinted to attack his father, to stop the boy from becoming a thief.</div>\n  <div class=\"paragraph\">With all I have learned from the bullies,<br>I would take him down by sliding into his feat and punching his nose, really hard, as I was no stranger to nosebleeds.</div>\n  <div class=\"paragraph\">I'd tell the police that his father was hurting him,<br>and I was just protecting him.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">That's probably why the girls didn't need much convincing that I was a bully,<br>I was breaking up fights, to get the bullies to stop hurting people because I sensed what it meant, and I saw bullies make bullies.</div>\n  <div class=\"paragraph\">But it wasn't fighting,<br>just pushing the red faced snarling beasts back.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Do you now remember how there are these tiny events when we are young,<br>that dictate all the rest of our lives ahead?</div>\n  <div class=\"paragraph\">That's wisdom; not philosophy, education, schooling, cultures, heritage,<br>but the most powerful force there is: wisdom.</div>\n  <div class=\"paragraph\">It comes from our warrior nature,<br>but then it flourishes and grows to make us Great And Peaceful Philosophers.</div>\n  <div class=\"paragraph\">It is easily stunted by group think,<br>by doing what others do to satay with them as friend.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">But more than that, these tiny events in our youth also often mark points of no return,<br>at least not for a long while.</div>\n  <div class=\"paragraph\">I see myself as nothing if I took the disgusting path to be friends with the bullies,<br>who later ended up attacking one of the special needs girls, and again the other girls barely raised their voice, to their credit I remember it being raised.</div>\n  <div class=\"paragraph\">Hopefully they figured out the cool boys were monsters,<br>and to stay safe and away from them, and and protect their sister, special needs does not mean that someone is broken, just that they need real friends.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">I felt like an outsider, I didn't know I belonged anywhere,<br>I didn't know I could find that Psychologist lady that helped a year or two before to rain her amazing wrath, I didn't know to become friends with the Principal, or call the Police.</div>\n  <div class=\"paragraph\">I trust the girls that I grew up with to take care of her,<br>I just know they looked after her, we were a family together for almost a decade.</div>\n  <div class=\"paragraph\">When I left for America,<br>I was glad to leave the bullies behind.</div>\n  <div class=\"paragraph\">There was one more bully in Brooklyn,<br>but having watched NYPD Blue, I knew I could call the police, and to tell then not to press charges.</div>\n  <div class=\"paragraph\">NYPD broke up the gang,<br>the mothers stepped in.</div>\n  <div class=\"paragraph\">And right before I came to Michigan,<br>the bully barely whimpered \"Fuck Poles\".</div>\n  <div class=\"paragraph\">He was not racist, he was just made sick,<br>he didn't hate white people, so he picked the Polish people to hate something.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">He too had a an opportunity to go to the Library and search for wisdom,<br>rather than going to the boxing club to get good at fighting.</div>\n  <div class=\"paragraph\">In the 20 minute walk back from school,<br>he punched me maybe four times in the back of my head, full force, full theatrics.</div>\n  <div class=\"paragraph\">Once we made it to the street we lived on,<br>I finally turned around to his punches.</div>\n  <div class=\"paragraph\">I was ignoring them before, as I became an artist when it came to bullies,<br>we were maybe seventeen or so, and his boxing instructor was, bad.</div>\n  <div class=\"paragraph\">He opened up with a full volley with punches to my face,<br>it only made it red for long enough for NYPD Blue to get a full picture of what they need to do.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Like the bullies in Poland,<br>this boy needed wisdom.</div>\n  <div class=\"paragraph\">When his brother or cousin, or mad uncle was saying white people are crazy but poles are worse,<br>he needed to walk away from that conversation.</div>\n  <div class=\"paragraph\">Better yet,<br>here is what he needed to say to his stupid uncles face:</div>\n  <div class=\"paragraph\">Out of the night that covers me,<br> Black as the pit from pole to pole,<br>I thank whatever ides may be<br> For my unconquerable soul.</div>\n  <div class=\"paragraph\">In the fell clutch of circumstance<br> I have not winced nor cried aloud.<br>In the bludgeonings of chance<br> My head is bloodied, but unbowed.</div>\n  <div class=\"paragraph\">Beyond this place of wrath and tears<br> Looms but the Horror of the shade,<br>And yet the menace of the years<br> Finds and shall find me unafraid.</div>\n  <div class=\"paragraph\">It matters not how narrow the gate,<br> How charged with punishments the scroll,<br>I am the master of my fate,<br> I am the captain of my soul.</div>\n  <div class=\"paragraph\">In a a way all this boy needed was a poem,<br>a thing that would help him grow the necessary wisdom against hate.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">My bullies were monsters,<br>but they didn't hate, they relished inflicting pain, but they had no hate in them.</div>\n  <div class=\"paragraph\">This boy,<br>did get poisoned by it.</div>\n  <div class=\"paragraph\">I think the police to underline the gravity of the situation,<br>never told him I didn't press the charges, but just kind of left it hanging in the air.</div>\n  <div class=\"paragraph\">Hate of any kind of group of people as a teenager,<br>is a lot of evil to handle.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Rejection of hate requires a culture of wisdom very early on,<br>a young person must immediately reject divisions.</div>\n  <div class=\"paragraph\">In that case by Brooklyn Bully,<br>could chose to reject the family members that propagated hate, or permanently become a hater.</div>\n  <div class=\"paragraph\">Though his Mom would be proud,<br>the path of rejection of hate and division could make him an outcast.</div>\n  <div class=\"paragraph\">From the perspective of old man him,<br>he only had one real choice, Become a Philosopher, and and make those who spread hate the outcasts.</div>\n  <div class=\"paragraph\">He needed to become someone capable of inspiring his family to Wisdom,<br>and away from that which is not worthy of us.</div>\n  <div class=\"paragraph\">He had an opportunity to become a Philosopher, and change the world,<br>but he became a bully, that to me, is a big of a tragedy as the friend who got beat up by his father and instantly warped.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Do you see,<br>and are you able to see it in the strangers you came across in your lives.</div>\n  <div class=\"paragraph\">They are being pushed,<br>because they lack wisdom and experience.</div>\n  <div class=\"paragraph\">The trick made by a family member looking for affirmation to their own hate,<br>or looking to simplify their own life.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">I believe that every violent person,<br>had an opportunity to become a Philosopher, but it was stolen from them.</div>\n  <div class=\"paragraph\">Violence, Division, and especially Hate,<br>are so incredibly alien to us, that it is like breathing toxic air.</div>\n  <div class=\"paragraph\">Those things do not emerge in children,<br>they are put there, and always deliberately.</div>\n  <div class=\"paragraph\">It takes root because like cults it holds answers,<br>plugging up questions, and offering a target for hate.</div>\n  <div class=\"paragraph\">Long before a child is made ill by a broken, mind warping idea,<br>there is a long stretch of time when they are more than capable of comprehending Greatness.</div>\n  <div class=\"paragraph\">Restraint, Dignity, Nobility, Unbreakability, Fortitude, Courage, Honor, Love;<br>and Insight; and Foresight; and Understanding; and Authenticity; and Heroism.</div>\n  <div class=\"paragraph\">These are the ideas, that when taught early on,<br>will immunize against the easier wrong, and bring a young person a feeling of ennoblement for choosing the harder right.</div>\n  <div class=\"paragraph\">Ladies and Gentlemen,<br>we are not divided, we are not different, we are one family.</div>\n  <div class=\"paragraph\">We are to repair schools, and end poverty,<br>and prevent the propagation of broken ideas that only give an impression of answers while keeping a person imprisoned within the invisible walls of hate.</div>\n  <div class=\"paragraph\">Walls that prevent a person's Wisdom and Greatness,<br>from ever reaching the heights that are worthy of them.</div>\n  <div class=\"paragraph\">We are one,<br>one family under the sun.</div>\n</div>\n<div class=\"break-after\">&nbsp;</div>\n<div>\n  <div class=\"section\" style=\"padding-bottom: 1rem;\">References</div>\n  <div>[1]: https://www.youtube.com/watch?v=-LhEovW4Uqw</div>\n  <div>[2]: https://www.youtube.com/watch?v=S9DE-KyZnLc</div>\n  <div>[3]: https://www.youtube.com/watch?v=1eh417JtLm8</div>\n</div>",
  "text": "Let us examine roots and gravity of young wisdom,\nthat which we come across, when we are still children.\n\nMy first wisdom was in how I faced violence,\nI nobly took no part in it, I only pushed people back, I never became like they were.\nAnd right here,\nwe have a wisdom that we can examine.\n\nMy main bully was twisted and cunning,\nlikely instructed by his father.\nWe used to be school friends,\nand then he started fighting me for no reason.\nHe didn't just attack me,\nbut turned everyone against me.\nHe was probably a puppet,\nin his father's sick game.\nAnd if not, then pretending to be hurt by someone,\nwas maybe his way of making friends.\nI remember when he was forced to share his glue in 4th grade,\nwhen he got back a mangled tube he cried that his father would beat him.\n\nThe change in that boy was irreversible,\nhis attacks continued, and at least in my view they were elaborate.\nThis is a young person,\nwho became completely unreachable, and incapable of reason, possibly emotion.\nHe was a normal person at first,\nbut then became warped, and to me he became a monster.\nWhatever happened to him in the span of a day or two,\nhappened because he was too young to see he was being manipulated or warped.\nIf that event could have been prevented,\nhe would continue growing up like a normal boring person.\n\nEven though this was fourth grade,\nwe were perfectly capable of spotting trouble.\nWhatever got him, was invisible to him,\nhis father most likely, used his lack of experience to warp him.\nAs he started making friends and perhaps spreading whatever lies about me,\nit was more advantageous to him to remain a bully that plays a victim.\nHis father was no longer needed,\nhe entered a different life line.\n\nHe and his friends, eventually got caught lying,\nand the school psychologist who intervened in me pushing him away the last time.\nCracked the case, as two of his friends were supporting his side of the story,\nand she made them confess the truth.\nThe young Psychologist woman came into the class room,\nput her hand on my shoulder and said everything is going to be OK.\nBut my class was manipulated by the boy,\nfew minutes later, one of the smart girls that I grew up with said that they didn't want me in the class room.\nThey saw me as the bully that starts fights,\nthe final skirmish begun as I was trying to save the class comedian from getting beat up.\nTo my surprise both of them started fighting me,\nand the main bully joined in.\nI grew up surrounded by bullies,\nI had no trouble getting them away from me.\n\nThe friends of the bully got together few days later,\nand started kicking and spitting on me on our way back from school.\nIt was between eight and twelve of them,\nas I was getting up maybe for the fourth time as they kept pushing me off balance.\nWith the concrete of the sidewalk digging into my fists,\nI understood how powerful I have become for not fighting them back.\nTo me they were opportunistic predators,\nsome would come to kick when I was down others waited to knock me down again.\nEventually they got tired,\nand allowed me to walk away without anymore shoving.\nI took a different path,\nand started crying, not because I was hurt, but because how alone I was.\n\nThe main bully had another wave come in,\nthis time it was older kids that were five years older.\nThey made a circle around me and one of them kicked me in the head,\nit was a spin kick no doubt, it didn't hurt.\nBut fighting older kids that I have not really seen before,\nand seeing that they had outside clothes on, I stayed down.\nNo one came to help, the girls saw the whole thing bu they didn't come to help,\nI think everyone was just sacred of older kids.\nI wasn't hurt, I was just not moving,\nthis was Russian language class, and the teacher was mad that I was late.\n\nI stopped going to school as to me it became a circus,\nthen after few months I go punished and graduated fine, as the teachers didn't wan trouble.\n\nEven though I lacked experience,\nI still did all the right things.\nI didn't attack back, I stayed down,\nwhen I could smell a knife in the skinhead-jacket pocket of one of the bullies.\nAnd set myself free from school,\nby becoming a student of pixel art.\nI spent my time away from school at the biggest arcade in the city,\nI didn't have money to play, but I loved watching other people play.\nMy favorite games were Asterix & Obelix[1], and The Simpsons[2],\nI liked Blanka from Street Fighter II[3], and I liked how technical Streetfighter was.\nWhen Wolfenstein 3D came out in Poland,\nI was not impressed, 3D graphics destroyed Pixel Art, but Pixel Art will rule again someday.\n\nI had to make a choice to break away from everyone else,\nas they were sick, or mislead.\nThe boys in my class wanted to keep together,\nsometime after the event I described, I've noticed them role playing boxing.\nThey asked me if I wanted to fight too,\nthey were now honorable fighters in their head.\nThey kept together, because nobody want to be alone,\nb8ut that also meant that they were reinforcing each other's behavior; rather than acting on their wisdom.\n\nWhere I experienced power, strengths, wisdom and independence,\nthey were not growing up correctly, they were drifting in the direction of where the group was going.\nSometimes I consider if mandatory military service that we had back then,\nactually fueled violent behavior, in preparation for what seemed like more violence, but parents were causing most of the harm.\nI remember I had a choke hold put on me by another friend,\nbut I had no interest in hurting him to get out, his father who beat him with the hose from the washer, was teaching him how to fight.\nI probably caused the situation, but inflicting pain was not a healthy response on his part,\nsome years earlier he said that he wished he grew up watching horror movies so that he had no fear.\nThere was another boy who was violent but never towards me, when his father found out that his grades were bad,\nhe took him to girls' restroom and beat him up - his personality change was instant - it was very visible and painful to watch even then.\nI remember him stealing stuff after that,\nhis father ruined his mind - though I think he is a good person now.\n\nI would have ran to help him if I was wiser,\nif back then I knew what I know now, I would have sprinted to attack his father, to stop the boy from becoming a thief.\nWith all I have learned from the bullies,\nI would take him down by sliding into his feat and punching his nose, really hard, as I was no stranger to nosebleeds.\nI'd tell the police that his father was hurting him,\nand I was just protecting him.\n\nThat's probably why the girls didn't need much convincing that I was a bully,\nI was breaking up fights, to get the bullies to stop hurting people because I sensed what it meant, and I saw bullies make bullies.\nBut it wasn't fighting,\njust pushing the red faced snarling beasts back.\n\nDo you now remember how there are these tiny events when we are young,\nthat dictate all the rest of our lives ahead?\nThat's wisdom; not philosophy, education, schooling, cultures, heritage,\nbut the most powerful force there is: wisdom.\nIt comes from our warrior nature,\nbut then it flourishes and grows to make us Great And Peaceful Philosophers.\nIt is easily stunted by group think,\nby doing what others do to satay with them as friend.\n\nBut more than that, these tiny events in our youth also often mark points of no return,\nat least not for a long while.\nI see myself as nothing if I took the disgusting path to be friends with the bullies,\nwho later ended up attacking one of the special needs girls, and again the other girls barely raised their voice, to their credit I remember it being raised.\nHopefully they figured out the cool boys were monsters,\nand to stay safe and away from them, and and protect their sister, special needs does not mean that someone is broken, just that they need real friends.\n\nI felt like an outsider, I didn't know I belonged anywhere,\nI didn't know I could find that Psychologist lady that helped a year or two before to rain her amazing wrath, I didn't know to become friends with the Principal, or call the Police.\nI trust the girls that I grew up with to take care of her,\nI just know they looked after her, we were a family together for almost a decade.\nWhen I left for America,\nI was glad to leave the bullies behind.\nThere was one more bully in Brooklyn,\nbut having watched NYPD Blue, I knew I could call the police, and to tell then not to press charges.\nNYPD broke up the gang,\nthe mothers stepped in.\nAnd right before I came to Michigan,\nthe bully barely whimpered \"Fuck Poles\".\nHe was not racist, he was just made sick,\nhe didn't hate white people, so he picked the Polish people to hate something.\n\nHe too had a an opportunity to go to the Library and search for wisdom,\nrather than going to the boxing club to get good at fighting.\nIn the 20 minute walk back from school,\nhe punched me maybe four times in the back of my head, full force, full theatrics.\nOnce we made it to the street we lived on,\nI finally turned around to his punches.\nI was ignoring them before, as I became an artist when it came to bullies,\nwe were maybe seventeen or so, and his boxing instructor was, bad.\nHe opened up with a full volley with punches to my face,\nit only made it red for long enough for NYPD Blue to get a full picture of what they need to do.\n\nLike the bullies in Poland,\nthis boy needed wisdom.\nWhen his brother or cousin, or mad uncle was saying white people are crazy but poles are worse,\nhe needed to walk away from that conversation.\nBetter yet,\nhere is what he needed to say to his stupid uncles face:\nOut of the night that covers me,\nBlack as the pit from pole to pole,\nI thank whatever ides may be\nFor my unconquerable soul.\nIn the fell clutch of circumstance\nI have not winced nor cried aloud.\nIn the bludgeonings of chance\nMy head is bloodied, but unbowed.\nBeyond this place of wrath and tears\nLooms but the Horror of the shade,\nAnd yet the menace of the years\nFinds and shall find me unafraid.\nIt matters not how narrow the gate,\nHow charged with punishments the scroll,\nI am the master of my fate,\nI am the captain of my soul.\nIn a a way all this boy needed was a poem,\na thing that would help him grow the necessary wisdom against hate.\n\nMy bullies were monsters,\nbut they didn't hate, they relished inflicting pain, but they had no hate in them.\nThis boy,\ndid get poisoned by it.\nI think the police to underline the gravity of the situation,\nnever told him I didn't press the charges, but just kind of left it hanging in the air.\nHate of any kind of group of people as a teenager,\nis a lot of evil to handle.\n\nRejection of hate requires a culture of wisdom very early on,\na young person must immediately reject divisions.\nIn that case by Brooklyn Bully,\ncould chose to reject the family members that propagated hate, or permanently become a hater.\nThough his Mom would be proud,\nthe path of rejection of hate and division could make him an outcast.\nFrom the perspective of old man him,\nhe only had one real choice, Become a Philosopher, and and make those who spread hate the outcasts.\nHe needed to become someone capable of inspiring his family to Wisdom,\nand away from that which is not worthy of us.\nHe had an opportunity to become a Philosopher, and change the world,\nbut he became a bully, that to me, is a big of a tragedy as the friend who got beat up by his father and instantly warped.\n\nDo you see,\nand are you able to see it in the strangers you came across in your lives.\nThey are being pushed,\nbecause they lack wisdom and experience.\nThe trick made by a family member looking for affirmation to their own hate,\nor looking to simplify their own life.\n\nI believe that every violent person,\nhad an opportunity to become a Philosopher, but it was stolen from them.\nViolence, Division, and especially Hate,\nare so incredibly alien to us, that it is like breathing toxic air.\nThose things do not emerge in children,\nthey are put there, and always deliberately.\nIt takes root because like cults it holds answers,\nplugging up questions, and offering a target for hate.\nLong before a child is made ill by a broken, mind warping idea,\nthere is a long stretch of time when they are more than capable of comprehending Greatness.\nRestraint, Dignity, Nobility, Unbreakability, Fortitude, Courage, Honor, Love;\nand Insight; and Foresight; and Understanding; and Authenticity; and Heroism.\nThese are the ideas, that when taught early on,\nwill immunize against the easier wrong, and bring a young person a feeling of ennoblement for choosing the harder right.\nLadies and Gentlemen,\nwe are not divided, we are not different, we are one family.\nWe are to repair schools, and end poverty,\nand prevent the propagation of broken ideas that only give an impression of answers while keeping a person imprisoned within the invisible walls of hate.\nWalls that prevent a person's Wisdom and Greatness,\nfrom ever reaching the heights that are worthy of them.\nWe are one,\none family under the sun.\n\nReferences\n[1]: https://www.youtube.com/watch?v=-LhEovW4Uqw\n[2]: https://www.youtube.com/watch?v=S9DE-KyZnLc\n[3]: https://www.youtube.com/watch?v=1eh417JtLm8",
  "images": [],
  "links": [
    {
      "title": "Asterix & Obelix",
      "url": "https://www.youtube.com/watch?v=-LhEovW4Uqw",
      "hostname": "www.youtube.com"
    },
    {
      "title": "The Simpsons",
      "url": "https://www.youtube.com/watch?v=S9DE-KyZnLc",
      "hostname": "www.youtube.com"
    },
    {
      "title": "Blanka from Street Fighter II",
      "url": "https://www.youtube.com/watch?v=1eh417JtLm8",
      "hostname": "www.youtube.com"
    }
  ]
}