{
  "name": "furkies-purrkies-poetry-0582",
  "id": "furkies-purrkies-poetry-0582",
  "title": "La Liberté Éclairant Le Monde: From Generation To Generation, or Recognizing Indoctrination",
  "date": "2021-10-03T15:10:39.955Z",
  "image": "poetry-0582-illustration.jpg",
  "artwork": "https://unsplash.com/photos/vq5YcQnWhtg",
  "audio": "poetry-0582.mp3",
  "html": "<div class=\"section\">\n  <p>(La Liberté Éclairant Le Monde is French for Liberty Enlightening the World)</p>\n  <p>It is unclear if parents understand the way children do,<br>it may not be the blight of indoctrination alone that holds us back.</p>\n  <p>It maybe that children are so much smarter,<br>and parents so burdened with poverty and confusion, that <strong>everything</strong> is lost in translation.</p>\n  <p>Parents know schools are broken, they know their grades were fake,<br>and yet, in their slumber, they send their children towards the same things.</p>\n  <p>The children eventually let go of their intelligence, brilliance, and genius,<br>because they can see it interferes with grades, and may even cause <a href=\"https://www.youtube.com/watch?v=8vHzUTtmbAM\">dread (TRIGGER WARNING)</a>.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Every child is a genius, even if that wasn't true - which it is,<br>there are infinite ways to get at science or music composition, and leadership, or entrepreneurship.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>We are extremely adaptive,<br>we are not rocks thrown into water.</p>\n  <p>But, if we are taught that reality is something other than it really is,<br>then the sacred space in which we do our decision making is - violated, and we become hijacked, and it becomes unstable.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>I always had trouble understanding how someone can cause harm, or commit a crime,<br>and I came to conclude that a criminal pulls the trigger for the same reason that soldiers around the world do.</p>\n  <p>Their view of reality is often permanently warped,<br>and they are under some pressure, and influence.</p>\n  <p>It could be influence of alcohol or worse,<br>but also it can be the influence of being court marshaled or even yelled at by someone in control of their existence.</p>\n  <p>I immediately realized that criminals are indoctrinated into crime,<br>this religion of crime, is not exactly emergent, it does not exactly come out of nowhere.</p>\n  <p>It comes out of poverty, from having parents who drink or do drugs because they can't make their way out of their poverty,<br>and then the threat of the neighborhood bullies, which often, as far as survival goes, means both gangs and the police.</p>\n  <p>All those scary individuals that most people agree to keep in cages,<br>are actually just children who had their minds poisoned.</p>\n  <p>I wouldn't say that it is a permanent poisoning,<br>I feel that psychologists know this.</p>\n  <p>And they also know that by keeping people in cages,<br>we make them worse.</p>\n  <p>And I know, that we make ourselves worse for it,<br>a criminal belongs in a Medical Institution specifically built to undo the damage caused by indoctrination.</p>\n  <p>Prisons poison the minds of criminals further,<br>what they need is understanding, support, hope, future, - you know real justice.</p>\n  <p>More than that, once they are placed into institutions that aren't sick torture,<br>they may not wish to return to be among the people that did this to them.</p>\n  <p>Because they will see us ab being indoctrinated into a culture of Retribution and Torture,<br>the criminals that recover, will see the people who were once OK with torturing them as very sick in deed.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>I was always confused about how people can run around with guns, rob apartments, steel cars,<br>I understand what is wrong with them.</p>\n  <p>Their minds have been hijacked,<br>they are just victims of indoctrination into the culture of crime.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Crime is a particularly potent example of the power of indoctrination,<br>which frequently can be explained as \"Acting against themselves\".</p>\n  <p>But indoctrination is everywhere,<br>meaning that people are doing things that they think are meaningful, but actually they are just hurting themselves or the world.</p>\n  <p>Take the other end of the crime spectrum, <a href=\"https://www.youtube.com/watch?v=DrfZuPFrH8A\">a cop planting evidence on a known criminal</a> that should be in jail,<br>the cop was brought up in a culture of putting criminals in cages, the criminal was brought up in a culture of crime.</p>\n  <p>They are both wrong, they are both just little spinning tops wound up by their indoctrination,<br>in very desperate need of psychological help, but round and round they go.</p>\n  <p>In a more advanced civilization, all the parties involved here and their families would be relocated,<br>given a bright new start at life, and over and over again, until they became free of their psychological indoctrination.</p>\n  <p>Their new lives would include expensive housing, free money from an Advanced Universal Income program,<br>and room to take to education, and eventually helping others out of their indoctrination.</p>\n  <p>See a primitive civilization punishes,<br>an advanced civilization looks to prevention and therapy - we have a lot of work to do.</p>\n  <p>Punishing the police officer would only destabilize them further,<br>and punishing those boys, who already have a stressful and desperate life, suffering addiction, debt, poverty, violence, will certainly make things worse.</p>\n  <p>There is no solution at the level our civilization is currently operating at,<br>the poor boys are suffering the same condition that otherwise reasonable men from Afghanistan who-dont-want-women-in-school are suffering from.</p>\n  <p>Their reality is warped, but they are fighting, tooth and nail, like the Great Warriors we all are,<br>except that the warping of their reality is making them hurt themselves.</p>\n  <p>Often self harm becomes apparent, far too late, when one of those boys becomes a father,<br>and watches their son become like they are...</p>\n  <p>Except now the father gained a grasp on the invisible prison of cultural and psychological indoctrination he was born into,<br>and is now <a href=\"https://www.youtube.com/watch?v=zk--XN4ozr8\">crying that he does not want his son to be like him</a>.</p>\n  <p>See, once indoctrination is removed, bullies and thugs,<br>will slowly being self repair.</p>\n  <p>Their past life does not stand, in their way towards greatness,<br>we stand in their way.</p>\n  <p>By sentencing a person stricken by indoctrination into years in prison,<br>we only make things worse, we hurt them further.</p>\n  <p>I believe it was The Great Michelle Alexander that described a Judge crying,<br>for tearing a family apart, because the father did not break out of his indoctrination fast enough, and ended up being sentenced to prison.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>We must ask, how can we help these men out of their indoctrination sooner,<br>and eventually we will find that indoctrination is best prevented.</p>\n  <p>One of the major components of Prevention,<br>is ending poverty, granting the entire family Access to Free Money, and Advanced Universal Income.</p>\n  <p>No sum in particular,<br>just a respectful and very generous daily spending limit.</p>\n  <p>This will go a long way, but the process of un-indoctrination,<br>is brittle, requires decades of therapy and re-education.</p>\n  <p>While prevention comes with a clear guarantee,<br>a person already hurt by long therm indoctrination, requires special treatment, preferential treatment.</p>\n  <p>It is our misuse of the idea of money, and tolerance of the sick punishment of prisons,<br>that fractures people, that induces the emergence of broken cultures, and repeatedly indoctrinates participants.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>At this stage of the development of our civilization,<br>Recognition of Indoctrination is the next step.</p>\n  <p>Once people being recognizing indoctrination,<br>once they begin seeing its incredible and negative effects on people.</p>\n  <p>It will become clear,<br>that changes are required.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>The first step, that you can take as a Politician, Teacher, or Parent, or Leader, or best yet Writer and Narrator,<br>is simply to explain to children why people do bad things:</p>\n  <p>They do bad things because the world they think they know is not real,<br>so even though all they are trying to do is good things, like putting food on their table, or keeping their family of neighborhood safe.</p>\n  <p>Those things are transformed by the thick layer of the fake reality that is poisoning and suffocating and crushing them,<br>and what looks to them like the right things to do inside their poisoned world, is actually a very bad thing out in our world.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Here is an opportunity to explain the urgency of real education:<br>so that we don't end up being poisoned and suffocated, and crushed by warped reality.</p>\n  <p>We MUST! caution the children about fake or ineffective education,<br>as invisible prison walls are extremely hard to see.</p>\n  <p>We have to teach the children to get up at the end of class and say:<br>\"Hey Ms. Shmumps, but I didn't learn anything in your class today\".</p>\n  <p>We have to teach them to recognize fake education,<br>and we know what that is like: as many of us graduated without anything to show for it, certainty nothing we couldn't learn on our own in a fraction of the time.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Indoctrination is everywhere, most of us were a victim once,<br>be it religions or fake schools, or paid colleges, or military service, or being forced to cleaning gas station toilets as a teenager to make some money.</p>\n  <p>You are ABSOLUTELY not allowed to work jobs like that,<br>if it was their idea tell your parents to do it - you study Art, Music Compositions or Industrial Design, and don't bother with school focus on your Portfolio.</p>\n  <p>If you are being forced into a life like that,<br>it maybe an idea to take off for the Appalachian Trail, Pacific Crest Trail, or The Continental Divide Trail/</p>\n  <p>Here, nature alone will explain to you how Noble and Dignified you are,<br>you are not to stay in your parents poverty, you have to learn and rise.</p>\n  <p>You are meant to become a Great Being,<br>you are always meant to grow up for better, never for the same or worse.</p>\n  <p>Indoctrination is both (self) emergent such as we find in high crime neighborhoods,<br>and it is designed such as we find in cults, religions and churches.</p>\n  <p>The pattern is hard to see as it is stretched across life,<br>and it always benefits you a little and it takes a lot in the end.</p>\n  <p>Examples are many,<br>Fraudulent churches around the world.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Supreme Court rulings protecting parents' right to religion,<br>whilst <a href=\"https://www.youtube.com/watch?v=yQUN_6XKKVs\">sacrificing their children's right to reality</a>.</p>\n  <p>How can we silently tolerate organizations that speak out against reason and fact,<br>to substitute reality with a drugged up version where the good stuff happens after death.</p>\n  <p>The Supreme Court rulings must consider multi-generational impact,<br>the rulings must be made in context of hundreds of years, not in context of browny points.</p>\n  <p>To be clear, let the adults have their fantasy lifestyles if that is what they want,<br>but don't let them warp the minds of the children by presenting a false reality - and what a truly evil deed that is.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Moreover, we have ask ourselves if we want leadership,<br>who is not of the mindset that is based on reality.</p>\n  <p>It makes perfect sense for a religious person,<br>to think that a religious father can remove a child from eight grade to teach them more about religion.</p>\n  <p>But a well educated person, who is invested in fact, data, science, evidence,<br>will perceive <a href=\"https://www.youtube.com/watch?v=c0_A7Z6JKaY\">indoctrinating children into religions as abuse</a>.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>The blight of poverty that we drowned the world in,<br>by failing to make money work for us and making it work against us instead, is another kind of emergent indoctrination.</p>\n  <p>The modern cultures finally figured out that we are all born equal,<br>and yet we still force children into the poverty of their parents.</p>\n  <p>That is not what equal means, equality means that at birth a child is given enough money,<br>to afford effective tutors that truly teach Knowledge and Wisdom, enough money to own a home, dream about family, and never fear hunger.</p>\n  <p>Do. you. not. understand that when you threaten children with military or poverty or some dumb ass idea of hell,<br>they give up their genius - how do you not see that?</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Fake education where teachers feed on paychecks like vampires,<br>just to push children to schools that charge even more once they are old enough to work.</p>\n  <p>How can sustaining ineffective education until something is done to fix it,<br>be presented as a justification for propagation of fake schooling.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>The tolerance of Recruiting soldiers with action-movie like commercials and the promise of free education,<br>among the groups of kids who have not lived long enough to coalesce their knowledge into wisdom is another form of indoctrination.</p>\n  <p>Military recruitment to oil machinery of war with minds and bodies,<br>is what real schools and cultures of wisdom were supposed to help us rise from.</p>\n  <p>A military that takes no interest in helping the world rise out of dark ages,<br>is a military that is not interested in peace.</p>\n  <p>Wars cannot be won by waging more wars,<br>not can nations be pacified with propaganda, indoctrination, and fantasies.</p>\n  <p>Only wisdom can bring World Peace,<br>only education that truly works, equality that is actually meaningful in context of entire lives.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Know that Narrated Books about real lives and real wisdom of beings who made a positive and lasting impact on the modern world,<br>are a good source of wisdom.</p>\n  <p>Use the Library, try not to let people make money from the misfortune of fake education,<br>but hurry find your way to thousands of meaningful books, as that is the education that has been denied to us all.</p>\n  <p>--</p>\n  <p>Learn to recognize Indoctrination,<br>use the idea of indoctrination as a tool to understand broken and often unfixable things.</p>\n  <p>Know, that preventing of fracturing is the noblest way,<br>our civilization must embrace prevention as the most humane way to end mistakes.</p>\n  <p>And above all, break out of whatever invisible walls maybe surrounding you,<br>use it as a key, to set yourself and the world free.</p>\n  <p>You are meant to become,<br>a Great Being.</p>\n</div>",
  "bootstrap": "<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">(La Liberté Éclairant Le Monde is French for Liberty Enlightening the World)</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">It is unclear if parents understand the way children do,<br>it may not be the blight of indoctrination alone that holds us back.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">It maybe that children are so much smarter,<br>and parents so burdened with poverty and confusion, that <strong>everything</strong> is lost in translation.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Parents know schools are broken, they know their grades were fake,<br>and yet, in their slumber, they send their children towards the same things.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The children eventually let go of their intelligence, brilliance, and genius,<br>because they can see it interferes with grades, and may even cause <a href=\"https://www.youtube.com/watch?v=8vHzUTtmbAM\">dread (TRIGGER WARNING)</a>.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Every child is a genius, even if that wasn't true - which it is,<br>there are infinite ways to get at science or music composition, and leadership, or entrepreneurship.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">We are extremely adaptive,<br>we are not rocks thrown into water.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">But, if we are taught that reality is something other than it really is,<br>then the sacred space in which we do our decision making is - violated, and we become hijacked, and it becomes unstable.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I always had trouble understanding how someone can cause harm, or commit a crime,<br>and I came to conclude that a criminal pulls the trigger for the same reason that soldiers around the world do.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Their view of reality is often permanently warped,<br>and they are under some pressure, and influence.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">It could be influence of alcohol or worse,<br>but also it can be the influence of being court marshaled or even yelled at by someone in control of their existence.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I immediately realized that criminals are indoctrinated into crime,<br>this religion of crime, is not exactly emergent, it does not exactly come out of nowhere.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">It comes out of poverty, from having parents who drink or do drugs because they can't make their way out of their poverty,<br>and then the threat of the neighborhood bullies, which often, as far as survival goes, means both gangs and the police.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">All those scary individuals that most people agree to keep in cages,<br>are actually just children who had their minds poisoned.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I wouldn't say that it is a permanent poisoning,<br>I feel that psychologists know this.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">And they also know that by keeping people in cages,<br>we make them worse.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">And I know, that we make ourselves worse for it,<br>a criminal belongs in a Medical Institution specifically built to undo the damage caused by indoctrination.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Prisons poison the minds of criminals further,<br>what they need is understanding, support, hope, future, - you know real justice.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">More than that, once they are placed into institutions that aren't sick torture,<br>they may not wish to return to be among the people that did this to them.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Because they will see us ab being indoctrinated into a culture of Retribution and Torture,<br>the criminals that recover, will see the people who were once OK with torturing them as very sick in deed.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I was always confused about how people can run around with guns, rob apartments, steel cars,<br>I understand what is wrong with them.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Their minds have been hijacked,<br>they are just victims of indoctrination into the culture of crime.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Crime is a particularly potent example of the power of indoctrination,<br>which frequently can be explained as \"Acting against themselves\".</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">But indoctrination is everywhere,<br>meaning that people are doing things that they think are meaningful, but actually they are just hurting themselves or the world.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Take the other end of the crime spectrum, <a href=\"https://www.youtube.com/watch?v=DrfZuPFrH8A\">a cop planting evidence on a known criminal</a> that should be in jail,<br>the cop was brought up in a culture of putting criminals in cages, the criminal was brought up in a culture of crime.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">They are both wrong, they are both just little spinning tops wound up by their indoctrination,<br>in very desperate need of psychological help, but round and round they go.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">In a more advanced civilization, all the parties involved here and their families would be relocated,<br>given a bright new start at life, and over and over again, until they became free of their psychological indoctrination.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Their new lives would include expensive housing, free money from an Advanced Universal Income program,<br>and room to take to education, and eventually helping others out of their indoctrination.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">See a primitive civilization punishes,<br>an advanced civilization looks to prevention and therapy - we have a lot of work to do.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Punishing the police officer would only destabilize them further,<br>and punishing those boys, who already have a stressful and desperate life, suffering addiction, debt, poverty, violence, will certainly make things worse.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">There is no solution at the level our civilization is currently operating at,<br>the poor boys are suffering the same condition that otherwise reasonable men from Afghanistan who-dont-want-women-in-school are suffering from.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Their reality is warped, but they are fighting, tooth and nail, like the Great Warriors we all are,<br>except that the warping of their reality is making them hurt themselves.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Often self harm becomes apparent, far too late, when one of those boys becomes a father,<br>and watches their son become like they are...</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Except now the father gained a grasp on the invisible prison of cultural and psychological indoctrination he was born into,<br>and is now <a href=\"https://www.youtube.com/watch?v=zk--XN4ozr8\">crying that he does not want his son to be like him</a>.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">See, once indoctrination is removed, bullies and thugs,<br>will slowly being self repair.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Their past life does not stand, in their way towards greatness,<br>we stand in their way.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">By sentencing a person stricken by indoctrination into years in prison,<br>we only make things worse, we hurt them further.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I believe it was The Great Michelle Alexander that described a Judge crying,<br>for tearing a family apart, because the father did not break out of his indoctrination fast enough, and ended up being sentenced to prison.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">We must ask, how can we help these men out of their indoctrination sooner,<br>and eventually we will find that indoctrination is best prevented.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">One of the major components of Prevention,<br>is ending poverty, granting the entire family Access to Free Money, and Advanced Universal Income.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">No sum in particular,<br>just a respectful and very generous daily spending limit.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">This will go a long way, but the process of un-indoctrination,<br>is brittle, requires decades of therapy and re-education.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">While prevention comes with a clear guarantee,<br>a person already hurt by long therm indoctrination, requires special treatment, preferential treatment.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">It is our misuse of the idea of money, and tolerance of the sick punishment of prisons,<br>that fractures people, that induces the emergence of broken cultures, and repeatedly indoctrinates participants.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">At this stage of the development of our civilization,<br>Recognition of Indoctrination is the next step.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Once people being recognizing indoctrination,<br>once they begin seeing its incredible and negative effects on people.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">It will become clear,<br>that changes are required.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The first step, that you can take as a Politician, Teacher, or Parent, or Leader, or best yet Writer and Narrator,<br>is simply to explain to children why people do bad things:</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">They do bad things because the world they think they know is not real,<br>so even though all they are trying to do is good things, like putting food on their table, or keeping their family of neighborhood safe.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Those things are transformed by the thick layer of the fake reality that is poisoning and suffocating and crushing them,<br>and what looks to them like the right things to do inside their poisoned world, is actually a very bad thing out in our world.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Here is an opportunity to explain the urgency of real education:<br>so that we don't end up being poisoned and suffocated, and crushed by warped reality.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">We MUST! caution the children about fake or ineffective education,<br>as invisible prison walls are extremely hard to see.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">We have to teach the children to get up at the end of class and say:<br>\"Hey Ms. Shmumps, but I didn't learn anything in your class today\".</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">We have to teach them to recognize fake education,<br>and we know what that is like: as many of us graduated without anything to show for it, certainty nothing we couldn't learn on our own in a fraction of the time.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Indoctrination is everywhere, most of us were a victim once,<br>be it religions or fake schools, or paid colleges, or military service, or being forced to cleaning gas station toilets as a teenager to make some money.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">You are ABSOLUTELY not allowed to work jobs like that,<br>if it was their idea tell your parents to do it - you study Art, Music Compositions or Industrial Design, and don't bother with school focus on your Portfolio.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">If you are being forced into a life like that,<br>it maybe an idea to take off for the Appalachian Trail, Pacific Crest Trail, or The Continental Divide Trail/</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Here, nature alone will explain to you how Noble and Dignified you are,<br>you are not to stay in your parents poverty, you have to learn and rise.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">You are meant to become a Great Being,<br>you are always meant to grow up for better, never for the same or worse.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Indoctrination is both (self) emergent such as we find in high crime neighborhoods,<br>and it is designed such as we find in cults, religions and churches.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The pattern is hard to see as it is stretched across life,<br>and it always benefits you a little and it takes a lot in the end.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Examples are many,<br>Fraudulent churches around the world.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Supreme Court rulings protecting parents' right to religion,<br>whilst <a href=\"https://www.youtube.com/watch?v=yQUN_6XKKVs\">sacrificing their children's right to reality</a>.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">How can we silently tolerate organizations that speak out against reason and fact,<br>to substitute reality with a drugged up version where the good stuff happens after death.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The Supreme Court rulings must consider multi-generational impact,<br>the rulings must be made in context of hundreds of years, not in context of browny points.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">To be clear, let the adults have their fantasy lifestyles if that is what they want,<br>but don't let them warp the minds of the children by presenting a false reality - and what a truly evil deed that is.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Moreover, we have ask ourselves if we want leadership,<br>who is not of the mindset that is based on reality.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">It makes perfect sense for a religious person,<br>to think that a religious father can remove a child from eight grade to teach them more about religion.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">But a well educated person, who is invested in fact, data, science, evidence,<br>will perceive <a href=\"https://www.youtube.com/watch?v=c0_A7Z6JKaY\">indoctrinating children into religions as abuse</a>.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The blight of poverty that we drowned the world in,<br>by failing to make money work for us and making it work against us instead, is another kind of emergent indoctrination.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The modern cultures finally figured out that we are all born equal,<br>and yet we still force children into the poverty of their parents.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">That is not what equal means, equality means that at birth a child is given enough money,<br>to afford effective tutors that truly teach Knowledge and Wisdom, enough money to own a home, dream about family, and never fear hunger.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Do. you. not. understand that when you threaten children with military or poverty or some dumb ass idea of hell,<br>they give up their genius - how do you not see that?</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Fake education where teachers feed on paychecks like vampires,<br>just to push children to schools that charge even more once they are old enough to work.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">How can sustaining ineffective education until something is done to fix it,<br>be presented as a justification for propagation of fake schooling.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The tolerance of Recruiting soldiers with action-movie like commercials and the promise of free education,<br>among the groups of kids who have not lived long enough to coalesce their knowledge into wisdom is another form of indoctrination.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Military recruitment to oil machinery of war with minds and bodies,<br>is what real schools and cultures of wisdom were supposed to help us rise from.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">A military that takes no interest in helping the world rise out of dark ages,<br>is a military that is not interested in peace.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Wars cannot be won by waging more wars,<br>not can nations be pacified with propaganda, indoctrination, and fantasies.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Only wisdom can bring World Peace,<br>only education that truly works, equality that is actually meaningful in context of entire lives.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Know that Narrated Books about real lives and real wisdom of beings who made a positive and lasting impact on the modern world,<br>are a good source of wisdom.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Use the Library, try not to let people make money from the misfortune of fake education,<br>but hurry find your way to thousands of meaningful books, as that is the education that has been denied to us all.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">--</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Learn to recognize Indoctrination,<br>use the idea of indoctrination as a tool to understand broken and often unfixable things.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Know, that preventing of fracturing is the noblest way,<br>our civilization must embrace prevention as the most humane way to end mistakes.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">And above all, break out of whatever invisible walls maybe surrounding you,<br>use it as a key, to set yourself and the world free.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">You are meant to become,<br>a Great Being.</div>\n  </div>\n</div>",
  "print": "<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">(La Liberté Éclairant Le Monde is French for Liberty Enlightening the World)</div>\n  <div class=\"paragraph\">It is unclear if parents understand the way children do,<br>it may not be the blight of indoctrination alone that holds us back.</div>\n  <div class=\"paragraph\">It maybe that children are so much smarter,<br>and parents so burdened with poverty and confusion, that <strong>everything</strong> is lost in translation.</div>\n  <div class=\"paragraph\">Parents know schools are broken, they know their grades were fake,<br>and yet, in their slumber, they send their children towards the same things.</div>\n  <div class=\"paragraph\">The children eventually let go of their intelligence, brilliance, and genius,<br>because they can see it interferes with grades, and may even cause <span>dread (TRIGGER WARNING)<sup>[1]</sup></span>.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Every child is a genius, even if that wasn't true - which it is,<br>there are infinite ways to get at science or music composition, and leadership, or entrepreneurship.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">We are extremely adaptive,<br>we are not rocks thrown into water.</div>\n  <div class=\"paragraph\">But, if we are taught that reality is something other than it really is,<br>then the sacred space in which we do our decision making is - violated, and we become hijacked, and it becomes unstable.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">I always had trouble understanding how someone can cause harm, or commit a crime,<br>and I came to conclude that a criminal pulls the trigger for the same reason that soldiers around the world do.</div>\n  <div class=\"paragraph\">Their view of reality is often permanently warped,<br>and they are under some pressure, and influence.</div>\n  <div class=\"paragraph\">It could be influence of alcohol or worse,<br>but also it can be the influence of being court marshaled or even yelled at by someone in control of their existence.</div>\n  <div class=\"paragraph\">I immediately realized that criminals are indoctrinated into crime,<br>this religion of crime, is not exactly emergent, it does not exactly come out of nowhere.</div>\n  <div class=\"paragraph\">It comes out of poverty, from having parents who drink or do drugs because they can't make their way out of their poverty,<br>and then the threat of the neighborhood bullies, which often, as far as survival goes, means both gangs and the police.</div>\n  <div class=\"paragraph\">All those scary individuals that most people agree to keep in cages,<br>are actually just children who had their minds poisoned.</div>\n  <div class=\"paragraph\">I wouldn't say that it is a permanent poisoning,<br>I feel that psychologists know this.</div>\n  <div class=\"paragraph\">And they also know that by keeping people in cages,<br>we make them worse.</div>\n  <div class=\"paragraph\">And I know, that we make ourselves worse for it,<br>a criminal belongs in a Medical Institution specifically built to undo the damage caused by indoctrination.</div>\n  <div class=\"paragraph\">Prisons poison the minds of criminals further,<br>what they need is understanding, support, hope, future, - you know real justice.</div>\n  <div class=\"paragraph\">More than that, once they are placed into institutions that aren't sick torture,<br>they may not wish to return to be among the people that did this to them.</div>\n  <div class=\"paragraph\">Because they will see us ab being indoctrinated into a culture of Retribution and Torture,<br>the criminals that recover, will see the people who were once OK with torturing them as very sick in deed.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">I was always confused about how people can run around with guns, rob apartments, steel cars,<br>I understand what is wrong with them.</div>\n  <div class=\"paragraph\">Their minds have been hijacked,<br>they are just victims of indoctrination into the culture of crime.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Crime is a particularly potent example of the power of indoctrination,<br>which frequently can be explained as \"Acting against themselves\".</div>\n  <div class=\"paragraph\">But indoctrination is everywhere,<br>meaning that people are doing things that they think are meaningful, but actually they are just hurting themselves or the world.</div>\n  <div class=\"paragraph\">Take the other end of the crime spectrum, <span>a cop planting evidence on a known criminal<sup>[2]</sup></span> that should be in jail,<br>the cop was brought up in a culture of putting criminals in cages, the criminal was brought up in a culture of crime.</div>\n  <div class=\"paragraph\">They are both wrong, they are both just little spinning tops wound up by their indoctrination,<br>in very desperate need of psychological help, but round and round they go.</div>\n  <div class=\"paragraph\">In a more advanced civilization, all the parties involved here and their families would be relocated,<br>given a bright new start at life, and over and over again, until they became free of their psychological indoctrination.</div>\n  <div class=\"paragraph\">Their new lives would include expensive housing, free money from an Advanced Universal Income program,<br>and room to take to education, and eventually helping others out of their indoctrination.</div>\n  <div class=\"paragraph\">See a primitive civilization punishes,<br>an advanced civilization looks to prevention and therapy - we have a lot of work to do.</div>\n  <div class=\"paragraph\">Punishing the police officer would only destabilize them further,<br>and punishing those boys, who already have a stressful and desperate life, suffering addiction, debt, poverty, violence, will certainly make things worse.</div>\n  <div class=\"paragraph\">There is no solution at the level our civilization is currently operating at,<br>the poor boys are suffering the same condition that otherwise reasonable men from Afghanistan who-dont-want-women-in-school are suffering from.</div>\n  <div class=\"paragraph\">Their reality is warped, but they are fighting, tooth and nail, like the Great Warriors we all are,<br>except that the warping of their reality is making them hurt themselves.</div>\n  <div class=\"paragraph\">Often self harm becomes apparent, far too late, when one of those boys becomes a father,<br>and watches their son become like they are...</div>\n  <div class=\"paragraph\">Except now the father gained a grasp on the invisible prison of cultural and psychological indoctrination he was born into,<br>and is now <span>crying that he does not want his son to be like him<sup>[3]</sup></span>.</div>\n  <div class=\"paragraph\">See, once indoctrination is removed, bullies and thugs,<br>will slowly being self repair.</div>\n  <div class=\"paragraph\">Their past life does not stand, in their way towards greatness,<br>we stand in their way.</div>\n  <div class=\"paragraph\">By sentencing a person stricken by indoctrination into years in prison,<br>we only make things worse, we hurt them further.</div>\n  <div class=\"paragraph\">I believe it was The Great Michelle Alexander that described a Judge crying,<br>for tearing a family apart, because the father did not break out of his indoctrination fast enough, and ended up being sentenced to prison.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">We must ask, how can we help these men out of their indoctrination sooner,<br>and eventually we will find that indoctrination is best prevented.</div>\n  <div class=\"paragraph\">One of the major components of Prevention,<br>is ending poverty, granting the entire family Access to Free Money, and Advanced Universal Income.</div>\n  <div class=\"paragraph\">No sum in particular,<br>just a respectful and very generous daily spending limit.</div>\n  <div class=\"paragraph\">This will go a long way, but the process of un-indoctrination,<br>is brittle, requires decades of therapy and re-education.</div>\n  <div class=\"paragraph\">While prevention comes with a clear guarantee,<br>a person already hurt by long therm indoctrination, requires special treatment, preferential treatment.</div>\n  <div class=\"paragraph\">It is our misuse of the idea of money, and tolerance of the sick punishment of prisons,<br>that fractures people, that induces the emergence of broken cultures, and repeatedly indoctrinates participants.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">At this stage of the development of our civilization,<br>Recognition of Indoctrination is the next step.</div>\n  <div class=\"paragraph\">Once people being recognizing indoctrination,<br>once they begin seeing its incredible and negative effects on people.</div>\n  <div class=\"paragraph\">It will become clear,<br>that changes are required.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">The first step, that you can take as a Politician, Teacher, or Parent, or Leader, or best yet Writer and Narrator,<br>is simply to explain to children why people do bad things:</div>\n  <div class=\"paragraph\">They do bad things because the world they think they know is not real,<br>so even though all they are trying to do is good things, like putting food on their table, or keeping their family of neighborhood safe.</div>\n  <div class=\"paragraph\">Those things are transformed by the thick layer of the fake reality that is poisoning and suffocating and crushing them,<br>and what looks to them like the right things to do inside their poisoned world, is actually a very bad thing out in our world.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Here is an opportunity to explain the urgency of real education:<br>so that we don't end up being poisoned and suffocated, and crushed by warped reality.</div>\n  <div class=\"paragraph\">We MUST! caution the children about fake or ineffective education,<br>as invisible prison walls are extremely hard to see.</div>\n  <div class=\"paragraph\">We have to teach the children to get up at the end of class and say:<br>\"Hey Ms. Shmumps, but I didn't learn anything in your class today\".</div>\n  <div class=\"paragraph\">We have to teach them to recognize fake education,<br>and we know what that is like: as many of us graduated without anything to show for it, certainty nothing we couldn't learn on our own in a fraction of the time.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Indoctrination is everywhere, most of us were a victim once,<br>be it religions or fake schools, or paid colleges, or military service, or being forced to cleaning gas station toilets as a teenager to make some money.</div>\n  <div class=\"paragraph\">You are ABSOLUTELY not allowed to work jobs like that,<br>if it was their idea tell your parents to do it - you study Art, Music Compositions or Industrial Design, and don't bother with school focus on your Portfolio.</div>\n  <div class=\"paragraph\">If you are being forced into a life like that,<br>it maybe an idea to take off for the Appalachian Trail, Pacific Crest Trail, or The Continental Divide Trail/</div>\n  <div class=\"paragraph\">Here, nature alone will explain to you how Noble and Dignified you are,<br>you are not to stay in your parents poverty, you have to learn and rise.</div>\n  <div class=\"paragraph\">You are meant to become a Great Being,<br>you are always meant to grow up for better, never for the same or worse.</div>\n  <div class=\"paragraph\">Indoctrination is both (self) emergent such as we find in high crime neighborhoods,<br>and it is designed such as we find in cults, religions and churches.</div>\n  <div class=\"paragraph\">The pattern is hard to see as it is stretched across life,<br>and it always benefits you a little and it takes a lot in the end.</div>\n  <div class=\"paragraph\">Examples are many,<br>Fraudulent churches around the world.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Supreme Court rulings protecting parents' right to religion,<br>whilst <span>sacrificing their children's right to reality<sup>[4]</sup></span>.</div>\n  <div class=\"paragraph\">How can we silently tolerate organizations that speak out against reason and fact,<br>to substitute reality with a drugged up version where the good stuff happens after death.</div>\n  <div class=\"paragraph\">The Supreme Court rulings must consider multi-generational impact,<br>the rulings must be made in context of hundreds of years, not in context of browny points.</div>\n  <div class=\"paragraph\">To be clear, let the adults have their fantasy lifestyles if that is what they want,<br>but don't let them warp the minds of the children by presenting a false reality - and what a truly evil deed that is.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Moreover, we have ask ourselves if we want leadership,<br>who is not of the mindset that is based on reality.</div>\n  <div class=\"paragraph\">It makes perfect sense for a religious person,<br>to think that a religious father can remove a child from eight grade to teach them more about religion.</div>\n  <div class=\"paragraph\">But a well educated person, who is invested in fact, data, science, evidence,<br>will perceive <span>indoctrinating children into religions as abuse<sup>[5]</sup></span>.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">The blight of poverty that we drowned the world in,<br>by failing to make money work for us and making it work against us instead, is another kind of emergent indoctrination.</div>\n  <div class=\"paragraph\">The modern cultures finally figured out that we are all born equal,<br>and yet we still force children into the poverty of their parents.</div>\n  <div class=\"paragraph\">That is not what equal means, equality means that at birth a child is given enough money,<br>to afford effective tutors that truly teach Knowledge and Wisdom, enough money to own a home, dream about family, and never fear hunger.</div>\n  <div class=\"paragraph\">Do. you. not. understand that when you threaten children with military or poverty or some dumb ass idea of hell,<br>they give up their genius - how do you not see that?</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Fake education where teachers feed on paychecks like vampires,<br>just to push children to schools that charge even more once they are old enough to work.</div>\n  <div class=\"paragraph\">How can sustaining ineffective education until something is done to fix it,<br>be presented as a justification for propagation of fake schooling.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">The tolerance of Recruiting soldiers with action-movie like commercials and the promise of free education,<br>among the groups of kids who have not lived long enough to coalesce their knowledge into wisdom is another form of indoctrination.</div>\n  <div class=\"paragraph\">Military recruitment to oil machinery of war with minds and bodies,<br>is what real schools and cultures of wisdom were supposed to help us rise from.</div>\n  <div class=\"paragraph\">A military that takes no interest in helping the world rise out of dark ages,<br>is a military that is not interested in peace.</div>\n  <div class=\"paragraph\">Wars cannot be won by waging more wars,<br>not can nations be pacified with propaganda, indoctrination, and fantasies.</div>\n  <div class=\"paragraph\">Only wisdom can bring World Peace,<br>only education that truly works, equality that is actually meaningful in context of entire lives.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Know that Narrated Books about real lives and real wisdom of beings who made a positive and lasting impact on the modern world,<br>are a good source of wisdom.</div>\n  <div class=\"paragraph\">Use the Library, try not to let people make money from the misfortune of fake education,<br>but hurry find your way to thousands of meaningful books, as that is the education that has been denied to us all.</div>\n  <div class=\"paragraph\">--</div>\n  <div class=\"paragraph\">Learn to recognize Indoctrination,<br>use the idea of indoctrination as a tool to understand broken and often unfixable things.</div>\n  <div class=\"paragraph\">Know, that preventing of fracturing is the noblest way,<br>our civilization must embrace prevention as the most humane way to end mistakes.</div>\n  <div class=\"paragraph\">And above all, break out of whatever invisible walls maybe surrounding you,<br>use it as a key, to set yourself and the world free.</div>\n  <div class=\"paragraph\">You are meant to become,<br>a Great Being.</div>\n</div>\n<div class=\"break-after\">&nbsp;</div>\n<div>\n  <div class=\"section\" style=\"padding-bottom: 1rem;\">References</div>\n  <div>[1]: https://www.youtube.com/watch?v=8vHzUTtmbAM</div>\n  <div>[2]: https://www.youtube.com/watch?v=DrfZuPFrH8A</div>\n  <div>[3]: https://www.youtube.com/watch?v=zk--XN4ozr8</div>\n  <div>[4]: https://www.youtube.com/watch?v=yQUN_6XKKVs</div>\n  <div>[5]: https://www.youtube.com/watch?v=c0_A7Z6JKaY</div>\n</div>",
  "text": "(La Liberté Éclairant Le Monde is French for Liberty Enlightening the World)\nIt is unclear if parents understand the way children do,\nit may not be the blight of indoctrination alone that holds us back.\nIt maybe that children are so much smarter,\nand parents so burdened with poverty and confusion, that everything is lost in translation.\nParents know schools are broken, they know their grades were fake,\nand yet, in their slumber, they send their children towards the same things.\nThe children eventually let go of their intelligence, brilliance, and genius,\nbecause they can see it interferes with grades, and may even cause dread (TRIGGER WARNING)[1].\n\nEvery child is a genius, even if that wasn't true - which it is,\nthere are infinite ways to get at science or music composition, and leadership, or entrepreneurship.\n\nWe are extremely adaptive,\nwe are not rocks thrown into water.\nBut, if we are taught that reality is something other than it really is,\nthen the sacred space in which we do our decision making is - violated, and we become hijacked, and it becomes unstable.\n\nI always had trouble understanding how someone can cause harm, or commit a crime,\nand I came to conclude that a criminal pulls the trigger for the same reason that soldiers around the world do.\nTheir view of reality is often permanently warped,\nand they are under some pressure, and influence.\nIt could be influence of alcohol or worse,\nbut also it can be the influence of being court marshaled or even yelled at by someone in control of their existence.\nI immediately realized that criminals are indoctrinated into crime,\nthis religion of crime, is not exactly emergent, it does not exactly come out of nowhere.\nIt comes out of poverty, from having parents who drink or do drugs because they can't make their way out of their poverty,\nand then the threat of the neighborhood bullies, which often, as far as survival goes, means both gangs and the police.\nAll those scary individuals that most people agree to keep in cages,\nare actually just children who had their minds poisoned.\nI wouldn't say that it is a permanent poisoning,\nI feel that psychologists know this.\nAnd they also know that by keeping people in cages,\nwe make them worse.\nAnd I know, that we make ourselves worse for it,\na criminal belongs in a Medical Institution specifically built to undo the damage caused by indoctrination.\nPrisons poison the minds of criminals further,\nwhat they need is understanding, support, hope, future, - you know real justice.\nMore than that, once they are placed into institutions that aren't sick torture,\nthey may not wish to return to be among the people that did this to them.\nBecause they will see us ab being indoctrinated into a culture of Retribution and Torture,\nthe criminals that recover, will see the people who were once OK with torturing them as very sick in deed.\n\nI was always confused about how people can run around with guns, rob apartments, steel cars,\nI understand what is wrong with them.\nTheir minds have been hijacked,\nthey are just victims of indoctrination into the culture of crime.\n\nCrime is a particularly potent example of the power of indoctrination,\nwhich frequently can be explained as \"Acting against themselves\".\nBut indoctrination is everywhere,\nmeaning that people are doing things that they think are meaningful, but actually they are just hurting themselves or the world.\nTake the other end of the crime spectrum, a cop planting evidence on a known criminal[2] that should be in jail,\nthe cop was brought up in a culture of putting criminals in cages, the criminal was brought up in a culture of crime.\nThey are both wrong, they are both just little spinning tops wound up by their indoctrination,\nin very desperate need of psychological help, but round and round they go.\nIn a more advanced civilization, all the parties involved here and their families would be relocated,\ngiven a bright new start at life, and over and over again, until they became free of their psychological indoctrination.\nTheir new lives would include expensive housing, free money from an Advanced Universal Income program,\nand room to take to education, and eventually helping others out of their indoctrination.\nSee a primitive civilization punishes,\nan advanced civilization looks to prevention and therapy - we have a lot of work to do.\nPunishing the police officer would only destabilize them further,\nand punishing those boys, who already have a stressful and desperate life, suffering addiction, debt, poverty, violence, will certainly make things worse.\nThere is no solution at the level our civilization is currently operating at,\nthe poor boys are suffering the same condition that otherwise reasonable men from Afghanistan who-dont-want-women-in-school are suffering from.\nTheir reality is warped, but they are fighting, tooth and nail, like the Great Warriors we all are,\nexcept that the warping of their reality is making them hurt themselves.\nOften self harm becomes apparent, far too late, when one of those boys becomes a father,\nand watches their son become like they are...\nExcept now the father gained a grasp on the invisible prison of cultural and psychological indoctrination he was born into,\nand is now crying that he does not want his son to be like him[3].\nSee, once indoctrination is removed, bullies and thugs,\nwill slowly being self repair.\nTheir past life does not stand, in their way towards greatness,\nwe stand in their way.\nBy sentencing a person stricken by indoctrination into years in prison,\nwe only make things worse, we hurt them further.\nI believe it was The Great Michelle Alexander that described a Judge crying,\nfor tearing a family apart, because the father did not break out of his indoctrination fast enough, and ended up being sentenced to prison.\n\nWe must ask, how can we help these men out of their indoctrination sooner,\nand eventually we will find that indoctrination is best prevented.\nOne of the major components of Prevention,\nis ending poverty, granting the entire family Access to Free Money, and Advanced Universal Income.\nNo sum in particular,\njust a respectful and very generous daily spending limit.\nThis will go a long way, but the process of un-indoctrination,\nis brittle, requires decades of therapy and re-education.\nWhile prevention comes with a clear guarantee,\na person already hurt by long therm indoctrination, requires special treatment, preferential treatment.\nIt is our misuse of the idea of money, and tolerance of the sick punishment of prisons,\nthat fractures people, that induces the emergence of broken cultures, and repeatedly indoctrinates participants.\n\nAt this stage of the development of our civilization,\nRecognition of Indoctrination is the next step.\nOnce people being recognizing indoctrination,\nonce they begin seeing its incredible and negative effects on people.\nIt will become clear,\nthat changes are required.\n\nThe first step, that you can take as a Politician, Teacher, or Parent, or Leader, or best yet Writer and Narrator,\nis simply to explain to children why people do bad things:\nThey do bad things because the world they think they know is not real,\nso even though all they are trying to do is good things, like putting food on their table, or keeping their family of neighborhood safe.\nThose things are transformed by the thick layer of the fake reality that is poisoning and suffocating and crushing them,\nand what looks to them like the right things to do inside their poisoned world, is actually a very bad thing out in our world.\n\nHere is an opportunity to explain the urgency of real education:\nso that we don't end up being poisoned and suffocated, and crushed by warped reality.\nWe MUST! caution the children about fake or ineffective education,\nas invisible prison walls are extremely hard to see.\nWe have to teach the children to get up at the end of class and say:\n\"Hey Ms. Shmumps, but I didn't learn anything in your class today\".\nWe have to teach them to recognize fake education,\nand we know what that is like: as many of us graduated without anything to show for it, certainty nothing we couldn't learn on our own in a fraction of the time.\n\nIndoctrination is everywhere, most of us were a victim once,\nbe it religions or fake schools, or paid colleges, or military service, or being forced to cleaning gas station toilets as a teenager to make some money.\nYou are ABSOLUTELY not allowed to work jobs like that,\nif it was their idea tell your parents to do it - you study Art, Music Compositions or Industrial Design, and don't bother with school focus on your Portfolio.\nIf you are being forced into a life like that,\nit maybe an idea to take off for the Appalachian Trail, Pacific Crest Trail, or The Continental Divide Trail/\nHere, nature alone will explain to you how Noble and Dignified you are,\nyou are not to stay in your parents poverty, you have to learn and rise.\nYou are meant to become a Great Being,\nyou are always meant to grow up for better, never for the same or worse.\nIndoctrination is both (self) emergent such as we find in high crime neighborhoods,\nand it is designed such as we find in cults, religions and churches.\nThe pattern is hard to see as it is stretched across life,\nand it always benefits you a little and it takes a lot in the end.\nExamples are many,\nFraudulent churches around the world.\n\nSupreme Court rulings protecting parents' right to religion,\nwhilst sacrificing their children's right to reality[4].\nHow can we silently tolerate organizations that speak out against reason and fact,\nto substitute reality with a drugged up version where the good stuff happens after death.\nThe Supreme Court rulings must consider multi-generational impact,\nthe rulings must be made in context of hundreds of years, not in context of browny points.\nTo be clear, let the adults have their fantasy lifestyles if that is what they want,\nbut don't let them warp the minds of the children by presenting a false reality - and what a truly evil deed that is.\n\nMoreover, we have ask ourselves if we want leadership,\nwho is not of the mindset that is based on reality.\nIt makes perfect sense for a religious person,\nto think that a religious father can remove a child from eight grade to teach them more about religion.\nBut a well educated person, who is invested in fact, data, science, evidence,\nwill perceive indoctrinating children into religions as abuse[5].\n\nThe blight of poverty that we drowned the world in,\nby failing to make money work for us and making it work against us instead, is another kind of emergent indoctrination.\nThe modern cultures finally figured out that we are all born equal,\nand yet we still force children into the poverty of their parents.\nThat is not what equal means, equality means that at birth a child is given enough money,\nto afford effective tutors that truly teach Knowledge and Wisdom, enough money to own a home, dream about family, and never fear hunger.\nDo. you. not. understand that when you threaten children with military or poverty or some dumb ass idea of hell,\nthey give up their genius - how do you not see that?\n\nFake education where teachers feed on paychecks like vampires,\njust to push children to schools that charge even more once they are old enough to work.\nHow can sustaining ineffective education until something is done to fix it,\nbe presented as a justification for propagation of fake schooling.\n\nThe tolerance of Recruiting soldiers with action-movie like commercials and the promise of free education,\namong the groups of kids who have not lived long enough to coalesce their knowledge into wisdom is another form of indoctrination.\nMilitary recruitment to oil machinery of war with minds and bodies,\nis what real schools and cultures of wisdom were supposed to help us rise from.\nA military that takes no interest in helping the world rise out of dark ages,\nis a military that is not interested in peace.\nWars cannot be won by waging more wars,\nnot can nations be pacified with propaganda, indoctrination, and fantasies.\nOnly wisdom can bring World Peace,\nonly education that truly works, equality that is actually meaningful in context of entire lives.\n\nKnow that Narrated Books about real lives and real wisdom of beings who made a positive and lasting impact on the modern world,\nare a good source of wisdom.\nUse the Library, try not to let people make money from the misfortune of fake education,\nbut hurry find your way to thousands of meaningful books, as that is the education that has been denied to us all.\n--\nLearn to recognize Indoctrination,\nuse the idea of indoctrination as a tool to understand broken and often unfixable things.\nKnow, that preventing of fracturing is the noblest way,\nour civilization must embrace prevention as the most humane way to end mistakes.\nAnd above all, break out of whatever invisible walls maybe surrounding you,\nuse it as a key, to set yourself and the world free.\nYou are meant to become,\na Great Being.\n \nReferences\n[1]: https://www.youtube.com/watch?v=8vHzUTtmbAM\n[2]: https://www.youtube.com/watch?v=DrfZuPFrH8A\n[3]: https://www.youtube.com/watch?v=zk--XN4ozr8\n[4]: https://www.youtube.com/watch?v=yQUN_6XKKVs\n[5]: https://www.youtube.com/watch?v=c0_A7Z6JKaY",
  "images": [],
  "links": [
    {
      "title": "dread (TRIGGER WARNING)",
      "url": "https://www.youtube.com/watch?v=8vHzUTtmbAM",
      "hostname": "www.youtube.com"
    },
    {
      "title": "a cop planting evidence on a known criminal",
      "url": "https://www.youtube.com/watch?v=DrfZuPFrH8A",
      "hostname": "www.youtube.com"
    },
    {
      "title": "crying that he does not want his son to be like him",
      "url": "https://www.youtube.com/watch?v=zk--XN4ozr8",
      "hostname": "www.youtube.com"
    },
    {
      "title": "sacrificing their children's right to reality",
      "url": "https://www.youtube.com/watch?v=yQUN_6XKKVs",
      "hostname": "www.youtube.com"
    },
    {
      "title": "indoctrinating children into religions as abuse",
      "url": "https://www.youtube.com/watch?v=c0_A7Z6JKaY",
      "hostname": "www.youtube.com"
    }
  ]
}