{
  "name": "furkies-purrkies-poetry-0277",
  "title": "The Serious Business Of Trouble-making",
  "date": "2020-12-03T03:41:19.174Z",
  "image": "poetry-0277-illustration.jpg",
  "audio": "poetry-0277.mp3",
  "artwork": "https://unsplash.com/photos/m4uUDTrcJeY",
  "id": "furkies-purrkies-poetry-0277",
  "attachments": {},
  "html": "<div class=\"section\">\n  <p>The best kind of trouble is the trouble you create for yourself,</p>\n  <p>there is no limit to how elaborate of a problem you can invent.</p>\n</div>\n<div class=\"section\">\n  <p>Relativity and contrast play a very important role here,</p>\n  <p>the lower you are and the higher you aim the more it is worth the trouble.</p>\n</div>\n<div class=\"section\">\n  <p>It is safe to say that a nice and comfortable bed with an electric blanket,</p>\n  <p>on a quiet and sleepy afternoon is a pretty good low.</p>\n</div>\n<div class=\"section\">\n  <p>A pretty good height to reach is either ten miles by foot,</p>\n  <p>or 1,500 miles by car where it usually involves a beach somewhere.</p>\n</div>\n<div class=\"section\">\n  <p>Moreover, you need a team deadline, a snooze button, a soon to end semester,</p>\n  <p>and an ungrateful team where you do all the work, add a few bullies...</p>\n</div>\n<div class=\"section\">\n  <p>and your co-worker whispering:</p>\n  <p>&quot;Why did she get a raise, she doesn&apos;t know anything&quot; - emphasizing &quot;she doesn&apos;t know&quot;.</p>\n</div>\n<div class=\"section\">\n  <p>While not purrfect, this is a really good start,</p>\n  <p>and erasing the deadline from its existence, is a sweet-sweet cherry on top.</p>\n</div>\n<div class=\"section\">\n  <p>There are too more things you could use, a handful or ungrateful friends,</p>\n  <p>and a really well thought out backpack, and a large solar charger you can hang on the back.</p>\n</div>\n<div class=\"section\">\n  <p>See, you are not just headed for Key West and back,</p>\n  <p>I m sure you will stop at all the antique stores, and hopefully pawn shops as they have good stuff too.</p>\n</div>\n<div class=\"section\">\n  <p>A good pawn shop somewhere down in Florida or by an ocean is sure to have a cheap Wet Suit,</p>\n  <p>it is a little known fact that they aid your buoyancy, it is like wrapping your self in a wee boat.</p>\n</div>\n<div class=\"section\">\n  <p>I think it is really important to consider stopping by the highway accessible State Parks,</p>\n  <p>they are usually there because something beautiful is going on.</p>\n</div>\n<div class=\"section\">\n  <p>You never know what you find, it could be a little lake, maybe enormous dunes,</p>\n  <p>it could be a hill with a historic watchtower of a lookout, or it could be a stable, with horses.</p>\n</div>\n<div class=\"section\">\n  <p>Personally, I think it is disrespectful for a man to sit on a poor animal,</p>\n  <p>but it is fine for a woman.</p>\n</div>\n<div class=\"section\">\n  <p>And you certainly don&apos;t want to realize come your late golden age,</p>\n  <p>that you never rode a horse, and yet you always knew that you were a cowgirl at heart.</p>\n</div>\n<div class=\"section\">\n  <p>Now, you see what I am saying, you go from a warm and cozy blanket on a lazy afternoon, facing an ugly week,</p>\n  <p>to wondering how to make the damn animal stop galloping, because by now you are in the middle of the woods.</p>\n</div>\n<div class=\"section\">\n  <p>An hour later as you lead your new equine fiend back,</p>\n  <p>it won&apos;t be just that you soul and heart are filling with beauty...</p>\n</div>\n<div class=\"section\">\n  <p>...but somehow you will also gain a sense for how irrelevant your deadline was,</p>\n  <p>how nearly falling from your new spirit animal and soul-mate combined to repair your perspective.</p>\n</div>\n<div class=\"section\">\n  <p>It is never enough to merely dump indoctrination and repair misconceptions,</p>\n  <p>there is also a kind of a fog-of-war that luls you into a life that frankly, you already made too many compromises for.</p>\n</div>\n<div class=\"section\">\n  <p>In real life you do things out of love, in the other kind of life you compromise,</p>\n  <p>and do that long enough and you will find yourself hardly noticing that you are walking a stranger&apos;s road - that ain&apos;t good.</p>\n</div>\n<div class=\"section\">\n  <p>Eventually, you pet and pat you horse, give the caretaker a smile,</p>\n  <p>and stop at the next park.</p>\n</div>\n<div class=\"section\">\n  <p>The more stops you make, the more you will heal and the faster you will catch up with growing up,</p>\n  <p>you can almost feel it in your hands, they will fell empty without a journal.</p>\n</div>\n<div class=\"section\">\n  <p>Now, let me just pause here for a second, and remind you, that you are removing unimportant things from your life,</p>\n  <p>be good to your journal, failing that get a second one, as the first one won&apos;t last long at all.</p>\n</div>\n<div class=\"section\">\n  <p>Don&apos;t make the same mistake I did, I bought this beautiful leather bound thing,</p>\n  <p>and figured why don&apos;t I use a pencil at first...</p>\n</div>\n<div class=\"section\">\n  <p>...smart right?</p>\n</div>\n<div class=\"section\">\n  <p>It took me hours to try to erase the pages, and most of them still had annoying little bits of letters on it,</p>\n  <p>treat your journal like a friend, and speak in wee little bits.</p>\n</div>\n<div class=\"section\">\n  <p>If you want to speak at length,</p>\n  <p>do what I am doing, give advice, make a little audio file and put it on the internet.</p>\n</div>\n<div class=\"section\">\n  <p>Healing will make it so that you will want to erase it because it will sound &quot;dumb&quot; to you after a bit,</p>\n  <p>but that is only because you are growing really quickly, catching up, others still need the simpler thoughts.</p>\n</div>\n<div class=\"section\">\n  <p>A lot of people will stay in bed,</p>\n  <p>they will meet the deadline, and that snooze button will slowly turn their joy of life off.</p>\n</div>\n<div class=\"section\">\n  <p>There is still hope for them, maybe the boss will be super crazy and mean, hopefully,</p>\n  <p>she could then come around and tell them &quot;Hey! you will never get a raise again?&quot;, that could still snap them out of it.</p>\n</div>\n<div class=\"section\">\n  <p>But, if the boss is not fully crazed,</p>\n  <p>you are their last hope.</p>\n</div>\n<div class=\"section\">\n  <p>The trouble you go through to learn to jog,</p>\n  <p>or try to hit every state park, without really caring much for actually making it to Key West.</p>\n</div>\n<div class=\"section\">\n  <p>As all end of the road towns are tourist traps,</p>\n  <p>so, it is true when they say it is the journey, not the destination.</p>\n</div>\n<div class=\"section\">\n  <p>Except maybe for those six toed cats that Ernest Hemingway left behind in his Key West home,</p>\n  <p>very few things will surprise you with independence, and a cat probably capable of of grasping tools is one of them.</p>\n</div>\n<div class=\"section\">\n  <p>Yeah, all the trouble, and little pit stops, and furry or maned discoveries, serve as a call to health,</p>\n  <p>to all those who are almost ready for it, but not quite there.</p>\n</div>\n<div class=\"section\">\n  <p>No human should lead the life of a house cat,</p>\n  <p>we are very dynamic, and doing beautiful unusual things helps us stay healthy.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>One, time, I camped next to a couple that brought their two year old to a hike-in site,</p>\n  <p>it was clearly the husband&apos;s idea, the wife was angry, and the kid was crying...</p>\n</div>\n<div class=\"section\">\n  <p>It was a nice try, but they needed more vacations, and more babysitters,</p>\n  <p>and not just camping, but jogging, trail running, and a plan to visit all the famous lighthouses.</p>\n</div>\n<div class=\"section\">\n  <p>I am sure she loved the trouble of camping when they started dating,</p>\n  <p>now the inconvenience of it all was making the poor lady, angry, out of the storm of stress.</p>\n</div>\n<div class=\"section\">\n  <p>I am certain, that she was blaming her self for it,</p>\n  <p>and thinking of her self as just that kind of a person, nobody is angry like that.</p>\n</div>\n<div class=\"section\">\n  <p>Between the three of them, they had everything in the universe, except the trouble was so overwhelming and the fog-of-war so thick.</p>\n  <p>That this, clearly, mighty and courageous mom, was only racing forward to get stuff done.</p>\n</div>\n<div class=\"section\">\n  <p>They stayed the weekend,</p>\n  <p>but they needed at least three weeks if not months.</p>\n</div>\n<div class=\"section\">\n  <p>They needed to stop racing forward,</p>\n  <p>they needed more adventures, more &quot;inconvenience&quot;, more trouble-making as I call it.</p>\n</div>\n<div class=\"section\">\n  <p>That woman in particular struck me as someone who needed to run the Western States 100,</p>\n  <p>she had the power for it, no, she has a soul for it.</p>\n</div>\n<div class=\"section\">\n  <p>See emanated the mana that bespoke that,</p>\n  <p>the standard marathons needed to qualify for western states meant nothing to her, it was just a blistering formality.</p>\n</div>\n<div class=\"section\">\n  <p>Anyway, still a glorious couple,</p>\n  <p>and their little one will surely grow up to be an adventurer.</p>\n</div>\n<div class=\"section\">\n  <p>Aside from a raccoon I named Friday, using his cute little hands to soil my hot dog buns,</p>\n  <p>that week brought in another mighty being - this time a teenage boy.</p>\n</div>\n<div class=\"section\">\n  <p>His father passed away, and he pushed himself too far,</p>\n  <p>the psychologist put him on permanent medicine.</p>\n</div>\n<div class=\"section\">\n  <p>I had the great honor of speaking to him, he told me he slept in fields and ditches,</p>\n  <p>but he had his sister, or mom, looking out for him.</p>\n</div>\n<div class=\"section\">\n  <p>He was a Powerful Troublemaker,</p>\n  <p>I told him we need to care for ourselves, our bodies need vitamins, electrolytes, our minds need whatever they need.</p>\n</div>\n<div class=\"section\">\n  <p>&quot;There is no such thing as crazy,</p>\n  <p>you just went through a lot in life, it was your life that got crazy.&quot; - I said to him.</p>\n</div>\n<div class=\"section\">\n  <p>A thousand miles on a bicycle, which according to my maps requires a little trip to Canada, and a ferry,</p>\n  <p>is all the proof needed that the kid was really special.</p>\n</div>\n<div class=\"section\">\n  <p>I returned to my camp, and a day or two later,</p>\n  <p>a shadowy figure visited him, his mom probably, and without me paying attention I&apos;ve noticed it was a slow and mighty, and very heavy conversation.</p>\n</div>\n<div class=\"section\">\n  <p>Knowing he was well, I hope he continued his bicycling, at least to the upper peninsula,</p>\n  <p>though there was a ferry near by, so maybe he was headed for Chicago, I hope they both went.</p>\n</div>\n<div class=\"section\">\n  <p>See, here is a child well on his way to become a great being,</p>\n  <p>he was learning wisdom, and all he needed was backpack, a bicycle, and a thousand miles of road.</p>\n</div>\n<div class=\"section\">\n  <p>Trouble-making is no joke, it an art,</p>\n  <p>and it is medicine worthy of great heroes.</p>\n</div>\n<div class=\"section\">\n  <p>If you, my Dear Reader, get stuck, or stung, or scared, or get stuck in a fog of war,</p>\n  <p>know that it is not a time to try harder, and push harder, and let me tell you why without mincing words:</p>\n</div>\n<div class=\"section\">\n  <p>Because you are absolutely irreplaceable,</p>\n  <p>and - what you think your flaws are - aren&apos;t, they are not flaws, this is your uniqueness.</p>\n</div>\n<div class=\"section\">\n  <p>You will only exist once in the universe,</p>\n  <p>and though you can rain wrath precisely like a god, you also need to pace yourself.</p>\n</div>\n<div class=\"section\">\n  <p>The best kind of a Warrior is a Laughing Philosopher,</p>\n  <p>not a Berserker (that&apos;s too easy), be an Artist.</p>\n</div>\n<div class=\"section\">\n  <p>It is a huge part of the art of living,</p>\n  <p>to quit blaming yourself for being angry, or clumsy, or never finishing anything you start, or never finding the right person.</p>\n</div>\n<div class=\"section\">\n  <p>You are not angry, there is nothing wrong with you,</p>\n  <p>you just took on so much weight and made so many compromises that there is no more time left for you to be yourself.</p>\n</div>\n<div class=\"section\">\n  <p>I know it sounds awful when I say something as simple and go ride a bicycle, or a horse,</p>\n  <p>or give the campsite raccoons so much anxiety that they start clawing their way into nice people&apos;s backpacks.</p>\n</div>\n<div class=\"section\">\n  <p>But that is how it works, the way out of fog of war,</p>\n  <p>must be simple so that you have no trouble taking it.</p>\n</div>\n<div class=\"section\">\n  <p>No one is asking you to drop out of school permanently,</p>\n  <p>you&apos;re not going to be homeless, you will find a better job.</p>\n</div>\n<div class=\"section\">\n  <p>You only need to say the truth to your next employer,</p>\n  <p>your mental health, and your joy of life, and a balanced existence is critical to a healthy existence.</p>\n</div>\n<div class=\"section\">\n  <p>Just because someone can lay down their life to meet a deadline whilst kissing ass and never asking for a raise,</p>\n  <p>it does not mean anybody healthy will ever try.</p>\n</div>\n<div class=\"section\">\n  <p>If principals or teachers, or management or anything gets crazy on you,</p>\n  <p>don&apos;t quit, just don&apos;t comply because doing so will hurt you, just take a vacation, because your mental and physical health is more important than anything else, period.</p>\n</div>\n<div class=\"section\">\n  <p>If you are still not hearing this, if you are still not ready not to sacrifice yourself,</p>\n  <p>let me say this, there is a lot of people out there who like that Mighty Teenager do have a breaking point that will scare the bajezus out of a shrink, who is only too happy to prescribe something.</p>\n</div>\n<div class=\"section\">\n  <p>Your self-compassion, your dignity, your beauty,</p>\n  <p>and the power that your laughter, your foolishness, your silliness, your mischievousness, and above all your giggles exert on the universe that surrounds you is to important to us all for you to keep walking a path that is hurting you.</p>\n</div>\n<div class=\"section\">\n  <p>You are irreplaceable, and when you rise, and choose to share your stories,</p>\n  <p>you will build roads for others to follow.</p>\n</div>\n<div class=\"section\">\n  <p>By not putting up with what is hurting you,</p>\n  <p>you make the Universe a better place by becoming a beacon of sanity for those who will hear of your adventures.</p>\n</div>\n<div class=\"section\">\n  <p>Returning to school or job with with this dignity and integrity of mind,</p>\n  <p>will change the way people treat you.</p>\n</div>\n<div class=\"section\">\n  <p>Not just your confidence, but your wisdom, and strength, and balance,</p>\n  <p>will alter your body language.</p>\n</div>\n<div class=\"section\">\n  <p>Stressed people and relaxed people, give off different behavioral clues,</p>\n  <p>people including those in charge of budgets can read that very easily.</p>\n</div>\n<div class=\"section\">\n  <p>Terrible people who lack compassion are everywhere,</p>\n  <p>sometimes stressed out people will be abused with more stress just because they keep taking it on.</p>\n</div>\n<div class=\"section\">\n  <p>Things get supremely complicated,</p>\n  <p>in ways that we can&apos;t always understand.</p>\n</div>\n<div class=\"section\">\n  <p>For example the reason why someone loses their 4.0 may have nothing to do with their performance,</p>\n  <p>but with the teacher giving out too many A/s in the previous semester, and now just trying to average things out with the people who never complain, so that the dean doesn&apos;t come around complaining that his class sticks out.</p>\n</div>\n<div class=\"section\">\n  <p>It doesn&apos;t matter if it is High School, or College, or what used to be a Dream Job,</p>\n  <p>there are unethical fake it until you make it people covering their asses everywhere, it is a tragedy that someone like that should become a reason behind someone&apos;s years of suffering.</p>\n</div>\n<div class=\"section\">\n  <p>These are simple examples I am making up,</p>\n  <p>in real life, there is no understanding of all the motives as people who never grew up, constantly interact with each other to to do less, and get more,</p>\n</div>\n<div class=\"section\">\n  <p>Trouble-making is just a lighthearted way of leaving all that noise behind,</p>\n  <p>and regaining your own beauty, and strengths, and awe for the world around you.</p>\n</div>\n<div class=\"section\">\n  <p>Give yourself some trouble that actually makes you better for a change.</p>\n  <p>if the path you re walking on feels wrong, you need to begin preparing an adventure backpack.</p>\n</div>\n<div class=\"section\">\n  <p>A very special Monday is coming around,</p>\n  <p>your clock will go off just like always.</p>\n</div>\n<div class=\"section\">\n  <p>But this time it will die with a sad whimper as you - slowly and deliberately - unplug it from the wall,</p>\n  <p>and return to sleep, not worried about your deadline, job or school, but simply knowing full well, that they don&apos;t matter anymore; because your well being is infinitely more important.</p>\n</div>\n<div class=\"section\">\n  <p>Then get into your car, or on a bus, and set a direction for sunny weather,</p>\n  <p>drive, fly, just go, and do not wait to create your rules of adventure, do it as soon as possible.</p>\n</div>\n<div class=\"section\">\n  <p>When your health returns to you,</p>\n  <p>you&apos;ll know exactly where you are going, and schools will always take you back, and jobs that hurt you are now worthy of your concern at all.</p>\n</div>\n<div class=\"section\">\n  <p>Don&apos;t make plans about the rest of your life until you catch up where you need to be and become wiser as think things through.</p>\n</div>\n<div class=\"section\">\n  <p>And finally, if you don&apos;t like the idea of trouble making,</p>\n  <p>then between You and I let us call it: Love of Life.</p>\n</div>",
  "bootstrap": "<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The best kind of trouble is the trouble you create for yourself,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">there is no limit to how elaborate of a problem you can invent.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Relativity and contrast play a very important role here,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">the lower you are and the higher you aim the more it is worth the trouble.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">It is safe to say that a nice and comfortable bed with an electric blanket,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">on a quiet and sleepy afternoon is a pretty good low.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">A pretty good height to reach is either ten miles by foot,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">or 1,500 miles by car where it usually involves a beach somewhere.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Moreover, you need a team deadline, a snooze button, a soon to end semester,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">and an ungrateful team where you do all the work, add a few bullies...</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">and your co-worker whispering:</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">\"Why did she get a raise, she doesn't know anything\" - emphasizing \"she doesn't know\".</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">While not purrfect, this is a really good start,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">and erasing the deadline from its existence, is a sweet-sweet cherry on top.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">There are too more things you could use, a handful or ungrateful friends,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">and a really well thought out backpack, and a large solar charger you can hang on the back.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">See, you are not just headed for Key West and back,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I m sure you will stop at all the antique stores, and hopefully pawn shops as they have good stuff too.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">A good pawn shop somewhere down in Florida or by an ocean is sure to have a cheap Wet Suit,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">it is a little known fact that they aid your buoyancy, it is like wrapping your self in a wee boat.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I think it is really important to consider stopping by the highway accessible State Parks,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">they are usually there because something beautiful is going on.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">You never know what you find, it could be a little lake, maybe enormous dunes,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">it could be a hill with a historic watchtower of a lookout, or it could be a stable, with horses.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Personally, I think it is disrespectful for a man to sit on a poor animal,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">but it is fine for a woman.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">And you certainly don't want to realize come your late golden age,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">that you never rode a horse, and yet you always knew that you were a cowgirl at heart.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Now, you see what I am saying, you go from a warm and cozy blanket on a lazy afternoon, facing an ugly week,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">to wondering how to make the damn animal stop galloping, because by now you are in the middle of the woods.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">An hour later as you lead your new equine fiend back,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">it won't be just that you soul and heart are filling with beauty...</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">...but somehow you will also gain a sense for how irrelevant your deadline was,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">how nearly falling from your new spirit animal and soul-mate combined to repair your perspective.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">It is never enough to merely dump indoctrination and repair misconceptions,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">there is also a kind of a fog-of-war that luls you into a life that frankly, you already made too many compromises for.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">In real life you do things out of love, in the other kind of life you compromise,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">and do that long enough and you will find yourself hardly noticing that you are walking a stranger's road - that ain't good.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Eventually, you pet and pat you horse, give the caretaker a smile,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">and stop at the next park.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The more stops you make, the more you will heal and the faster you will catch up with growing up,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">you can almost feel it in your hands, they will fell empty without a journal.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Now, let me just pause here for a second, and remind you, that you are removing unimportant things from your life,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">be good to your journal, failing that get a second one, as the first one won't last long at all.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Don't make the same mistake I did, I bought this beautiful leather bound thing,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">and figured why don't I use a pencil at first...</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">...smart right?</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">It took me hours to try to erase the pages, and most of them still had annoying little bits of letters on it,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">treat your journal like a friend, and speak in wee little bits.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">If you want to speak at length,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">do what I am doing, give advice, make a little audio file and put it on the internet.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Healing will make it so that you will want to erase it because it will sound \"dumb\" to you after a bit,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">but that is only because you are growing really quickly, catching up, others still need the simpler thoughts.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">A lot of people will stay in bed,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">they will meet the deadline, and that snooze button will slowly turn their joy of life off.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">There is still hope for them, maybe the boss will be super crazy and mean, hopefully,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">she could then come around and tell them \"Hey! you will never get a raise again?\", that could still snap them out of it.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">But, if the boss is not fully crazed,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">you are their last hope.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The trouble you go through to learn to jog,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">or try to hit every state park, without really caring much for actually making it to Key West.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">As all end of the road towns are tourist traps,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">so, it is true when they say it is the journey, not the destination.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Except maybe for those six toed cats that Ernest Hemingway left behind in his Key West home,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">very few things will surprise you with independence, and a cat probably capable of of grasping tools is one of them.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Yeah, all the trouble, and little pit stops, and furry or maned discoveries, serve as a call to health,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">to all those who are almost ready for it, but not quite there.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">No human should lead the life of a house cat,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">we are very dynamic, and doing beautiful unusual things helps us stay healthy.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">One, time, I camped next to a couple that brought their two year old to a hike-in site,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">it was clearly the husband's idea, the wife was angry, and the kid was crying...</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">It was a nice try, but they needed more vacations, and more babysitters,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">and not just camping, but jogging, trail running, and a plan to visit all the famous lighthouses.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I am sure she loved the trouble of camping when they started dating,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">now the inconvenience of it all was making the poor lady, angry, out of the storm of stress.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I am certain, that she was blaming her self for it,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">and thinking of her self as just that kind of a person, nobody is angry like that.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Between the three of them, they had everything in the universe, except the trouble was so overwhelming and the fog-of-war so thick.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">That this, clearly, mighty and courageous mom, was only racing forward to get stuff done.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">They stayed the weekend,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">but they needed at least three weeks if not months.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">They needed to stop racing forward,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">they needed more adventures, more \"inconvenience\", more trouble-making as I call it.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">That woman in particular struck me as someone who needed to run the Western States 100,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">she had the power for it, no, she has a soul for it.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">See emanated the mana that bespoke that,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">the standard marathons needed to qualify for western states meant nothing to her, it was just a blistering formality.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Anyway, still a glorious couple,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">and their little one will surely grow up to be an adventurer.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Aside from a raccoon I named Friday, using his cute little hands to soil my hot dog buns,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">that week brought in another mighty being - this time a teenage boy.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">His father passed away, and he pushed himself too far,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">the psychologist put him on permanent medicine.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I had the great honor of speaking to him, he told me he slept in fields and ditches,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">but he had his sister, or mom, looking out for him.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">He was a Powerful Troublemaker,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I told him we need to care for ourselves, our bodies need vitamins, electrolytes, our minds need whatever they need.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">\"There is no such thing as crazy,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">you just went through a lot in life, it was your life that got crazy.\" - I said to him.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">A thousand miles on a bicycle, which according to my maps requires a little trip to Canada, and a ferry,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">is all the proof needed that the kid was really special.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I returned to my camp, and a day or two later,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">a shadowy figure visited him, his mom probably, and without me paying attention I've noticed it was a slow and mighty, and very heavy conversation.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Knowing he was well, I hope he continued his bicycling, at least to the upper peninsula,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">though there was a ferry near by, so maybe he was headed for Chicago, I hope they both went.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">See, here is a child well on his way to become a great being,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">he was learning wisdom, and all he needed was backpack, a bicycle, and a thousand miles of road.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Trouble-making is no joke, it an art,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">and it is medicine worthy of great heroes.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">If you, my Dear Reader, get stuck, or stung, or scared, or get stuck in a fog of war,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">know that it is not a time to try harder, and push harder, and let me tell you why without mincing words:</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Because you are absolutely irreplaceable,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">and - what you think your flaws are - aren't, they are not flaws, this is your uniqueness.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">You will only exist once in the universe,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">and though you can rain wrath precisely like a god, you also need to pace yourself.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The best kind of a Warrior is a Laughing Philosopher,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">not a Berserker (that's too easy), be an Artist.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">It is a huge part of the art of living,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">to quit blaming yourself for being angry, or clumsy, or never finishing anything you start, or never finding the right person.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">You are not angry, there is nothing wrong with you,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">you just took on so much weight and made so many compromises that there is no more time left for you to be yourself.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I know it sounds awful when I say something as simple and go ride a bicycle, or a horse,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">or give the campsite raccoons so much anxiety that they start clawing their way into nice people's backpacks.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">But that is how it works, the way out of fog of war,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">must be simple so that you have no trouble taking it.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">No one is asking you to drop out of school permanently,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">you're not going to be homeless, you will find a better job.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">You only need to say the truth to your next employer,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">your mental health, and your joy of life, and a balanced existence is critical to a healthy existence.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Just because someone can lay down their life to meet a deadline whilst kissing ass and never asking for a raise,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">it does not mean anybody healthy will ever try.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">If principals or teachers, or management or anything gets crazy on you,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">don't quit, just don't comply because doing so will hurt you, just take a vacation, because your mental and physical health is more important than anything else, period.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">If you are still not hearing this, if you are still not ready not to sacrifice yourself,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">let me say this, there is a lot of people out there who like that Mighty Teenager do have a breaking point that will scare the bajezus out of a shrink, who is only too happy to prescribe something.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Your self-compassion, your dignity, your beauty,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">and the power that your laughter, your foolishness, your silliness, your mischievousness, and above all your giggles exert on the universe that surrounds you is to important to us all for you to keep walking a path that is hurting you.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">You are irreplaceable, and when you rise, and choose to share your stories,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">you will build roads for others to follow.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">By not putting up with what is hurting you,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">you make the Universe a better place by becoming a beacon of sanity for those who will hear of your adventures.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Returning to school or job with with this dignity and integrity of mind,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">will change the way people treat you.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Not just your confidence, but your wisdom, and strength, and balance,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">will alter your body language.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Stressed people and relaxed people, give off different behavioral clues,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">people including those in charge of budgets can read that very easily.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Terrible people who lack compassion are everywhere,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">sometimes stressed out people will be abused with more stress just because they keep taking it on.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Things get supremely complicated,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">in ways that we can't always understand.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">For example the reason why someone loses their 4.0 may have nothing to do with their performance,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">but with the teacher giving out too many A/s in the previous semester, and now just trying to average things out with the people who never complain, so that the dean doesn't come around complaining that his class sticks out.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">It doesn't matter if it is High School, or College, or what used to be a Dream Job,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">there are unethical fake it until you make it people covering their asses everywhere, it is a tragedy that someone like that should become a reason behind someone's years of suffering.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">These are simple examples I am making up,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">in real life, there is no understanding of all the motives as people who never grew up, constantly interact with each other to to do less, and get more,</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Trouble-making is just a lighthearted way of leaving all that noise behind,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">and regaining your own beauty, and strengths, and awe for the world around you.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Give yourself some trouble that actually makes you better for a change.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">if the path you re walking on feels wrong, you need to begin preparing an adventure backpack.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">A very special Monday is coming around,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">your clock will go off just like always.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">But this time it will die with a sad whimper as you - slowly and deliberately - unplug it from the wall,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">and return to sleep, not worried about your deadline, job or school, but simply knowing full well, that they don't matter anymore; because your well being is infinitely more important.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Then get into your car, or on a bus, and set a direction for sunny weather,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">drive, fly, just go, and do not wait to create your rules of adventure, do it as soon as possible.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">When your health returns to you,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">you'll know exactly where you are going, and schools will always take you back, and jobs that hurt you are now worthy of your concern at all.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Don't make plans about the rest of your life until you catch up where you need to be and become wiser as think things through.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">And finally, if you don't like the idea of trouble making,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">then between You and I let us call it: Love of Life.</div>\n  </div>\n</div>",
  "print": "<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">The best kind of trouble is the trouble you create for yourself,</div>\n  <div class=\"paragraph\">there is no limit to how elaborate of a problem you can invent.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Relativity and contrast play a very important role here,</div>\n  <div class=\"paragraph\">the lower you are and the higher you aim the more it is worth the trouble.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">It is safe to say that a nice and comfortable bed with an electric blanket,</div>\n  <div class=\"paragraph\">on a quiet and sleepy afternoon is a pretty good low.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">A pretty good height to reach is either ten miles by foot,</div>\n  <div class=\"paragraph\">or 1,500 miles by car where it usually involves a beach somewhere.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Moreover, you need a team deadline, a snooze button, a soon to end semester,</div>\n  <div class=\"paragraph\">and an ungrateful team where you do all the work, add a few bullies...</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">and your co-worker whispering:</div>\n  <div class=\"paragraph\">\"Why did she get a raise, she doesn't know anything\" - emphasizing \"she doesn't know\".</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">While not purrfect, this is a really good start,</div>\n  <div class=\"paragraph\">and erasing the deadline from its existence, is a sweet-sweet cherry on top.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">There are too more things you could use, a handful or ungrateful friends,</div>\n  <div class=\"paragraph\">and a really well thought out backpack, and a large solar charger you can hang on the back.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">See, you are not just headed for Key West and back,</div>\n  <div class=\"paragraph\">I m sure you will stop at all the antique stores, and hopefully pawn shops as they have good stuff too.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">A good pawn shop somewhere down in Florida or by an ocean is sure to have a cheap Wet Suit,</div>\n  <div class=\"paragraph\">it is a little known fact that they aid your buoyancy, it is like wrapping your self in a wee boat.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">I think it is really important to consider stopping by the highway accessible State Parks,</div>\n  <div class=\"paragraph\">they are usually there because something beautiful is going on.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">You never know what you find, it could be a little lake, maybe enormous dunes,</div>\n  <div class=\"paragraph\">it could be a hill with a historic watchtower of a lookout, or it could be a stable, with horses.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Personally, I think it is disrespectful for a man to sit on a poor animal,</div>\n  <div class=\"paragraph\">but it is fine for a woman.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">And you certainly don't want to realize come your late golden age,</div>\n  <div class=\"paragraph\">that you never rode a horse, and yet you always knew that you were a cowgirl at heart.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Now, you see what I am saying, you go from a warm and cozy blanket on a lazy afternoon, facing an ugly week,</div>\n  <div class=\"paragraph\">to wondering how to make the damn animal stop galloping, because by now you are in the middle of the woods.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">An hour later as you lead your new equine fiend back,</div>\n  <div class=\"paragraph\">it won't be just that you soul and heart are filling with beauty...</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">...but somehow you will also gain a sense for how irrelevant your deadline was,</div>\n  <div class=\"paragraph\">how nearly falling from your new spirit animal and soul-mate combined to repair your perspective.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">It is never enough to merely dump indoctrination and repair misconceptions,</div>\n  <div class=\"paragraph\">there is also a kind of a fog-of-war that luls you into a life that frankly, you already made too many compromises for.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">In real life you do things out of love, in the other kind of life you compromise,</div>\n  <div class=\"paragraph\">and do that long enough and you will find yourself hardly noticing that you are walking a stranger's road - that ain't good.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Eventually, you pet and pat you horse, give the caretaker a smile,</div>\n  <div class=\"paragraph\">and stop at the next park.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">The more stops you make, the more you will heal and the faster you will catch up with growing up,</div>\n  <div class=\"paragraph\">you can almost feel it in your hands, they will fell empty without a journal.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Now, let me just pause here for a second, and remind you, that you are removing unimportant things from your life,</div>\n  <div class=\"paragraph\">be good to your journal, failing that get a second one, as the first one won't last long at all.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Don't make the same mistake I did, I bought this beautiful leather bound thing,</div>\n  <div class=\"paragraph\">and figured why don't I use a pencil at first...</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">...smart right?</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">It took me hours to try to erase the pages, and most of them still had annoying little bits of letters on it,</div>\n  <div class=\"paragraph\">treat your journal like a friend, and speak in wee little bits.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">If you want to speak at length,</div>\n  <div class=\"paragraph\">do what I am doing, give advice, make a little audio file and put it on the internet.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Healing will make it so that you will want to erase it because it will sound \"dumb\" to you after a bit,</div>\n  <div class=\"paragraph\">but that is only because you are growing really quickly, catching up, others still need the simpler thoughts.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">A lot of people will stay in bed,</div>\n  <div class=\"paragraph\">they will meet the deadline, and that snooze button will slowly turn their joy of life off.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">There is still hope for them, maybe the boss will be super crazy and mean, hopefully,</div>\n  <div class=\"paragraph\">she could then come around and tell them \"Hey! you will never get a raise again?\", that could still snap them out of it.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">But, if the boss is not fully crazed,</div>\n  <div class=\"paragraph\">you are their last hope.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">The trouble you go through to learn to jog,</div>\n  <div class=\"paragraph\">or try to hit every state park, without really caring much for actually making it to Key West.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">As all end of the road towns are tourist traps,</div>\n  <div class=\"paragraph\">so, it is true when they say it is the journey, not the destination.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Except maybe for those six toed cats that Ernest Hemingway left behind in his Key West home,</div>\n  <div class=\"paragraph\">very few things will surprise you with independence, and a cat probably capable of of grasping tools is one of them.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Yeah, all the trouble, and little pit stops, and furry or maned discoveries, serve as a call to health,</div>\n  <div class=\"paragraph\">to all those who are almost ready for it, but not quite there.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">No human should lead the life of a house cat,</div>\n  <div class=\"paragraph\">we are very dynamic, and doing beautiful unusual things helps us stay healthy.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">One, time, I camped next to a couple that brought their two year old to a hike-in site,</div>\n  <div class=\"paragraph\">it was clearly the husband's idea, the wife was angry, and the kid was crying...</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">It was a nice try, but they needed more vacations, and more babysitters,</div>\n  <div class=\"paragraph\">and not just camping, but jogging, trail running, and a plan to visit all the famous lighthouses.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">I am sure she loved the trouble of camping when they started dating,</div>\n  <div class=\"paragraph\">now the inconvenience of it all was making the poor lady, angry, out of the storm of stress.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">I am certain, that she was blaming her self for it,</div>\n  <div class=\"paragraph\">and thinking of her self as just that kind of a person, nobody is angry like that.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Between the three of them, they had everything in the universe, except the trouble was so overwhelming and the fog-of-war so thick.</div>\n  <div class=\"paragraph\">That this, clearly, mighty and courageous mom, was only racing forward to get stuff done.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">They stayed the weekend,</div>\n  <div class=\"paragraph\">but they needed at least three weeks if not months.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">They needed to stop racing forward,</div>\n  <div class=\"paragraph\">they needed more adventures, more \"inconvenience\", more trouble-making as I call it.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">That woman in particular struck me as someone who needed to run the Western States 100,</div>\n  <div class=\"paragraph\">she had the power for it, no, she has a soul for it.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">See emanated the mana that bespoke that,</div>\n  <div class=\"paragraph\">the standard marathons needed to qualify for western states meant nothing to her, it was just a blistering formality.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Anyway, still a glorious couple,</div>\n  <div class=\"paragraph\">and their little one will surely grow up to be an adventurer.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Aside from a raccoon I named Friday, using his cute little hands to soil my hot dog buns,</div>\n  <div class=\"paragraph\">that week brought in another mighty being - this time a teenage boy.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">His father passed away, and he pushed himself too far,</div>\n  <div class=\"paragraph\">the psychologist put him on permanent medicine.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">I had the great honor of speaking to him, he told me he slept in fields and ditches,</div>\n  <div class=\"paragraph\">but he had his sister, or mom, looking out for him.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">He was a Powerful Troublemaker,</div>\n  <div class=\"paragraph\">I told him we need to care for ourselves, our bodies need vitamins, electrolytes, our minds need whatever they need.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">\"There is no such thing as crazy,</div>\n  <div class=\"paragraph\">you just went through a lot in life, it was your life that got crazy.\" - I said to him.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">A thousand miles on a bicycle, which according to my maps requires a little trip to Canada, and a ferry,</div>\n  <div class=\"paragraph\">is all the proof needed that the kid was really special.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">I returned to my camp, and a day or two later,</div>\n  <div class=\"paragraph\">a shadowy figure visited him, his mom probably, and without me paying attention I've noticed it was a slow and mighty, and very heavy conversation.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Knowing he was well, I hope he continued his bicycling, at least to the upper peninsula,</div>\n  <div class=\"paragraph\">though there was a ferry near by, so maybe he was headed for Chicago, I hope they both went.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">See, here is a child well on his way to become a great being,</div>\n  <div class=\"paragraph\">he was learning wisdom, and all he needed was backpack, a bicycle, and a thousand miles of road.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Trouble-making is no joke, it an art,</div>\n  <div class=\"paragraph\">and it is medicine worthy of great heroes.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">If you, my Dear Reader, get stuck, or stung, or scared, or get stuck in a fog of war,</div>\n  <div class=\"paragraph\">know that it is not a time to try harder, and push harder, and let me tell you why without mincing words:</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Because you are absolutely irreplaceable,</div>\n  <div class=\"paragraph\">and - what you think your flaws are - aren't, they are not flaws, this is your uniqueness.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">You will only exist once in the universe,</div>\n  <div class=\"paragraph\">and though you can rain wrath precisely like a god, you also need to pace yourself.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">The best kind of a Warrior is a Laughing Philosopher,</div>\n  <div class=\"paragraph\">not a Berserker (that's too easy), be an Artist.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">It is a huge part of the art of living,</div>\n  <div class=\"paragraph\">to quit blaming yourself for being angry, or clumsy, or never finishing anything you start, or never finding the right person.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">You are not angry, there is nothing wrong with you,</div>\n  <div class=\"paragraph\">you just took on so much weight and made so many compromises that there is no more time left for you to be yourself.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">I know it sounds awful when I say something as simple and go ride a bicycle, or a horse,</div>\n  <div class=\"paragraph\">or give the campsite raccoons so much anxiety that they start clawing their way into nice people's backpacks.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">But that is how it works, the way out of fog of war,</div>\n  <div class=\"paragraph\">must be simple so that you have no trouble taking it.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">No one is asking you to drop out of school permanently,</div>\n  <div class=\"paragraph\">you're not going to be homeless, you will find a better job.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">You only need to say the truth to your next employer,</div>\n  <div class=\"paragraph\">your mental health, and your joy of life, and a balanced existence is critical to a healthy existence.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Just because someone can lay down their life to meet a deadline whilst kissing ass and never asking for a raise,</div>\n  <div class=\"paragraph\">it does not mean anybody healthy will ever try.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">If principals or teachers, or management or anything gets crazy on you,</div>\n  <div class=\"paragraph\">don't quit, just don't comply because doing so will hurt you, just take a vacation, because your mental and physical health is more important than anything else, period.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">If you are still not hearing this, if you are still not ready not to sacrifice yourself,</div>\n  <div class=\"paragraph\">let me say this, there is a lot of people out there who like that Mighty Teenager do have a breaking point that will scare the bajezus out of a shrink, who is only too happy to prescribe something.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Your self-compassion, your dignity, your beauty,</div>\n  <div class=\"paragraph\">and the power that your laughter, your foolishness, your silliness, your mischievousness, and above all your giggles exert on the universe that surrounds you is to important to us all for you to keep walking a path that is hurting you.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">You are irreplaceable, and when you rise, and choose to share your stories,</div>\n  <div class=\"paragraph\">you will build roads for others to follow.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">By not putting up with what is hurting you,</div>\n  <div class=\"paragraph\">you make the Universe a better place by becoming a beacon of sanity for those who will hear of your adventures.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Returning to school or job with with this dignity and integrity of mind,</div>\n  <div class=\"paragraph\">will change the way people treat you.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Not just your confidence, but your wisdom, and strength, and balance,</div>\n  <div class=\"paragraph\">will alter your body language.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Stressed people and relaxed people, give off different behavioral clues,</div>\n  <div class=\"paragraph\">people including those in charge of budgets can read that very easily.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Terrible people who lack compassion are everywhere,</div>\n  <div class=\"paragraph\">sometimes stressed out people will be abused with more stress just because they keep taking it on.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Things get supremely complicated,</div>\n  <div class=\"paragraph\">in ways that we can't always understand.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">For example the reason why someone loses their 4.0 may have nothing to do with their performance,</div>\n  <div class=\"paragraph\">but with the teacher giving out too many A/s in the previous semester, and now just trying to average things out with the people who never complain, so that the dean doesn't come around complaining that his class sticks out.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">It doesn't matter if it is High School, or College, or what used to be a Dream Job,</div>\n  <div class=\"paragraph\">there are unethical fake it until you make it people covering their asses everywhere, it is a tragedy that someone like that should become a reason behind someone's years of suffering.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">These are simple examples I am making up,</div>\n  <div class=\"paragraph\">in real life, there is no understanding of all the motives as people who never grew up, constantly interact with each other to to do less, and get more,</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Trouble-making is just a lighthearted way of leaving all that noise behind,</div>\n  <div class=\"paragraph\">and regaining your own beauty, and strengths, and awe for the world around you.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Give yourself some trouble that actually makes you better for a change.</div>\n  <div class=\"paragraph\">if the path you re walking on feels wrong, you need to begin preparing an adventure backpack.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">A very special Monday is coming around,</div>\n  <div class=\"paragraph\">your clock will go off just like always.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">But this time it will die with a sad whimper as you - slowly and deliberately - unplug it from the wall,</div>\n  <div class=\"paragraph\">and return to sleep, not worried about your deadline, job or school, but simply knowing full well, that they don't matter anymore; because your well being is infinitely more important.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Then get into your car, or on a bus, and set a direction for sunny weather,</div>\n  <div class=\"paragraph\">drive, fly, just go, and do not wait to create your rules of adventure, do it as soon as possible.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">When your health returns to you,</div>\n  <div class=\"paragraph\">you'll know exactly where you are going, and schools will always take you back, and jobs that hurt you are now worthy of your concern at all.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Don't make plans about the rest of your life until you catch up where you need to be and become wiser as think things through.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">And finally, if you don't like the idea of trouble making,</div>\n  <div class=\"paragraph\">then between You and I let us call it: Love of Life.</div>\n</div>",
  "text": "The best kind of trouble is the trouble you create for yourself,\nthere is no limit to how elaborate of a problem you can invent.\n\nRelativity and contrast play a very important role here,\nthe lower you are and the higher you aim the more it is worth the trouble.\n\nIt is safe to say that a nice and comfortable bed with an electric blanket,\non a quiet and sleepy afternoon is a pretty good low.\n\nA pretty good height to reach is either ten miles by foot,\nor 1,500 miles by car where it usually involves a beach somewhere.\n\nMoreover, you need a team deadline, a snooze button, a soon to end semester,\nand an ungrateful team where you do all the work, add a few bullies...\n\nand your co-worker whispering:\n\"Why did she get a raise, she doesn't know anything\" - emphasizing \"she doesn't know\".\n\nWhile not purrfect, this is a really good start,\nand erasing the deadline from its existence, is a sweet-sweet cherry on top.\n\nThere are too more things you could use, a handful or ungrateful friends,\nand a really well thought out backpack, and a large solar charger you can hang on the back.\n\nSee, you are not just headed for Key West and back,\nI m sure you will stop at all the antique stores, and hopefully pawn shops as they have good stuff too.\n\nA good pawn shop somewhere down in Florida or by an ocean is sure to have a cheap Wet Suit,\nit is a little known fact that they aid your buoyancy, it is like wrapping your self in a wee boat.\n\nI think it is really important to consider stopping by the highway accessible State Parks,\nthey are usually there because something beautiful is going on.\n\nYou never know what you find, it could be a little lake, maybe enormous dunes,\nit could be a hill with a historic watchtower of a lookout, or it could be a stable, with horses.\n\nPersonally, I think it is disrespectful for a man to sit on a poor animal,\nbut it is fine for a woman.\n\nAnd you certainly don't want to realize come your late golden age,\nthat you never rode a horse, and yet you always knew that you were a cowgirl at heart.\n\nNow, you see what I am saying, you go from a warm and cozy blanket on a lazy afternoon, facing an ugly week,\nto wondering how to make the damn animal stop galloping, because by now you are in the middle of the woods.\n\nAn hour later as you lead your new equine fiend back,\nit won't be just that you soul and heart are filling with beauty...\n\n...but somehow you will also gain a sense for how irrelevant your deadline was,\nhow nearly falling from your new spirit animal and soul-mate combined to repair your perspective.\n\nIt is never enough to merely dump indoctrination and repair misconceptions,\nthere is also a kind of a fog-of-war that luls you into a life that frankly, you already made too many compromises for.\n\nIn real life you do things out of love, in the other kind of life you compromise,\nand do that long enough and you will find yourself hardly noticing that you are walking a stranger's road - that ain't good.\n\nEventually, you pet and pat you horse, give the caretaker a smile,\nand stop at the next park.\n\nThe more stops you make, the more you will heal and the faster you will catch up with growing up,\nyou can almost feel it in your hands, they will fell empty without a journal.\n\nNow, let me just pause here for a second, and remind you, that you are removing unimportant things from your life,\nbe good to your journal, failing that get a second one, as the first one won't last long at all.\n\nDon't make the same mistake I did, I bought this beautiful leather bound thing,\nand figured why don't I use a pencil at first...\n\n...smart right?\n\nIt took me hours to try to erase the pages, and most of them still had annoying little bits of letters on it,\ntreat your journal like a friend, and speak in wee little bits.\n\nIf you want to speak at length,\ndo what I am doing, give advice, make a little audio file and put it on the internet.\n\nHealing will make it so that you will want to erase it because it will sound \"dumb\" to you after a bit,\nbut that is only because you are growing really quickly, catching up, others still need the simpler thoughts.\n\nA lot of people will stay in bed,\nthey will meet the deadline, and that snooze button will slowly turn their joy of life off.\n\nThere is still hope for them, maybe the boss will be super crazy and mean, hopefully,\nshe could then come around and tell them \"Hey! you will never get a raise again?\", that could still snap them out of it.\n\nBut, if the boss is not fully crazed,\nyou are their last hope.\n\nThe trouble you go through to learn to jog,\nor try to hit every state park, without really caring much for actually making it to Key West.\n\nAs all end of the road towns are tourist traps,\nso, it is true when they say it is the journey, not the destination.\n\nExcept maybe for those six toed cats that Ernest Hemingway left behind in his Key West home,\nvery few things will surprise you with independence, and a cat probably capable of of grasping tools is one of them.\n\nYeah, all the trouble, and little pit stops, and furry or maned discoveries, serve as a call to health,\nto all those who are almost ready for it, but not quite there.\n\nNo human should lead the life of a house cat,\nwe are very dynamic, and doing beautiful unusual things helps us stay healthy.\n\nOne, time, I camped next to a couple that brought their two year old to a hike-in site,\nit was clearly the husband's idea, the wife was angry, and the kid was crying...\n\nIt was a nice try, but they needed more vacations, and more babysitters,\nand not just camping, but jogging, trail running, and a plan to visit all the famous lighthouses.\n\nI am sure she loved the trouble of camping when they started dating,\nnow the inconvenience of it all was making the poor lady, angry, out of the storm of stress.\n\nI am certain, that she was blaming her self for it,\nand thinking of her self as just that kind of a person, nobody is angry like that.\n\nBetween the three of them, they had everything in the universe, except the trouble was so overwhelming and the fog-of-war so thick.\nThat this, clearly, mighty and courageous mom, was only racing forward to get stuff done.\n\nThey stayed the weekend,\nbut they needed at least three weeks if not months.\n\nThey needed to stop racing forward,\nthey needed more adventures, more \"inconvenience\", more trouble-making as I call it.\n\nThat woman in particular struck me as someone who needed to run the Western States 100,\nshe had the power for it, no, she has a soul for it.\n\nSee emanated the mana that bespoke that,\nthe standard marathons needed to qualify for western states meant nothing to her, it was just a blistering formality.\n\nAnyway, still a glorious couple,\nand their little one will surely grow up to be an adventurer.\n\nAside from a raccoon I named Friday, using his cute little hands to soil my hot dog buns,\nthat week brought in another mighty being - this time a teenage boy.\n\nHis father passed away, and he pushed himself too far,\nthe psychologist put him on permanent medicine.\n\nI had the great honor of speaking to him, he told me he slept in fields and ditches,\nbut he had his sister, or mom, looking out for him.\n\nHe was a Powerful Troublemaker,\nI told him we need to care for ourselves, our bodies need vitamins, electrolytes, our minds need whatever they need.\n\n\"There is no such thing as crazy,\nyou just went through a lot in life, it was your life that got crazy.\" - I said to him.\n\nA thousand miles on a bicycle, which according to my maps requires a little trip to Canada, and a ferry,\nis all the proof needed that the kid was really special.\n\nI returned to my camp, and a day or two later,\na shadowy figure visited him, his mom probably, and without me paying attention I've noticed it was a slow and mighty, and very heavy conversation.\n\nKnowing he was well, I hope he continued his bicycling, at least to the upper peninsula,\nthough there was a ferry near by, so maybe he was headed for Chicago, I hope they both went.\n\nSee, here is a child well on his way to become a great being,\nhe was learning wisdom, and all he needed was backpack, a bicycle, and a thousand miles of road.\n\nTrouble-making is no joke, it an art,\nand it is medicine worthy of great heroes.\n\nIf you, my Dear Reader, get stuck, or stung, or scared, or get stuck in a fog of war,\nknow that it is not a time to try harder, and push harder, and let me tell you why without mincing words:\n\nBecause you are absolutely irreplaceable,\nand - what you think your flaws are - aren't, they are not flaws, this is your uniqueness.\n\nYou will only exist once in the universe,\nand though you can rain wrath precisely like a god, you also need to pace yourself.\n\nThe best kind of a Warrior is a Laughing Philosopher,\nnot a Berserker (that's too easy), be an Artist.\n\nIt is a huge part of the art of living,\nto quit blaming yourself for being angry, or clumsy, or never finishing anything you start, or never finding the right person.\n\nYou are not angry, there is nothing wrong with you,\nyou just took on so much weight and made so many compromises that there is no more time left for you to be yourself.\n\nI know it sounds awful when I say something as simple and go ride a bicycle, or a horse,\nor give the campsite raccoons so much anxiety that they start clawing their way into nice people's backpacks.\n\nBut that is how it works, the way out of fog of war,\nmust be simple so that you have no trouble taking it.\n\nNo one is asking you to drop out of school permanently,\nyou're not going to be homeless, you will find a better job.\n\nYou only need to say the truth to your next employer,\nyour mental health, and your joy of life, and a balanced existence is critical to a healthy existence.\n\nJust because someone can lay down their life to meet a deadline whilst kissing ass and never asking for a raise,\nit does not mean anybody healthy will ever try.\n\nIf principals or teachers, or management or anything gets crazy on you,\ndon't quit, just don't comply because doing so will hurt you, just take a vacation, because your mental and physical health is more important than anything else, period.\n\nIf you are still not hearing this, if you are still not ready not to sacrifice yourself,\nlet me say this, there is a lot of people out there who like that Mighty Teenager do have a breaking point that will scare the bajezus out of a shrink, who is only too happy to prescribe something.\n\nYour self-compassion, your dignity, your beauty,\nand the power that your laughter, your foolishness, your silliness, your mischievousness, and above all your giggles exert on the universe that surrounds you is to important to us all for you to keep walking a path that is hurting you.\n\nYou are irreplaceable, and when you rise, and choose to share your stories,\nyou will build roads for others to follow.\n\nBy not putting up with what is hurting you,\nyou make the Universe a better place by becoming a beacon of sanity for those who will hear of your adventures.\n\nReturning to school or job with with this dignity and integrity of mind,\nwill change the way people treat you.\n\nNot just your confidence, but your wisdom, and strength, and balance,\nwill alter your body language.\n\nStressed people and relaxed people, give off different behavioral clues,\npeople including those in charge of budgets can read that very easily.\n\nTerrible people who lack compassion are everywhere,\nsometimes stressed out people will be abused with more stress just because they keep taking it on.\n\nThings get supremely complicated,\nin ways that we can't always understand.\n\nFor example the reason why someone loses their 4.0 may have nothing to do with their performance,\nbut with the teacher giving out too many A/s in the previous semester, and now just trying to average things out with the people who never complain, so that the dean doesn't come around complaining that his class sticks out.\n\nIt doesn't matter if it is High School, or College, or what used to be a Dream Job,\nthere are unethical fake it until you make it people covering their asses everywhere, it is a tragedy that someone like that should become a reason behind someone's years of suffering.\n\nThese are simple examples I am making up,\nin real life, there is no understanding of all the motives as people who never grew up, constantly interact with each other to to do less, and get more,\n\nTrouble-making is just a lighthearted way of leaving all that noise behind,\nand regaining your own beauty, and strengths, and awe for the world around you.\n\nGive yourself some trouble that actually makes you better for a change.\nif the path you re walking on feels wrong, you need to begin preparing an adventure backpack.\n\nA very special Monday is coming around,\nyour clock will go off just like always.\n\nBut this time it will die with a sad whimper as you - slowly and deliberately - unplug it from the wall,\nand return to sleep, not worried about your deadline, job or school, but simply knowing full well, that they don't matter anymore; because your well being is infinitely more important.\n\nThen get into your car, or on a bus, and set a direction for sunny weather,\ndrive, fly, just go, and do not wait to create your rules of adventure, do it as soon as possible.\n\nWhen your health returns to you,\nyou'll know exactly where you are going, and schools will always take you back, and jobs that hurt you are now worthy of your concern at all.\n\nDon't make plans about the rest of your life until you catch up where you need to be and become wiser as think things through.\n\nAnd finally, if you don't like the idea of trouble making,\nthen between You and I let us call it: Love of Life.",
  "images": [],
  "links": []
}