{
  "name": "furkies-purrkies-poetry-0495",
  "id": "furkies-purrkies-poetry-0495",
  "title": "Wisdom And The Art Of Bicycle Maintenance",
  "date": "2021-07-09T01:57:19.882Z",
  "image": "poetry-0495-illustration.jpg",
  "artwork": "https://unsplash.com/photos/Y60q9L_ZS00",
  "audio": "poetry-0495.mp3",
  "html": "<div class=\"section\">\n  <p>I wanted to jump on my bicycle this evening as the sun was behind clouds,<br>but it didn't look like it was going to rain.</p>\n  <p>I packed this and that, and put some fancy futuristic electrolyte mix in my water,<br>I squiЯted a bunch of fragrant bug repellent on myself, and boy did it work.</p>\n  <p>And as I was just about to leave,<br>I discovered I had a flat tire.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>My goodness, entire books can be written on the art of fixing a bicycle flat,<br>it seems like an easy fix, but it is trouble.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>First of all, I was lucky this time that I was home,<br>my first flat tire happened many miles away and I had to walk, and jog back home.</p>\n  <p>Half way through I had to drag the bicycle as the tire assembly came completely undone,<br>I actually tried to refill it at a gas station, just about all I had was some quarters for the air machine.</p>\n  <p>I don't remember how that worked out,<br>It was a stressful moment, because of how far away from home I was.</p>\n  <p>I eventually left the bicycle at a Highway Rest area,<br>and then jogged to get my car, got on the highway drove to the rest area and picked up my bicycle.</p>\n  <p>This was an old bicycle from a garage sale,<br>and it had a huge problem with the pedals.</p>\n  <p>Once I fixed the tire I went to a pricey repair shop for expensive bicycles,<br>and eventually caught on why the mechanic was acting slightly odd, and I asked:</p>\n  <p>\"Is this a cheap bicycle\".</p>\n  <p>Yes, he said with a deep tone,<br>and a kind of a detached relief that I caught on.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>I ended up with a neat mountain bike,<br>and when it started wearing out, I got a Fat Tire bike.</p>\n  <p>I learned a lot, all these bikes are super cheap,<br>and the more things they have, the more things will get broken.</p>\n  <p>My Mountain Bike had disc brakes,<br>but I had to adjust them a number of times, and never quite got it right.</p>\n  <p>Then, I fell from my bicycle, and bent the aluminum frame,<br>and pretty badly too.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>The fat tire bike, has no extras,<br>it has no special brakes, by the handle bar.</p>\n  <p>To stop it there is a break built into the internal pedal assembly,<br>it triggers when you move the pedals back.</p>\n  <p>As little as there is to go wrong, things still go wrong,<br>I actually had to go back to the store and get a replacement bicycle because the brake failed.</p>\n  <p>I added an extra bracket to the replacement bike,<br>to prevent the same failure.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Then a tire went out,<br>at I got a second Fat Tire bike, exact same thing, it was on sale for $135 dollars.</p>\n  <p>I maybe trying to fix that tire tomorrow,<br>but I don't think it is going to work.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>The first bicycle wisdom, is,<br>have two cheap bicycles, this way you never have any down time, and no surprises, you can ride your good one and fix the broken one.</p>\n  <p>All the tools and maintenance items that have ever touched your bicycle,<br>have to ride a long with you, and you have to check them for damage.</p>\n  <p>I ran over a pointy stick in my second Fat Tire bike,<br>and my back tire exploded, the stick actually flew up in the air.</p>\n  <p>The hole is still there, and the inner tube is unprotected in that spot,<br>it is slightly larger than a pencil.</p>\n  <p>This happened about eight miles from my apartment,<br>and while I had all the tools, the glue on the stickers for my inner tube dried out, as did the little used tube of tire cement.</p>\n  <p>My tire repair kit was too old,<br>I walked a mile or two to a gas station, and had my parents pick me up.</p>\n  <p>The next day I used another bicycle, to get to my fat tire bike, repair its tire so that it would spin,<br>and then I slowly rode back on one bicycle, while holding the other.</p>\n  <p>Somewhere in there, my phone fell on concrete, and just stopped working,<br>and I ended up getting a new phone number with my el cheapo replacement phone, yikes.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Another time, for the world in me, I was unable to locate where the puncture was,<br>and I tried like crazy, soap bubbles and everything.</p>\n  <p>I actually had to go to the supermarket and get a little plastic kiddie pool,<br>then I filled it with water and soap, and only then found the microscopic puncture.</p>\n  <p>The wisdom for this problem is, find the piece of metal that punctured your tire,<br>and then carefully examine the inner tube in the same spot.</p>\n  <p>You will need to do some detective work,<br>it does not have to be a very big hole to deflate a tire overnight.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>I was lucky today, I found a very old roofing nail,<br>this thing could be from 1920's, you can see the structure of the metal, it looks like the top half of a nail.</p>\n  <p>But even so, because I didn't notice the flat tire for a few of days,<br>the rubber structure got out of shape, and that is really bad news.</p>\n  <p>Because, all tires, are ever so slightly larger than the metal rim they sit on,<br>this is on purpose, this gives you the much needed wiggle room to take the tire off of the rim.</p>\n  <p>And you have to use a little plastic wedge, I had one of them snap on me today,<br>without that extra wiggle room, it may not be possible to take the tire off the rim.</p>\n  <p>The part of the tire that touches the metal rim has metal wires in it,<br>there is no stretching there, you only get the wiggle room.</p>\n  <p>I used my remaining two wedges to negotiate the tire off the rim, but only in the spot where the nail was,<br>that allowed me to grab the inner tube, and pull it out, and then I used some \"bubbles\" to verify that a tiny little black dot I spotted there, was the problem spot.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>You need multiple tire repair kits, just in case you break off that little wedge,<br>or end up buying a kit that is so old that all of the glue died out.</p>\n  <p>They weigh nothing, they take up no space,<br>just get three different brands or styles.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>One time I noticed an abandoned bicycle, and then few minutes later a gentleman hurrying to Ford. Rd.,<br>I flat out asked him if he need a tire repair kit and held out one of my unused, unopened boxes, it was the good stuff too.</p>\n  <p>He was like \"Dude?\", he had his phone with him, and my guess was that he called one of his friends to pick him up,<br>they were going to go to the store get a kit and he would go back to fix his bicycle.</p>\n  <p>I turned an hour long problem,<br>into five minutes of nuisance, he already knew how to fix tires, he even had a no-nonsense air pump with him.</p>\n  <p>Just the moment he took the kit, I took off,<br>but I learned from him to get a no-nonsense air pump.</p>\n  <p>Using the little ones is crazy to me,<br>I got one for $11 buck or so, and it didn't seem to work at all, I am pretty sure the one I have is good motorcycles.</p>\n  <p>I actually ended up buying Velcro straps to attach it to my handlebar,<br>it takes like 30 pumps to fill a tire, it is awesome.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>I scratched up the surface where the little hole was with sand paper,<br>I put a layer of glue on it, then I used a fresh square of rubber that also had some glue on it, and when that dried, I added extra glue around the edges.</p>\n  <p>Always do a glue sandwich,<br>put the glue everywhere, the glue that is on the patch is not very good, you need glue that is hermetically closed in an aluminum tube.</p>\n  <p>This is the difference between walking and riding,<br>serious business.</p>\n  <p>When I ride my bicycle early spring,<br>there are metal wires, and nails everywhere, from construction, maybe snow plows pushing highway garbage onto the trail...</p>\n  <p>and certainly from that steel wired inner part of truck tires,<br>once a tire falls to pieces, and patches of that rubber and steel start decaying after some years, it becomes like little needles.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Once I put in the inner tube, and inflated it, in those 30 pumps or so,<br>my bicycle tire came apart.</p>\n  <p>Probably mostly because the tire was deformed,<br>from sitting flat for a few days until I noticed it.</p>\n  <p>This deformation, will combine with that little wiggle room you have,<br>to make it so that your tire just comes apart.</p>\n  <p>That wiggle room, when the tire is perfectly centered around the rim,<br>disappears completely.</p>\n  <p>You have to inflate your tire just enough,<br>to start walking your bicycle in circles, and let things balance out.</p>\n  <p>Let that deformation lose the hold over your tire,<br>let the tire distribute it self around the rim.</p>\n  <p>Just do a few circles walking the bike,<br>and then resume inflating it.</p>\n  <p>For myself, just to be sure,<br>I stopped a second time, and got on the bicycle and rolled forward an back, to get that wiggle room to distribute it self perfectly around the metal rim.</p>\n  <p>It took a couple of tries, so be patient, rinse and repeat,<br>that wiggle room is not your enemy, it is there so that you can take the tire off the rim, and fix your flat.</p>\n  <p>But as you are inflating the tire, roll the dough,<br>massage the tire into the center, so that the wiggle room is not in any spot, or your inner tube will push the tire apart in that spot.</p>\n  <p>Do not inflate with wiggle room present,<br>or things will get frustrating.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>One time, when I still had my Mountain Bike,<br>I've noticed a boy pushing his bicycle really hard with the chain being stuck between gears and those spokes that hold the rim up.</p>\n  <p>He said he wanted a movie, so he grabbed a bicycle, and this thing just fell apart, can I fix it,<br>I think I got it going, he was really shaken up, he was not having a good time.</p>\n  <p>I don't think I just left him there pushing the damn thing forward,<br>I probably pulled out the chain, and put it back on the gear, but also would have warned him that this won't hold up.</p>\n  <p>He said he went to a nearby repair shop and they wanted money,<br>for him using their tools.</p>\n  <p>I was coming back from one of my longest adventures, I was tired,<br>but I am certain I put the chain back on, though at the time, I didn't know enough about bicycles to push his rear tire back and tighten the chain.</p>\n  <p>I do remember however that, that after I did whatever I could, I went to the repair store,<br>and said that the boy is really shaken up, and that we need to help each other, and my voice broke, I closed the door an went on my way.</p>\n  <p>I told several people about that heartlessness and laziness,<br>and told them to avoid that store, they are overprices and reek of predatory behavior.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>The big wisdom here, is to stop inflating the tire about 30% in,<br>and roll the dough, get that tire in the center of the rim.</p>\n  <p>And before you take off with your patched tire,<br>triple check that you got all the tools back into your bicycle bags.</p>\n  <p>Anything and everything that is used to service your bicycle,<br>has to be mounted on the bicycle.</p>\n  <p>It was already 8:45 when I left, so it was going to be dark on my way back,<br>while I had my flashlight, I forgot my headlamp, not good.</p>\n  <p>But I remembered bug spray, always remember bug spray,<br>4 miles in, about half way through my ride...</p>\n  <p>My left pedal started feeling loose, the thing was going to fall off in 10 minutes flat,<br>and if I was unlucky I would lose the assembly that held it in place.</p>\n  <p>It was getting dark, and the moment I stopped mosquitoes were all over my face,<br>there were so many of them, that I just ended up spraying them with bug repellent - and I did not get bit.</p>\n  <p>I needed the correct tools, and one of those fun wrenches that makes a fancy sound,<br>and since the screw holding a pedal is inset in the pedal, I needed a socket thing.</p>\n  <p>Because I keep all the tools on the bicycle,<br>I had everything with me, and the repair took two minuets.</p>\n  <p>The socket thing was slightly too big, metric probably,<br>but with mosquitoes flying around my face I didn't have time to look for the correct thing.</p>\n  <p>The wisdom here,<br>always have all the tools on the bicycle, everything that ever touched your bicycle, because you never know what will break next.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>In return for my preponderates,<br>quick repairs to my tire, and successful field repair of my pedal.</p>\n  <p>I got to see a Gentlemanly Raccoon cross my road,<br>and when I said \"Hello, Mr. Fancy Raccoon, How Do?\"</p>\n  <p>It actually paused for a split second,<br>and turned his ear towards me.</p>\n  <p>As if wondering,<br>how in the heck does he know my name?</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>It is a little know fact, that when a raccoon crosses your road,<br>you are granted over one hundred years of cheerfulness, health, handsomeness and good looks.</p>\n</div>",
  "bootstrap": "<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I wanted to jump on my bicycle this evening as the sun was behind clouds,<br>but it didn't look like it was going to rain.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I packed this and that, and put some fancy futuristic electrolyte mix in my water,<br>I squiЯted a bunch of fragrant bug repellent on myself, and boy did it work.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">And as I was just about to leave,<br>I discovered I had a flat tire.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">My goodness, entire books can be written on the art of fixing a bicycle flat,<br>it seems like an easy fix, but it is trouble.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">First of all, I was lucky this time that I was home,<br>my first flat tire happened many miles away and I had to walk, and jog back home.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Half way through I had to drag the bicycle as the tire assembly came completely undone,<br>I actually tried to refill it at a gas station, just about all I had was some quarters for the air machine.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I don't remember how that worked out,<br>It was a stressful moment, because of how far away from home I was.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I eventually left the bicycle at a Highway Rest area,<br>and then jogged to get my car, got on the highway drove to the rest area and picked up my bicycle.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">This was an old bicycle from a garage sale,<br>and it had a huge problem with the pedals.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Once I fixed the tire I went to a pricey repair shop for expensive bicycles,<br>and eventually caught on why the mechanic was acting slightly odd, and I asked:</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">\"Is this a cheap bicycle\".</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Yes, he said with a deep tone,<br>and a kind of a detached relief that I caught on.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I ended up with a neat mountain bike,<br>and when it started wearing out, I got a Fat Tire bike.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I learned a lot, all these bikes are super cheap,<br>and the more things they have, the more things will get broken.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">My Mountain Bike had disc brakes,<br>but I had to adjust them a number of times, and never quite got it right.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Then, I fell from my bicycle, and bent the aluminum frame,<br>and pretty badly too.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The fat tire bike, has no extras,<br>it has no special brakes, by the handle bar.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">To stop it there is a break built into the internal pedal assembly,<br>it triggers when you move the pedals back.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">As little as there is to go wrong, things still go wrong,<br>I actually had to go back to the store and get a replacement bicycle because the brake failed.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I added an extra bracket to the replacement bike,<br>to prevent the same failure.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Then a tire went out,<br>at I got a second Fat Tire bike, exact same thing, it was on sale for $135 dollars.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I maybe trying to fix that tire tomorrow,<br>but I don't think it is going to work.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The first bicycle wisdom, is,<br>have two cheap bicycles, this way you never have any down time, and no surprises, you can ride your good one and fix the broken one.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">All the tools and maintenance items that have ever touched your bicycle,<br>have to ride a long with you, and you have to check them for damage.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I ran over a pointy stick in my second Fat Tire bike,<br>and my back tire exploded, the stick actually flew up in the air.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The hole is still there, and the inner tube is unprotected in that spot,<br>it is slightly larger than a pencil.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">This happened about eight miles from my apartment,<br>and while I had all the tools, the glue on the stickers for my inner tube dried out, as did the little used tube of tire cement.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">My tire repair kit was too old,<br>I walked a mile or two to a gas station, and had my parents pick me up.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The next day I used another bicycle, to get to my fat tire bike, repair its tire so that it would spin,<br>and then I slowly rode back on one bicycle, while holding the other.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Somewhere in there, my phone fell on concrete, and just stopped working,<br>and I ended up getting a new phone number with my el cheapo replacement phone, yikes.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Another time, for the world in me, I was unable to locate where the puncture was,<br>and I tried like crazy, soap bubbles and everything.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I actually had to go to the supermarket and get a little plastic kiddie pool,<br>then I filled it with water and soap, and only then found the microscopic puncture.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The wisdom for this problem is, find the piece of metal that punctured your tire,<br>and then carefully examine the inner tube in the same spot.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">You will need to do some detective work,<br>it does not have to be a very big hole to deflate a tire overnight.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I was lucky today, I found a very old roofing nail,<br>this thing could be from 1920's, you can see the structure of the metal, it looks like the top half of a nail.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">But even so, because I didn't notice the flat tire for a few of days,<br>the rubber structure got out of shape, and that is really bad news.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Because, all tires, are ever so slightly larger than the metal rim they sit on,<br>this is on purpose, this gives you the much needed wiggle room to take the tire off of the rim.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">And you have to use a little plastic wedge, I had one of them snap on me today,<br>without that extra wiggle room, it may not be possible to take the tire off the rim.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The part of the tire that touches the metal rim has metal wires in it,<br>there is no stretching there, you only get the wiggle room.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I used my remaining two wedges to negotiate the tire off the rim, but only in the spot where the nail was,<br>that allowed me to grab the inner tube, and pull it out, and then I used some \"bubbles\" to verify that a tiny little black dot I spotted there, was the problem spot.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">You need multiple tire repair kits, just in case you break off that little wedge,<br>or end up buying a kit that is so old that all of the glue died out.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">They weigh nothing, they take up no space,<br>just get three different brands or styles.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">One time I noticed an abandoned bicycle, and then few minutes later a gentleman hurrying to Ford. Rd.,<br>I flat out asked him if he need a tire repair kit and held out one of my unused, unopened boxes, it was the good stuff too.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">He was like \"Dude?\", he had his phone with him, and my guess was that he called one of his friends to pick him up,<br>they were going to go to the store get a kit and he would go back to fix his bicycle.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I turned an hour long problem,<br>into five minutes of nuisance, he already knew how to fix tires, he even had a no-nonsense air pump with him.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Just the moment he took the kit, I took off,<br>but I learned from him to get a no-nonsense air pump.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Using the little ones is crazy to me,<br>I got one for $11 buck or so, and it didn't seem to work at all, I am pretty sure the one I have is good motorcycles.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I actually ended up buying Velcro straps to attach it to my handlebar,<br>it takes like 30 pumps to fill a tire, it is awesome.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I scratched up the surface where the little hole was with sand paper,<br>I put a layer of glue on it, then I used a fresh square of rubber that also had some glue on it, and when that dried, I added extra glue around the edges.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Always do a glue sandwich,<br>put the glue everywhere, the glue that is on the patch is not very good, you need glue that is hermetically closed in an aluminum tube.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">This is the difference between walking and riding,<br>serious business.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">When I ride my bicycle early spring,<br>there are metal wires, and nails everywhere, from construction, maybe snow plows pushing highway garbage onto the trail...</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">and certainly from that steel wired inner part of truck tires,<br>once a tire falls to pieces, and patches of that rubber and steel start decaying after some years, it becomes like little needles.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Once I put in the inner tube, and inflated it, in those 30 pumps or so,<br>my bicycle tire came apart.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Probably mostly because the tire was deformed,<br>from sitting flat for a few days until I noticed it.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">This deformation, will combine with that little wiggle room you have,<br>to make it so that your tire just comes apart.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">That wiggle room, when the tire is perfectly centered around the rim,<br>disappears completely.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">You have to inflate your tire just enough,<br>to start walking your bicycle in circles, and let things balance out.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Let that deformation lose the hold over your tire,<br>let the tire distribute it self around the rim.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Just do a few circles walking the bike,<br>and then resume inflating it.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">For myself, just to be sure,<br>I stopped a second time, and got on the bicycle and rolled forward an back, to get that wiggle room to distribute it self perfectly around the metal rim.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">It took a couple of tries, so be patient, rinse and repeat,<br>that wiggle room is not your enemy, it is there so that you can take the tire off the rim, and fix your flat.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">But as you are inflating the tire, roll the dough,<br>massage the tire into the center, so that the wiggle room is not in any spot, or your inner tube will push the tire apart in that spot.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Do not inflate with wiggle room present,<br>or things will get frustrating.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">One time, when I still had my Mountain Bike,<br>I've noticed a boy pushing his bicycle really hard with the chain being stuck between gears and those spokes that hold the rim up.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">He said he wanted a movie, so he grabbed a bicycle, and this thing just fell apart, can I fix it,<br>I think I got it going, he was really shaken up, he was not having a good time.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I don't think I just left him there pushing the damn thing forward,<br>I probably pulled out the chain, and put it back on the gear, but also would have warned him that this won't hold up.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">He said he went to a nearby repair shop and they wanted money,<br>for him using their tools.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I was coming back from one of my longest adventures, I was tired,<br>but I am certain I put the chain back on, though at the time, I didn't know enough about bicycles to push his rear tire back and tighten the chain.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I do remember however that, that after I did whatever I could, I went to the repair store,<br>and said that the boy is really shaken up, and that we need to help each other, and my voice broke, I closed the door an went on my way.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I told several people about that heartlessness and laziness,<br>and told them to avoid that store, they are overprices and reek of predatory behavior.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The big wisdom here, is to stop inflating the tire about 30% in,<br>and roll the dough, get that tire in the center of the rim.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">And before you take off with your patched tire,<br>triple check that you got all the tools back into your bicycle bags.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Anything and everything that is used to service your bicycle,<br>has to be mounted on the bicycle.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">It was already 8:45 when I left, so it was going to be dark on my way back,<br>while I had my flashlight, I forgot my headlamp, not good.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">But I remembered bug spray, always remember bug spray,<br>4 miles in, about half way through my ride...</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">My left pedal started feeling loose, the thing was going to fall off in 10 minutes flat,<br>and if I was unlucky I would lose the assembly that held it in place.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">It was getting dark, and the moment I stopped mosquitoes were all over my face,<br>there were so many of them, that I just ended up spraying them with bug repellent - and I did not get bit.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I needed the correct tools, and one of those fun wrenches that makes a fancy sound,<br>and since the screw holding a pedal is inset in the pedal, I needed a socket thing.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Because I keep all the tools on the bicycle,<br>I had everything with me, and the repair took two minuets.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The socket thing was slightly too big, metric probably,<br>but with mosquitoes flying around my face I didn't have time to look for the correct thing.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The wisdom here,<br>always have all the tools on the bicycle, everything that ever touched your bicycle, because you never know what will break next.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">In return for my preponderates,<br>quick repairs to my tire, and successful field repair of my pedal.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I got to see a Gentlemanly Raccoon cross my road,<br>and when I said \"Hello, Mr. Fancy Raccoon, How Do?\"</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">It actually paused for a split second,<br>and turned his ear towards me.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">As if wondering,<br>how in the heck does he know my name?</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">It is a little know fact, that when a raccoon crosses your road,<br>you are granted over one hundred years of cheerfulness, health, handsomeness and good looks.</div>\n  </div>\n</div>",
  "print": "<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">I wanted to jump on my bicycle this evening as the sun was behind clouds,<br>but it didn't look like it was going to rain.</div>\n  <div class=\"paragraph\">I packed this and that, and put some fancy futuristic electrolyte mix in my water,<br>I squiЯted a bunch of fragrant bug repellent on myself, and boy did it work.</div>\n  <div class=\"paragraph\">And as I was just about to leave,<br>I discovered I had a flat tire.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">My goodness, entire books can be written on the art of fixing a bicycle flat,<br>it seems like an easy fix, but it is trouble.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">First of all, I was lucky this time that I was home,<br>my first flat tire happened many miles away and I had to walk, and jog back home.</div>\n  <div class=\"paragraph\">Half way through I had to drag the bicycle as the tire assembly came completely undone,<br>I actually tried to refill it at a gas station, just about all I had was some quarters for the air machine.</div>\n  <div class=\"paragraph\">I don't remember how that worked out,<br>It was a stressful moment, because of how far away from home I was.</div>\n  <div class=\"paragraph\">I eventually left the bicycle at a Highway Rest area,<br>and then jogged to get my car, got on the highway drove to the rest area and picked up my bicycle.</div>\n  <div class=\"paragraph\">This was an old bicycle from a garage sale,<br>and it had a huge problem with the pedals.</div>\n  <div class=\"paragraph\">Once I fixed the tire I went to a pricey repair shop for expensive bicycles,<br>and eventually caught on why the mechanic was acting slightly odd, and I asked:</div>\n  <div class=\"paragraph\">\"Is this a cheap bicycle\".</div>\n  <div class=\"paragraph\">Yes, he said with a deep tone,<br>and a kind of a detached relief that I caught on.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">I ended up with a neat mountain bike,<br>and when it started wearing out, I got a Fat Tire bike.</div>\n  <div class=\"paragraph\">I learned a lot, all these bikes are super cheap,<br>and the more things they have, the more things will get broken.</div>\n  <div class=\"paragraph\">My Mountain Bike had disc brakes,<br>but I had to adjust them a number of times, and never quite got it right.</div>\n  <div class=\"paragraph\">Then, I fell from my bicycle, and bent the aluminum frame,<br>and pretty badly too.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">The fat tire bike, has no extras,<br>it has no special brakes, by the handle bar.</div>\n  <div class=\"paragraph\">To stop it there is a break built into the internal pedal assembly,<br>it triggers when you move the pedals back.</div>\n  <div class=\"paragraph\">As little as there is to go wrong, things still go wrong,<br>I actually had to go back to the store and get a replacement bicycle because the brake failed.</div>\n  <div class=\"paragraph\">I added an extra bracket to the replacement bike,<br>to prevent the same failure.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Then a tire went out,<br>at I got a second Fat Tire bike, exact same thing, it was on sale for $135 dollars.</div>\n  <div class=\"paragraph\">I maybe trying to fix that tire tomorrow,<br>but I don't think it is going to work.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">The first bicycle wisdom, is,<br>have two cheap bicycles, this way you never have any down time, and no surprises, you can ride your good one and fix the broken one.</div>\n  <div class=\"paragraph\">All the tools and maintenance items that have ever touched your bicycle,<br>have to ride a long with you, and you have to check them for damage.</div>\n  <div class=\"paragraph\">I ran over a pointy stick in my second Fat Tire bike,<br>and my back tire exploded, the stick actually flew up in the air.</div>\n  <div class=\"paragraph\">The hole is still there, and the inner tube is unprotected in that spot,<br>it is slightly larger than a pencil.</div>\n  <div class=\"paragraph\">This happened about eight miles from my apartment,<br>and while I had all the tools, the glue on the stickers for my inner tube dried out, as did the little used tube of tire cement.</div>\n  <div class=\"paragraph\">My tire repair kit was too old,<br>I walked a mile or two to a gas station, and had my parents pick me up.</div>\n  <div class=\"paragraph\">The next day I used another bicycle, to get to my fat tire bike, repair its tire so that it would spin,<br>and then I slowly rode back on one bicycle, while holding the other.</div>\n  <div class=\"paragraph\">Somewhere in there, my phone fell on concrete, and just stopped working,<br>and I ended up getting a new phone number with my el cheapo replacement phone, yikes.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Another time, for the world in me, I was unable to locate where the puncture was,<br>and I tried like crazy, soap bubbles and everything.</div>\n  <div class=\"paragraph\">I actually had to go to the supermarket and get a little plastic kiddie pool,<br>then I filled it with water and soap, and only then found the microscopic puncture.</div>\n  <div class=\"paragraph\">The wisdom for this problem is, find the piece of metal that punctured your tire,<br>and then carefully examine the inner tube in the same spot.</div>\n  <div class=\"paragraph\">You will need to do some detective work,<br>it does not have to be a very big hole to deflate a tire overnight.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">I was lucky today, I found a very old roofing nail,<br>this thing could be from 1920's, you can see the structure of the metal, it looks like the top half of a nail.</div>\n  <div class=\"paragraph\">But even so, because I didn't notice the flat tire for a few of days,<br>the rubber structure got out of shape, and that is really bad news.</div>\n  <div class=\"paragraph\">Because, all tires, are ever so slightly larger than the metal rim they sit on,<br>this is on purpose, this gives you the much needed wiggle room to take the tire off of the rim.</div>\n  <div class=\"paragraph\">And you have to use a little plastic wedge, I had one of them snap on me today,<br>without that extra wiggle room, it may not be possible to take the tire off the rim.</div>\n  <div class=\"paragraph\">The part of the tire that touches the metal rim has metal wires in it,<br>there is no stretching there, you only get the wiggle room.</div>\n  <div class=\"paragraph\">I used my remaining two wedges to negotiate the tire off the rim, but only in the spot where the nail was,<br>that allowed me to grab the inner tube, and pull it out, and then I used some \"bubbles\" to verify that a tiny little black dot I spotted there, was the problem spot.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">You need multiple tire repair kits, just in case you break off that little wedge,<br>or end up buying a kit that is so old that all of the glue died out.</div>\n  <div class=\"paragraph\">They weigh nothing, they take up no space,<br>just get three different brands or styles.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">One time I noticed an abandoned bicycle, and then few minutes later a gentleman hurrying to Ford. Rd.,<br>I flat out asked him if he need a tire repair kit and held out one of my unused, unopened boxes, it was the good stuff too.</div>\n  <div class=\"paragraph\">He was like \"Dude?\", he had his phone with him, and my guess was that he called one of his friends to pick him up,<br>they were going to go to the store get a kit and he would go back to fix his bicycle.</div>\n  <div class=\"paragraph\">I turned an hour long problem,<br>into five minutes of nuisance, he already knew how to fix tires, he even had a no-nonsense air pump with him.</div>\n  <div class=\"paragraph\">Just the moment he took the kit, I took off,<br>but I learned from him to get a no-nonsense air pump.</div>\n  <div class=\"paragraph\">Using the little ones is crazy to me,<br>I got one for $11 buck or so, and it didn't seem to work at all, I am pretty sure the one I have is good motorcycles.</div>\n  <div class=\"paragraph\">I actually ended up buying Velcro straps to attach it to my handlebar,<br>it takes like 30 pumps to fill a tire, it is awesome.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">I scratched up the surface where the little hole was with sand paper,<br>I put a layer of glue on it, then I used a fresh square of rubber that also had some glue on it, and when that dried, I added extra glue around the edges.</div>\n  <div class=\"paragraph\">Always do a glue sandwich,<br>put the glue everywhere, the glue that is on the patch is not very good, you need glue that is hermetically closed in an aluminum tube.</div>\n  <div class=\"paragraph\">This is the difference between walking and riding,<br>serious business.</div>\n  <div class=\"paragraph\">When I ride my bicycle early spring,<br>there are metal wires, and nails everywhere, from construction, maybe snow plows pushing highway garbage onto the trail...</div>\n  <div class=\"paragraph\">and certainly from that steel wired inner part of truck tires,<br>once a tire falls to pieces, and patches of that rubber and steel start decaying after some years, it becomes like little needles.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Once I put in the inner tube, and inflated it, in those 30 pumps or so,<br>my bicycle tire came apart.</div>\n  <div class=\"paragraph\">Probably mostly because the tire was deformed,<br>from sitting flat for a few days until I noticed it.</div>\n  <div class=\"paragraph\">This deformation, will combine with that little wiggle room you have,<br>to make it so that your tire just comes apart.</div>\n  <div class=\"paragraph\">That wiggle room, when the tire is perfectly centered around the rim,<br>disappears completely.</div>\n  <div class=\"paragraph\">You have to inflate your tire just enough,<br>to start walking your bicycle in circles, and let things balance out.</div>\n  <div class=\"paragraph\">Let that deformation lose the hold over your tire,<br>let the tire distribute it self around the rim.</div>\n  <div class=\"paragraph\">Just do a few circles walking the bike,<br>and then resume inflating it.</div>\n  <div class=\"paragraph\">For myself, just to be sure,<br>I stopped a second time, and got on the bicycle and rolled forward an back, to get that wiggle room to distribute it self perfectly around the metal rim.</div>\n  <div class=\"paragraph\">It took a couple of tries, so be patient, rinse and repeat,<br>that wiggle room is not your enemy, it is there so that you can take the tire off the rim, and fix your flat.</div>\n  <div class=\"paragraph\">But as you are inflating the tire, roll the dough,<br>massage the tire into the center, so that the wiggle room is not in any spot, or your inner tube will push the tire apart in that spot.</div>\n  <div class=\"paragraph\">Do not inflate with wiggle room present,<br>or things will get frustrating.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">One time, when I still had my Mountain Bike,<br>I've noticed a boy pushing his bicycle really hard with the chain being stuck between gears and those spokes that hold the rim up.</div>\n  <div class=\"paragraph\">He said he wanted a movie, so he grabbed a bicycle, and this thing just fell apart, can I fix it,<br>I think I got it going, he was really shaken up, he was not having a good time.</div>\n  <div class=\"paragraph\">I don't think I just left him there pushing the damn thing forward,<br>I probably pulled out the chain, and put it back on the gear, but also would have warned him that this won't hold up.</div>\n  <div class=\"paragraph\">He said he went to a nearby repair shop and they wanted money,<br>for him using their tools.</div>\n  <div class=\"paragraph\">I was coming back from one of my longest adventures, I was tired,<br>but I am certain I put the chain back on, though at the time, I didn't know enough about bicycles to push his rear tire back and tighten the chain.</div>\n  <div class=\"paragraph\">I do remember however that, that after I did whatever I could, I went to the repair store,<br>and said that the boy is really shaken up, and that we need to help each other, and my voice broke, I closed the door an went on my way.</div>\n  <div class=\"paragraph\">I told several people about that heartlessness and laziness,<br>and told them to avoid that store, they are overprices and reek of predatory behavior.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">The big wisdom here, is to stop inflating the tire about 30% in,<br>and roll the dough, get that tire in the center of the rim.</div>\n  <div class=\"paragraph\">And before you take off with your patched tire,<br>triple check that you got all the tools back into your bicycle bags.</div>\n  <div class=\"paragraph\">Anything and everything that is used to service your bicycle,<br>has to be mounted on the bicycle.</div>\n  <div class=\"paragraph\">It was already 8:45 when I left, so it was going to be dark on my way back,<br>while I had my flashlight, I forgot my headlamp, not good.</div>\n  <div class=\"paragraph\">But I remembered bug spray, always remember bug spray,<br>4 miles in, about half way through my ride...</div>\n  <div class=\"paragraph\">My left pedal started feeling loose, the thing was going to fall off in 10 minutes flat,<br>and if I was unlucky I would lose the assembly that held it in place.</div>\n  <div class=\"paragraph\">It was getting dark, and the moment I stopped mosquitoes were all over my face,<br>there were so many of them, that I just ended up spraying them with bug repellent - and I did not get bit.</div>\n  <div class=\"paragraph\">I needed the correct tools, and one of those fun wrenches that makes a fancy sound,<br>and since the screw holding a pedal is inset in the pedal, I needed a socket thing.</div>\n  <div class=\"paragraph\">Because I keep all the tools on the bicycle,<br>I had everything with me, and the repair took two minuets.</div>\n  <div class=\"paragraph\">The socket thing was slightly too big, metric probably,<br>but with mosquitoes flying around my face I didn't have time to look for the correct thing.</div>\n  <div class=\"paragraph\">The wisdom here,<br>always have all the tools on the bicycle, everything that ever touched your bicycle, because you never know what will break next.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">In return for my preponderates,<br>quick repairs to my tire, and successful field repair of my pedal.</div>\n  <div class=\"paragraph\">I got to see a Gentlemanly Raccoon cross my road,<br>and when I said \"Hello, Mr. Fancy Raccoon, How Do?\"</div>\n  <div class=\"paragraph\">It actually paused for a split second,<br>and turned his ear towards me.</div>\n  <div class=\"paragraph\">As if wondering,<br>how in the heck does he know my name?</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">It is a little know fact, that when a raccoon crosses your road,<br>you are granted over one hundred years of cheerfulness, health, handsomeness and good looks.</div>\n</div>",
  "text": "I wanted to jump on my bicycle this evening as the sun was behind clouds,\nbut it didn't look like it was going to rain.\nI packed this and that, and put some fancy futuristic electrolyte mix in my water,\nI squiЯted a bunch of fragrant bug repellent on myself, and boy did it work.\nAnd as I was just about to leave,\nI discovered I had a flat tire.\n\nMy goodness, entire books can be written on the art of fixing a bicycle flat,\nit seems like an easy fix, but it is trouble.\n\nFirst of all, I was lucky this time that I was home,\nmy first flat tire happened many miles away and I had to walk, and jog back home.\nHalf way through I had to drag the bicycle as the tire assembly came completely undone,\nI actually tried to refill it at a gas station, just about all I had was some quarters for the air machine.\nI don't remember how that worked out,\nIt was a stressful moment, because of how far away from home I was.\nI eventually left the bicycle at a Highway Rest area,\nand then jogged to get my car, got on the highway drove to the rest area and picked up my bicycle.\nThis was an old bicycle from a garage sale,\nand it had a huge problem with the pedals.\nOnce I fixed the tire I went to a pricey repair shop for expensive bicycles,\nand eventually caught on why the mechanic was acting slightly odd, and I asked:\n\"Is this a cheap bicycle\".\nYes, he said with a deep tone,\nand a kind of a detached relief that I caught on.\n\nI ended up with a neat mountain bike,\nand when it started wearing out, I got a Fat Tire bike.\nI learned a lot, all these bikes are super cheap,\nand the more things they have, the more things will get broken.\nMy Mountain Bike had disc brakes,\nbut I had to adjust them a number of times, and never quite got it right.\nThen, I fell from my bicycle, and bent the aluminum frame,\nand pretty badly too.\n\nThe fat tire bike, has no extras,\nit has no special brakes, by the handle bar.\nTo stop it there is a break built into the internal pedal assembly,\nit triggers when you move the pedals back.\nAs little as there is to go wrong, things still go wrong,\nI actually had to go back to the store and get a replacement bicycle because the brake failed.\nI added an extra bracket to the replacement bike,\nto prevent the same failure.\n\nThen a tire went out,\nat I got a second Fat Tire bike, exact same thing, it was on sale for $135 dollars.\nI maybe trying to fix that tire tomorrow,\nbut I don't think it is going to work.\n\nThe first bicycle wisdom, is,\nhave two cheap bicycles, this way you never have any down time, and no surprises, you can ride your good one and fix the broken one.\nAll the tools and maintenance items that have ever touched your bicycle,\nhave to ride a long with you, and you have to check them for damage.\nI ran over a pointy stick in my second Fat Tire bike,\nand my back tire exploded, the stick actually flew up in the air.\nThe hole is still there, and the inner tube is unprotected in that spot,\nit is slightly larger than a pencil.\nThis happened about eight miles from my apartment,\nand while I had all the tools, the glue on the stickers for my inner tube dried out, as did the little used tube of tire cement.\nMy tire repair kit was too old,\nI walked a mile or two to a gas station, and had my parents pick me up.\nThe next day I used another bicycle, to get to my fat tire bike, repair its tire so that it would spin,\nand then I slowly rode back on one bicycle, while holding the other.\nSomewhere in there, my phone fell on concrete, and just stopped working,\nand I ended up getting a new phone number with my el cheapo replacement phone, yikes.\n\nAnother time, for the world in me, I was unable to locate where the puncture was,\nand I tried like crazy, soap bubbles and everything.\nI actually had to go to the supermarket and get a little plastic kiddie pool,\nthen I filled it with water and soap, and only then found the microscopic puncture.\nThe wisdom for this problem is, find the piece of metal that punctured your tire,\nand then carefully examine the inner tube in the same spot.\nYou will need to do some detective work,\nit does not have to be a very big hole to deflate a tire overnight.\n\nI was lucky today, I found a very old roofing nail,\nthis thing could be from 1920's, you can see the structure of the metal, it looks like the top half of a nail.\nBut even so, because I didn't notice the flat tire for a few of days,\nthe rubber structure got out of shape, and that is really bad news.\nBecause, all tires, are ever so slightly larger than the metal rim they sit on,\nthis is on purpose, this gives you the much needed wiggle room to take the tire off of the rim.\nAnd you have to use a little plastic wedge, I had one of them snap on me today,\nwithout that extra wiggle room, it may not be possible to take the tire off the rim.\nThe part of the tire that touches the metal rim has metal wires in it,\nthere is no stretching there, you only get the wiggle room.\nI used my remaining two wedges to negotiate the tire off the rim, but only in the spot where the nail was,\nthat allowed me to grab the inner tube, and pull it out, and then I used some \"bubbles\" to verify that a tiny little black dot I spotted there, was the problem spot.\n\nYou need multiple tire repair kits, just in case you break off that little wedge,\nor end up buying a kit that is so old that all of the glue died out.\nThey weigh nothing, they take up no space,\njust get three different brands or styles.\n\nOne time I noticed an abandoned bicycle, and then few minutes later a gentleman hurrying to Ford. Rd.,\nI flat out asked him if he need a tire repair kit and held out one of my unused, unopened boxes, it was the good stuff too.\nHe was like \"Dude?\", he had his phone with him, and my guess was that he called one of his friends to pick him up,\nthey were going to go to the store get a kit and he would go back to fix his bicycle.\nI turned an hour long problem,\ninto five minutes of nuisance, he already knew how to fix tires, he even had a no-nonsense air pump with him.\nJust the moment he took the kit, I took off,\nbut I learned from him to get a no-nonsense air pump.\nUsing the little ones is crazy to me,\nI got one for $11 buck or so, and it didn't seem to work at all, I am pretty sure the one I have is good motorcycles.\nI actually ended up buying Velcro straps to attach it to my handlebar,\nit takes like 30 pumps to fill a tire, it is awesome.\n\nI scratched up the surface where the little hole was with sand paper,\nI put a layer of glue on it, then I used a fresh square of rubber that also had some glue on it, and when that dried, I added extra glue around the edges.\nAlways do a glue sandwich,\nput the glue everywhere, the glue that is on the patch is not very good, you need glue that is hermetically closed in an aluminum tube.\nThis is the difference between walking and riding,\nserious business.\nWhen I ride my bicycle early spring,\nthere are metal wires, and nails everywhere, from construction, maybe snow plows pushing highway garbage onto the trail...\nand certainly from that steel wired inner part of truck tires,\nonce a tire falls to pieces, and patches of that rubber and steel start decaying after some years, it becomes like little needles.\n\nOnce I put in the inner tube, and inflated it, in those 30 pumps or so,\nmy bicycle tire came apart.\nProbably mostly because the tire was deformed,\nfrom sitting flat for a few days until I noticed it.\nThis deformation, will combine with that little wiggle room you have,\nto make it so that your tire just comes apart.\nThat wiggle room, when the tire is perfectly centered around the rim,\ndisappears completely.\nYou have to inflate your tire just enough,\nto start walking your bicycle in circles, and let things balance out.\nLet that deformation lose the hold over your tire,\nlet the tire distribute it self around the rim.\nJust do a few circles walking the bike,\nand then resume inflating it.\nFor myself, just to be sure,\nI stopped a second time, and got on the bicycle and rolled forward an back, to get that wiggle room to distribute it self perfectly around the metal rim.\nIt took a couple of tries, so be patient, rinse and repeat,\nthat wiggle room is not your enemy, it is there so that you can take the tire off the rim, and fix your flat.\nBut as you are inflating the tire, roll the dough,\nmassage the tire into the center, so that the wiggle room is not in any spot, or your inner tube will push the tire apart in that spot.\nDo not inflate with wiggle room present,\nor things will get frustrating.\n\nOne time, when I still had my Mountain Bike,\nI've noticed a boy pushing his bicycle really hard with the chain being stuck between gears and those spokes that hold the rim up.\nHe said he wanted a movie, so he grabbed a bicycle, and this thing just fell apart, can I fix it,\nI think I got it going, he was really shaken up, he was not having a good time.\nI don't think I just left him there pushing the damn thing forward,\nI probably pulled out the chain, and put it back on the gear, but also would have warned him that this won't hold up.\nHe said he went to a nearby repair shop and they wanted money,\nfor him using their tools.\nI was coming back from one of my longest adventures, I was tired,\nbut I am certain I put the chain back on, though at the time, I didn't know enough about bicycles to push his rear tire back and tighten the chain.\nI do remember however that, that after I did whatever I could, I went to the repair store,\nand said that the boy is really shaken up, and that we need to help each other, and my voice broke, I closed the door an went on my way.\nI told several people about that heartlessness and laziness,\nand told them to avoid that store, they are overprices and reek of predatory behavior.\n\nThe big wisdom here, is to stop inflating the tire about 30% in,\nand roll the dough, get that tire in the center of the rim.\nAnd before you take off with your patched tire,\ntriple check that you got all the tools back into your bicycle bags.\nAnything and everything that is used to service your bicycle,\nhas to be mounted on the bicycle.\nIt was already 8:45 when I left, so it was going to be dark on my way back,\nwhile I had my flashlight, I forgot my headlamp, not good.\nBut I remembered bug spray, always remember bug spray,\n4 miles in, about half way through my ride...\nMy left pedal started feeling loose, the thing was going to fall off in 10 minutes flat,\nand if I was unlucky I would lose the assembly that held it in place.\nIt was getting dark, and the moment I stopped mosquitoes were all over my face,\nthere were so many of them, that I just ended up spraying them with bug repellent - and I did not get bit.\nI needed the correct tools, and one of those fun wrenches that makes a fancy sound,\nand since the screw holding a pedal is inset in the pedal, I needed a socket thing.\nBecause I keep all the tools on the bicycle,\nI had everything with me, and the repair took two minuets.\nThe socket thing was slightly too big, metric probably,\nbut with mosquitoes flying around my face I didn't have time to look for the correct thing.\nThe wisdom here,\nalways have all the tools on the bicycle, everything that ever touched your bicycle, because you never know what will break next.\n\nIn return for my preponderates,\nquick repairs to my tire, and successful field repair of my pedal.\nI got to see a Gentlemanly Raccoon cross my road,\nand when I said \"Hello, Mr. Fancy Raccoon, How Do?\"\nIt actually paused for a split second,\nand turned his ear towards me.\nAs if wondering,\nhow in the heck does he know my name?\n\nIt is a little know fact, that when a raccoon crosses your road,\nyou are granted over one hundred years of cheerfulness, health, handsomeness and good looks.",
  "images": [],
  "links": []
}