{
  "name": "furkies-purrkies-poetry-0537",
  "id": "furkies-purrkies-poetry-0537",
  "title": "Transforming Fake Education Into Real Education",
  "date": "2021-08-19T21:38:18.625Z",
  "image": "poetry-0537-illustration.jpg",
  "artwork": "https://unsplash.com/photos/IXTvnOOSTyU",
  "audio": "poetry-0537.mp3",
  "html": "<div class=\"section\">\n  <p>School is broken, ineffective, or fake,<br>and provides no real results.</p>\n  <p>And certainly,<br>no results that are reliably reproducible.</p>\n  <p>I propose,<br>introducing several new classes.</p>\n  <p>These classes will create a starting point,<br>from which the new schools can emerge.</p>\n  <p>These classes already have a new format,<br>and they do not feature grades, just real and life changing information.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>The most difficult subject, is that of healthy relationships,<br>as there has been a ongoing problem that colleges and universities try to hide.</p>\n  <p>The primary focus right now, is to undue the seemingly self propagating myths,<br>about what it means to become a man.</p>\n  <p>Because what boys currently think it is,<br>is not that far off from participating in deliberate emotional exploitation and general predation.</p>\n  <p>Taking advantage of the emotionally hurt,<br>or those who don't yet have the necessary culture or knowledge to make the correct choices is more likely to prevent a boy from ever becoming a man.</p>\n  <p>Here I would like to note that, <a href=\"https://www.youtube.com/watch?v=Chrd0GjBq9o\">a college town should not present drugs and alcohol as one of the things to do</a>,<br>because only a monster would do that to a young person, especially a young person under the stress of fake education and very real debt and poverty.</p>\n  <p>I propose the name of this class is <strong>Love</strong>,<br>and the starting point for the most tragic subject, can be found in one of Jon Krakauer's books Missoula.<br>(I will not read this book, but I trust Mr. Krakauer based on his other works)</p>\n  <p>This is a very important subject, and as deeply sad and tragic it is,<br>It must stand as the first and foremost topic that comes up when speaking about making improvement to world's education systems.</p>\n  <p>The children need to understand that what makes a Human Being mature is not even age,<br>it does not matter if someone is 50, if they didn't grow in Knowledge and Wisdom then they are sill a child in their mind.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>The second new Class I propose is called <strong>Poverty And Money</strong>,<br>it's primary purpose it to state in no uncertain terms that:</p>\n  <p>Humanity has blindly created an artificial problem,<br>that causes great harm to our family, to our minds, to our bodies, and to our education.</p>\n  <p>Without anybody interning to do so,<br>we have begun advancing humanity by using money and inducing poverty.</p>\n  <p>This unintended consequence,<br>is a major cause behind crime, I leave it to the reader to conduct the research or locate the necessary citations - if any.</p>\n  <p>We have been taught, that if money was free,<br>there would be inflation and the nations would collapse.</p>\n  <p>I suspect this is correct,<br>but the collapse of nations is a much smaller problem than world poverty, that harms everyone.</p>\n  <p>Children need to understand that this is an artificial problem,<br>and they need to come up with a solution.</p>\n  <p>The starting point I propose here,<br>is a world bank that does not track debt of the people that use it.</p>\n  <p>To prevent whatever collapse putting food on the table and repairing the world will cause,<br>the card may come with a dignified daily spending limit, the discussion of what that limit should be should start at $100 per day.</p>\n  <p>There will be businesses that will attempt to exploit this,<br>but if they tamper with prices, they will be temporary banned from processing those payments.</p>\n  <p>One important point to notice here is that,<br>having a $100 per day, will put money into local businesses.</p>\n  <p>It will not shut them down,<br>nor will the the upper daily limit, cause any run away inflation.</p>\n  <p>The class should also note that it was previously impossible to create a bank like this,<br>for three reasons.</p>\n  <p>Credit cards and computer networks are a new invention, until the invention of cards there was no way to set a spending limit,<br>and until computers started running this show, it was impossible to effectively detect and ban businesses tampering with prices and related fraud.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>The third class on my list is called Fake Education,<br>it is a class that discusses the differences between fake or ineffective education and a real education.</p>\n  <p>One strong point that must be touched upon here,<br>is whether or not the teachers have what they need to teach for real...</p>\n  <p>And if so,<br><a href=\"https://www.youtube.com/watch?v=sxyKNMrhEvY\">why is it that they have been blindly participating in a fundamentally broken system</a>.</p>\n  <p>Being able to identify fake education is critical,<br>to getting a real one, and this is the class that helps the student ask the right question and spot the fake.</p>\n  <p>One of the questions that maybe asked,<br>is the importance of staying current with Narrated Version of the Great Books written by contemporary honorable intellectuals, that clearly display a love and concern for humanity.</p>\n  <p>And a related question,<br>of relative importance of overpriced textbooks.</p>\n  <p>The children taking these classes,<br>are soon going to become the new intellectuals that create such inspirational and beloved works - why are they denied access to these books.</p>\n  <p>And why are they forced to low quality disconnected fact textbooks,<br>that are mostly used in rote memorization, if even that.</p>\n  <p>Children must be taught to identify when they are being taken advantage of by means of grades,<br>grades that belong to a system of threats, threat of punishment, threat of being seen as stupid, threat of being held back, threat of being laughed at, threat of being alone.</p>\n  <p>In 2017, 6,241 US Students ended their life,<br>please understand, that school is meant to be the happiest place in our early memories - what we have today is a disgrace.</p>\n  <p>It is a system of abuse, or shame, and a system of destruction of delicate minds,<br>minds that are each capable of Greatness, that do operate on genius level, but also minds that will cease to grow if they connect their intelligence with the meaningless GPA.</p>\n  <p>Many students see their grade, especially the low GPA,<br>as a measure of their intelligence.</p>\n  <p>Bad grades only come from not memorizing disconnected facts,<br>there is nothing lo learn for real in today's schools as everything is divided up into meaninglessness.</p>\n  <p>A child learns by making small steps in the general direction of whatever their next noble pursuit is,<br>only a sick and truly uneducated person could assume that a child learns by hopping from subject to subject five or ten times a day.</p>\n  <p>Classes must not be disconnect, they must be self directed, self paced,<br>and a child's education must be a road marked by meaningful milestones and achievements that they are proud of, not just during education but for decades after their graduation.</p>\n  <p>Examples of such achievements are learning the language of mathematics by having learned programming first and taking to create breathtaking generative art shown in galleries across the world,<br>or learning 3D modeling for the purpose of creating and more importantly selling real and unique, and beautiful products.</p>\n  <p>Until we have a better way to identify ineffective education,<br>I propose that moneymaking is used as a measure of results and effectiveness of their education.</p>\n  <p>For those of you marking the medical school argument here,<br>understand that 250,000 possibly 440,000 people in the U.S. die every year from medical errors.</p>\n  <p>The issue of charging for college education must be touched upon here as well,<br>college is not different from high school, it is just as bad.</p>\n  <p>Stealing the saving of the families that think their child is getting a real education,<br>and putting the student in debt, for years to come - is nothing short evil.</p>\n  <p>And this notion ob balanced education, must become a symbol of what it really stands for: FRAUD,<br>because an education that is anything other than integrated is simply a fake education.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>There is a related, somewhat more external subject here,<br>and that is the subject of fake and ineffective politics.</p>\n  <p>It is a waste of time to write about it at any length,<br>but I think the starting point here should be the study of crimes committed by politicians.</p>\n  <p>Here I would point to the <a href=\"https://en.wikipedia.org/wiki/List_of_American_state_and_local_politicians_convicted_of_crimes\">List of American state and local politicians convicted of crimes</a>,<br>and note that the \"See also\" section should be a starting point for more on the subject.</p>\n  <p>Money, Corruption, and Insider Trading, as well as all the other mistakes in all politics,<br>is a subject that must be discussed middle school on.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Which reads me to a related subject, Indoctrination,<br>and here I have to beg a pardon, and ask all the religions people to skip this section.</p>\n  <p>There is an extremely important lesson that every child must fully comprehend,<br>and that is the scale on which fantasy institutions thrive.</p>\n  <p>If there is a large institution, that falls within the range of size of a global church,<br>then the church should be all the proof necessary to question it.</p>\n  <p>If a fantasy reality is to be propagated,<br>then everything else can be rationally and fundamentally questioned, by the generation hat IS ABOUT TO INHERIT IT.</p>\n  <p>We must stop propagating mistakes,<br>wold poverty, war, suffering, struggling, science denial, ignorance of climate, stockpiling nuclear weapons, and keeping <a href=\"https://www.youtube.com/watch?v=L7EmLf4Xlq0\">3,750 active nuclear warheads ready to destroy all major cities</a>, MUST STOP WITH US.</p>\n  <p>This is not a problem for children to inherit,<br>if anything this is a reason, why they shouldn't hear a word we have to say.</p>\n  <p>Furthermore, Richard Dawkins states that religious people,<br>that are bound to a particular religion, are atheists towards all the other religions, and asks that they take that extra step.</p>\n  <p>Children are susceptible to indoctrination, this must not be exploited as children should become better than the previous generation, or there will never be an end to suffering,<br>Dawkins correctly identifies pushing a child into a particular religion, as a form of abuse.</p>\n  <p>The children are the future of the world,<br>they don't need the crunches of the previous generations, they just need a global end to Poverty, and Knowledge, Wisdom and Greatness.</p>\n  <p>For those of you who use religion to deal with suffering,<br>even if it is just loneliness, I encourage you to bring in all the other books, especially their narrated versions into your place of worship.</p>\n  <p>The way out of suffering, the way towards meaning,<br>is found in Knowledge, Wisdom and Greatness.</p>\n  <p>Do not disgrace the memories of people who were murdered or tortured by the hands of your organization of choice,<br>to do them justice and correct history's mistakes, your places of worship should become Great Libraries of Wisdom.</p>\n  <p>Suffering, is best prevented,<br>or risen from - not lived in.</p>\n  <p>I worry that that the elderly are being taken advantage of,<br>that the world has abandoned them - most don't need fantasy, they need a job that is respectful of their skills, and a happy outlook.</p>\n  <p>It seems to me that all the churches are doing for the elderly, is take whatever little money they have left a dollar at a time,<br>it is time to transform your organizations and help the elderly to long and happy futures.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>The final subject I mention in this text,<br>is Climate and Animals.</p>\n  <p>World poverty has blinded us,<br>there isn't a single person on planet earth that would wish famine and pandemics on the future generations.</p>\n  <p>But in poverty,<br>the energy withing us that cares about all the future generations, that projects our love thousands of years into the future - has been drained, and we can no longer see that far.</p>\n  <p><a href=\"https://www.ipcc.ch/report/ar6/wg1/\">Not only have we added to destabilized the climate</a>,<br>we have done nothing to take care of it for future generations - we will not be forgiven for this, the scientists are warning of untold suffering.</p>\n  <p><a href=\"https://www.iucnredlist.org/species/15955/50659951\">There maybe as few as 2,154 tigers left</a>, no generation wants to lose a species or large animal,<br>looks like our generation has destroyed the tigers.</p>\n  <p>We did this,<br>with out fake education, our busy live, arrogance & ignorance, and all this hard work under a state of made up, bullshit problem, that could have been avoided, the problem of world poverty draining us of wisdom.</p>\n  <p>Become a teacher, make your voice heard around the world and well into the future, make a difference, begin now,<br>the children and the future generations need a real education so that they may grow in Knowledge, Wisdom, and onward to Greatness.</p>\n</div>",
  "bootstrap": "<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">School is broken, ineffective, or fake,<br>and provides no real results.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">And certainly,<br>no results that are reliably reproducible.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I propose,<br>introducing several new classes.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">These classes will create a starting point,<br>from which the new schools can emerge.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">These classes already have a new format,<br>and they do not feature grades, just real and life changing information.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The most difficult subject, is that of healthy relationships,<br>as there has been a ongoing problem that colleges and universities try to hide.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The primary focus right now, is to undue the seemingly self propagating myths,<br>about what it means to become a man.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Because what boys currently think it is,<br>is not that far off from participating in deliberate emotional exploitation and general predation.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Taking advantage of the emotionally hurt,<br>or those who don't yet have the necessary culture or knowledge to make the correct choices is more likely to prevent a boy from ever becoming a man.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Here I would like to note that, <a href=\"https://www.youtube.com/watch?v=Chrd0GjBq9o\">a college town should not present drugs and alcohol as one of the things to do</a>,<br>because only a monster would do that to a young person, especially a young person under the stress of fake education and very real debt and poverty.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I propose the name of this class is <strong>Love</strong>,<br>and the starting point for the most tragic subject, can be found in one of Jon Krakauer's books Missoula.<br>(I will not read this book, but I trust Mr. Krakauer based on his other works)</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">This is a very important subject, and as deeply sad and tragic it is,<br>It must stand as the first and foremost topic that comes up when speaking about making improvement to world's education systems.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The children need to understand that what makes a Human Being mature is not even age,<br>it does not matter if someone is 50, if they didn't grow in Knowledge and Wisdom then they are sill a child in their mind.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The second new Class I propose is called <strong>Poverty And Money</strong>,<br>it's primary purpose it to state in no uncertain terms that:</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Humanity has blindly created an artificial problem,<br>that causes great harm to our family, to our minds, to our bodies, and to our education.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Without anybody interning to do so,<br>we have begun advancing humanity by using money and inducing poverty.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">This unintended consequence,<br>is a major cause behind crime, I leave it to the reader to conduct the research or locate the necessary citations - if any.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">We have been taught, that if money was free,<br>there would be inflation and the nations would collapse.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I suspect this is correct,<br>but the collapse of nations is a much smaller problem than world poverty, that harms everyone.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Children need to understand that this is an artificial problem,<br>and they need to come up with a solution.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The starting point I propose here,<br>is a world bank that does not track debt of the people that use it.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">To prevent whatever collapse putting food on the table and repairing the world will cause,<br>the card may come with a dignified daily spending limit, the discussion of what that limit should be should start at $100 per day.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">There will be businesses that will attempt to exploit this,<br>but if they tamper with prices, they will be temporary banned from processing those payments.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">One important point to notice here is that,<br>having a $100 per day, will put money into local businesses.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">It will not shut them down,<br>nor will the the upper daily limit, cause any run away inflation.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The class should also note that it was previously impossible to create a bank like this,<br>for three reasons.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Credit cards and computer networks are a new invention, until the invention of cards there was no way to set a spending limit,<br>and until computers started running this show, it was impossible to effectively detect and ban businesses tampering with prices and related fraud.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The third class on my list is called Fake Education,<br>it is a class that discusses the differences between fake or ineffective education and a real education.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">One strong point that must be touched upon here,<br>is whether or not the teachers have what they need to teach for real...</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">And if so,<br><a href=\"https://www.youtube.com/watch?v=sxyKNMrhEvY\">why is it that they have been blindly participating in a fundamentally broken system</a>.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Being able to identify fake education is critical,<br>to getting a real one, and this is the class that helps the student ask the right question and spot the fake.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">One of the questions that maybe asked,<br>is the importance of staying current with Narrated Version of the Great Books written by contemporary honorable intellectuals, that clearly display a love and concern for humanity.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">And a related question,<br>of relative importance of overpriced textbooks.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The children taking these classes,<br>are soon going to become the new intellectuals that create such inspirational and beloved works - why are they denied access to these books.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">And why are they forced to low quality disconnected fact textbooks,<br>that are mostly used in rote memorization, if even that.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Children must be taught to identify when they are being taken advantage of by means of grades,<br>grades that belong to a system of threats, threat of punishment, threat of being seen as stupid, threat of being held back, threat of being laughed at, threat of being alone.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">In 2017, 6,241 US Students ended their life,<br>please understand, that school is meant to be the happiest place in our early memories - what we have today is a disgrace.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">It is a system of abuse, or shame, and a system of destruction of delicate minds,<br>minds that are each capable of Greatness, that do operate on genius level, but also minds that will cease to grow if they connect their intelligence with the meaningless GPA.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Many students see their grade, especially the low GPA,<br>as a measure of their intelligence.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Bad grades only come from not memorizing disconnected facts,<br>there is nothing lo learn for real in today's schools as everything is divided up into meaninglessness.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">A child learns by making small steps in the general direction of whatever their next noble pursuit is,<br>only a sick and truly uneducated person could assume that a child learns by hopping from subject to subject five or ten times a day.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Classes must not be disconnect, they must be self directed, self paced,<br>and a child's education must be a road marked by meaningful milestones and achievements that they are proud of, not just during education but for decades after their graduation.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Examples of such achievements are learning the language of mathematics by having learned programming first and taking to create breathtaking generative art shown in galleries across the world,<br>or learning 3D modeling for the purpose of creating and more importantly selling real and unique, and beautiful products.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Until we have a better way to identify ineffective education,<br>I propose that moneymaking is used as a measure of results and effectiveness of their education.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">For those of you marking the medical school argument here,<br>understand that 250,000 possibly 440,000 people in the U.S. die every year from medical errors.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The issue of charging for college education must be touched upon here as well,<br>college is not different from high school, it is just as bad.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Stealing the saving of the families that think their child is getting a real education,<br>and putting the student in debt, for years to come - is nothing short evil.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">And this notion ob balanced education, must become a symbol of what it really stands for: FRAUD,<br>because an education that is anything other than integrated is simply a fake education.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">There is a related, somewhat more external subject here,<br>and that is the subject of fake and ineffective politics.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">It is a waste of time to write about it at any length,<br>but I think the starting point here should be the study of crimes committed by politicians.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Here I would point to the <a href=\"https://en.wikipedia.org/wiki/List_of_American_state_and_local_politicians_convicted_of_crimes\">List of American state and local politicians convicted of crimes</a>,<br>and note that the \"See also\" section should be a starting point for more on the subject.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Money, Corruption, and Insider Trading, as well as all the other mistakes in all politics,<br>is a subject that must be discussed middle school on.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Which reads me to a related subject, Indoctrination,<br>and here I have to beg a pardon, and ask all the religions people to skip this section.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">There is an extremely important lesson that every child must fully comprehend,<br>and that is the scale on which fantasy institutions thrive.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">If there is a large institution, that falls within the range of size of a global church,<br>then the church should be all the proof necessary to question it.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">If a fantasy reality is to be propagated,<br>then everything else can be rationally and fundamentally questioned, by the generation hat IS ABOUT TO INHERIT IT.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">We must stop propagating mistakes,<br>wold poverty, war, suffering, struggling, science denial, ignorance of climate, stockpiling nuclear weapons, and keeping <a href=\"https://www.youtube.com/watch?v=L7EmLf4Xlq0\">3,750 active nuclear warheads ready to destroy all major cities</a>, MUST STOP WITH US.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">This is not a problem for children to inherit,<br>if anything this is a reason, why they shouldn't hear a word we have to say.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Furthermore, Richard Dawkins states that religious people,<br>that are bound to a particular religion, are atheists towards all the other religions, and asks that they take that extra step.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Children are susceptible to indoctrination, this must not be exploited as children should become better than the previous generation, or there will never be an end to suffering,<br>Dawkins correctly identifies pushing a child into a particular religion, as a form of abuse.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The children are the future of the world,<br>they don't need the crunches of the previous generations, they just need a global end to Poverty, and Knowledge, Wisdom and Greatness.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">For those of you who use religion to deal with suffering,<br>even if it is just loneliness, I encourage you to bring in all the other books, especially their narrated versions into your place of worship.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The way out of suffering, the way towards meaning,<br>is found in Knowledge, Wisdom and Greatness.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Do not disgrace the memories of people who were murdered or tortured by the hands of your organization of choice,<br>to do them justice and correct history's mistakes, your places of worship should become Great Libraries of Wisdom.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Suffering, is best prevented,<br>or risen from - not lived in.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I worry that that the elderly are being taken advantage of,<br>that the world has abandoned them - most don't need fantasy, they need a job that is respectful of their skills, and a happy outlook.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">It seems to me that all the churches are doing for the elderly, is take whatever little money they have left a dollar at a time,<br>it is time to transform your organizations and help the elderly to long and happy futures.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The final subject I mention in this text,<br>is Climate and Animals.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">World poverty has blinded us,<br>there isn't a single person on planet earth that would wish famine and pandemics on the future generations.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">But in poverty,<br>the energy withing us that cares about all the future generations, that projects our love thousands of years into the future - has been drained, and we can no longer see that far.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\"><a href=\"https://www.ipcc.ch/report/ar6/wg1/\">Not only have we added to destabilized the climate</a>,<br>we have done nothing to take care of it for future generations - we will not be forgiven for this, the scientists are warning of untold suffering.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\"><a href=\"https://www.iucnredlist.org/species/15955/50659951\">There maybe as few as 2,154 tigers left</a>, no generation wants to lose a species or large animal,<br>looks like our generation has destroyed the tigers.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">We did this,<br>with out fake education, our busy live, arrogance & ignorance, and all this hard work under a state of made up, bullshit problem, that could have been avoided, the problem of world poverty draining us of wisdom.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Become a teacher, make your voice heard around the world and well into the future, make a difference, begin now,<br>the children and the future generations need a real education so that they may grow in Knowledge, Wisdom, and onward to Greatness.</div>\n  </div>\n</div>",
  "print": "<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">School is broken, ineffective, or fake,<br>and provides no real results.</div>\n  <div class=\"paragraph\">And certainly,<br>no results that are reliably reproducible.</div>\n  <div class=\"paragraph\">I propose,<br>introducing several new classes.</div>\n  <div class=\"paragraph\">These classes will create a starting point,<br>from which the new schools can emerge.</div>\n  <div class=\"paragraph\">These classes already have a new format,<br>and they do not feature grades, just real and life changing information.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">The most difficult subject, is that of healthy relationships,<br>as there has been a ongoing problem that colleges and universities try to hide.</div>\n  <div class=\"paragraph\">The primary focus right now, is to undue the seemingly self propagating myths,<br>about what it means to become a man.</div>\n  <div class=\"paragraph\">Because what boys currently think it is,<br>is not that far off from participating in deliberate emotional exploitation and general predation.</div>\n  <div class=\"paragraph\">Taking advantage of the emotionally hurt,<br>or those who don't yet have the necessary culture or knowledge to make the correct choices is more likely to prevent a boy from ever becoming a man.</div>\n  <div class=\"paragraph\">Here I would like to note that, <span>a college town should not present drugs and alcohol as one of the things to do<sup>[1]</sup></span>,<br>because only a monster would do that to a young person, especially a young person under the stress of fake education and very real debt and poverty.</div>\n  <div class=\"paragraph\">I propose the name of this class is <strong>Love</strong>,<br>and the starting point for the most tragic subject, can be found in one of Jon Krakauer's books Missoula.<br>(I will not read this book, but I trust Mr. Krakauer based on his other works)</div>\n  <div class=\"paragraph\">This is a very important subject, and as deeply sad and tragic it is,<br>It must stand as the first and foremost topic that comes up when speaking about making improvement to world's education systems.</div>\n  <div class=\"paragraph\">The children need to understand that what makes a Human Being mature is not even age,<br>it does not matter if someone is 50, if they didn't grow in Knowledge and Wisdom then they are sill a child in their mind.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">The second new Class I propose is called <strong>Poverty And Money</strong>,<br>it's primary purpose it to state in no uncertain terms that:</div>\n  <div class=\"paragraph\">Humanity has blindly created an artificial problem,<br>that causes great harm to our family, to our minds, to our bodies, and to our education.</div>\n  <div class=\"paragraph\">Without anybody interning to do so,<br>we have begun advancing humanity by using money and inducing poverty.</div>\n  <div class=\"paragraph\">This unintended consequence,<br>is a major cause behind crime, I leave it to the reader to conduct the research or locate the necessary citations - if any.</div>\n  <div class=\"paragraph\">We have been taught, that if money was free,<br>there would be inflation and the nations would collapse.</div>\n  <div class=\"paragraph\">I suspect this is correct,<br>but the collapse of nations is a much smaller problem than world poverty, that harms everyone.</div>\n  <div class=\"paragraph\">Children need to understand that this is an artificial problem,<br>and they need to come up with a solution.</div>\n  <div class=\"paragraph\">The starting point I propose here,<br>is a world bank that does not track debt of the people that use it.</div>\n  <div class=\"paragraph\">To prevent whatever collapse putting food on the table and repairing the world will cause,<br>the card may come with a dignified daily spending limit, the discussion of what that limit should be should start at $100 per day.</div>\n  <div class=\"paragraph\">There will be businesses that will attempt to exploit this,<br>but if they tamper with prices, they will be temporary banned from processing those payments.</div>\n  <div class=\"paragraph\">One important point to notice here is that,<br>having a $100 per day, will put money into local businesses.</div>\n  <div class=\"paragraph\">It will not shut them down,<br>nor will the the upper daily limit, cause any run away inflation.</div>\n  <div class=\"paragraph\">The class should also note that it was previously impossible to create a bank like this,<br>for three reasons.</div>\n  <div class=\"paragraph\">Credit cards and computer networks are a new invention, until the invention of cards there was no way to set a spending limit,<br>and until computers started running this show, it was impossible to effectively detect and ban businesses tampering with prices and related fraud.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">The third class on my list is called Fake Education,<br>it is a class that discusses the differences between fake or ineffective education and a real education.</div>\n  <div class=\"paragraph\">One strong point that must be touched upon here,<br>is whether or not the teachers have what they need to teach for real...</div>\n  <div class=\"paragraph\">And if so,<br><span>why is it that they have been blindly participating in a fundamentally broken system<sup>[2]</sup></span>.</div>\n  <div class=\"paragraph\">Being able to identify fake education is critical,<br>to getting a real one, and this is the class that helps the student ask the right question and spot the fake.</div>\n  <div class=\"paragraph\">One of the questions that maybe asked,<br>is the importance of staying current with Narrated Version of the Great Books written by contemporary honorable intellectuals, that clearly display a love and concern for humanity.</div>\n  <div class=\"paragraph\">And a related question,<br>of relative importance of overpriced textbooks.</div>\n  <div class=\"paragraph\">The children taking these classes,<br>are soon going to become the new intellectuals that create such inspirational and beloved works - why are they denied access to these books.</div>\n  <div class=\"paragraph\">And why are they forced to low quality disconnected fact textbooks,<br>that are mostly used in rote memorization, if even that.</div>\n  <div class=\"paragraph\">Children must be taught to identify when they are being taken advantage of by means of grades,<br>grades that belong to a system of threats, threat of punishment, threat of being seen as stupid, threat of being held back, threat of being laughed at, threat of being alone.</div>\n  <div class=\"paragraph\">In 2017, 6,241 US Students ended their life,<br>please understand, that school is meant to be the happiest place in our early memories - what we have today is a disgrace.</div>\n  <div class=\"paragraph\">It is a system of abuse, or shame, and a system of destruction of delicate minds,<br>minds that are each capable of Greatness, that do operate on genius level, but also minds that will cease to grow if they connect their intelligence with the meaningless GPA.</div>\n  <div class=\"paragraph\">Many students see their grade, especially the low GPA,<br>as a measure of their intelligence.</div>\n  <div class=\"paragraph\">Bad grades only come from not memorizing disconnected facts,<br>there is nothing lo learn for real in today's schools as everything is divided up into meaninglessness.</div>\n  <div class=\"paragraph\">A child learns by making small steps in the general direction of whatever their next noble pursuit is,<br>only a sick and truly uneducated person could assume that a child learns by hopping from subject to subject five or ten times a day.</div>\n  <div class=\"paragraph\">Classes must not be disconnect, they must be self directed, self paced,<br>and a child's education must be a road marked by meaningful milestones and achievements that they are proud of, not just during education but for decades after their graduation.</div>\n  <div class=\"paragraph\">Examples of such achievements are learning the language of mathematics by having learned programming first and taking to create breathtaking generative art shown in galleries across the world,<br>or learning 3D modeling for the purpose of creating and more importantly selling real and unique, and beautiful products.</div>\n  <div class=\"paragraph\">Until we have a better way to identify ineffective education,<br>I propose that moneymaking is used as a measure of results and effectiveness of their education.</div>\n  <div class=\"paragraph\">For those of you marking the medical school argument here,<br>understand that 250,000 possibly 440,000 people in the U.S. die every year from medical errors.</div>\n  <div class=\"paragraph\">The issue of charging for college education must be touched upon here as well,<br>college is not different from high school, it is just as bad.</div>\n  <div class=\"paragraph\">Stealing the saving of the families that think their child is getting a real education,<br>and putting the student in debt, for years to come - is nothing short evil.</div>\n  <div class=\"paragraph\">And this notion ob balanced education, must become a symbol of what it really stands for: FRAUD,<br>because an education that is anything other than integrated is simply a fake education.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">There is a related, somewhat more external subject here,<br>and that is the subject of fake and ineffective politics.</div>\n  <div class=\"paragraph\">It is a waste of time to write about it at any length,<br>but I think the starting point here should be the study of crimes committed by politicians.</div>\n  <div class=\"paragraph\">Here I would point to the <span>List of American state and local politicians convicted of crimes<sup>[3]</sup></span>,<br>and note that the \"See also\" section should be a starting point for more on the subject.</div>\n  <div class=\"paragraph\">Money, Corruption, and Insider Trading, as well as all the other mistakes in all politics,<br>is a subject that must be discussed middle school on.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Which reads me to a related subject, Indoctrination,<br>and here I have to beg a pardon, and ask all the religions people to skip this section.</div>\n  <div class=\"paragraph\">There is an extremely important lesson that every child must fully comprehend,<br>and that is the scale on which fantasy institutions thrive.</div>\n  <div class=\"paragraph\">If there is a large institution, that falls within the range of size of a global church,<br>then the church should be all the proof necessary to question it.</div>\n  <div class=\"paragraph\">If a fantasy reality is to be propagated,<br>then everything else can be rationally and fundamentally questioned, by the generation hat IS ABOUT TO INHERIT IT.</div>\n  <div class=\"paragraph\">We must stop propagating mistakes,<br>wold poverty, war, suffering, struggling, science denial, ignorance of climate, stockpiling nuclear weapons, and keeping <span>3,750 active nuclear warheads ready to destroy all major cities<sup>[4]</sup></span>, MUST STOP WITH US.</div>\n  <div class=\"paragraph\">This is not a problem for children to inherit,<br>if anything this is a reason, why they shouldn't hear a word we have to say.</div>\n  <div class=\"paragraph\">Furthermore, Richard Dawkins states that religious people,<br>that are bound to a particular religion, are atheists towards all the other religions, and asks that they take that extra step.</div>\n  <div class=\"paragraph\">Children are susceptible to indoctrination, this must not be exploited as children should become better than the previous generation, or there will never be an end to suffering,<br>Dawkins correctly identifies pushing a child into a particular religion, as a form of abuse.</div>\n  <div class=\"paragraph\">The children are the future of the world,<br>they don't need the crunches of the previous generations, they just need a global end to Poverty, and Knowledge, Wisdom and Greatness.</div>\n  <div class=\"paragraph\">For those of you who use religion to deal with suffering,<br>even if it is just loneliness, I encourage you to bring in all the other books, especially their narrated versions into your place of worship.</div>\n  <div class=\"paragraph\">The way out of suffering, the way towards meaning,<br>is found in Knowledge, Wisdom and Greatness.</div>\n  <div class=\"paragraph\">Do not disgrace the memories of people who were murdered or tortured by the hands of your organization of choice,<br>to do them justice and correct history's mistakes, your places of worship should become Great Libraries of Wisdom.</div>\n  <div class=\"paragraph\">Suffering, is best prevented,<br>or risen from - not lived in.</div>\n  <div class=\"paragraph\">I worry that that the elderly are being taken advantage of,<br>that the world has abandoned them - most don't need fantasy, they need a job that is respectful of their skills, and a happy outlook.</div>\n  <div class=\"paragraph\">It seems to me that all the churches are doing for the elderly, is take whatever little money they have left a dollar at a time,<br>it is time to transform your organizations and help the elderly to long and happy futures.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">The final subject I mention in this text,<br>is Climate and Animals.</div>\n  <div class=\"paragraph\">World poverty has blinded us,<br>there isn't a single person on planet earth that would wish famine and pandemics on the future generations.</div>\n  <div class=\"paragraph\">But in poverty,<br>the energy withing us that cares about all the future generations, that projects our love thousands of years into the future - has been drained, and we can no longer see that far.</div>\n  <div class=\"paragraph\"><span>Not only have we added to destabilized the climate<sup>[5]</sup></span>,<br>we have done nothing to take care of it for future generations - we will not be forgiven for this, the scientists are warning of untold suffering.</div>\n  <div class=\"paragraph\"><span>There maybe as few as 2,154 tigers left<sup>[6]</sup></span>, no generation wants to lose a species or large animal,<br>looks like our generation has destroyed the tigers.</div>\n  <div class=\"paragraph\">We did this,<br>with out fake education, our busy live, arrogance & ignorance, and all this hard work under a state of made up, bullshit problem, that could have been avoided, the problem of world poverty draining us of wisdom.</div>\n  <div class=\"paragraph\">Become a teacher, make your voice heard around the world and well into the future, make a difference, begin now,<br>the children and the future generations need a real education so that they may grow in Knowledge, Wisdom, and onward to Greatness.</div>\n</div>\n<div class=\"break-after\">&nbsp;</div>\n<div>\n  <div class=\"section\" style=\"padding-bottom: 1rem;\">References</div>\n  <div>[1]: https://www.youtube.com/watch?v=Chrd0GjBq9o</div>\n  <div>[2]: https://www.youtube.com/watch?v=sxyKNMrhEvY</div>\n  <div>[3]: https://en.wikipedia.org/wiki/List_of_American_state_and_local_politicians_convicted_of_crimes</div>\n  <div>[4]: https://www.youtube.com/watch?v=L7EmLf4Xlq0</div>\n  <div>[5]: https://www.ipcc.ch/report/ar6/wg1/</div>\n  <div>[6]: https://www.iucnredlist.org/species/15955/50659951</div>\n</div>",
  "text": "School is broken, ineffective, or fake,\nand provides no real results.\nAnd certainly,\nno results that are reliably reproducible.\nI propose,\nintroducing several new classes.\nThese classes will create a starting point,\nfrom which the new schools can emerge.\nThese classes already have a new format,\nand they do not feature grades, just real and life changing information.\n\nThe most difficult subject, is that of healthy relationships,\nas there has been a ongoing problem that colleges and universities try to hide.\nThe primary focus right now, is to undue the seemingly self propagating myths,\nabout what it means to become a man.\nBecause what boys currently think it is,\nis not that far off from participating in deliberate emotional exploitation and general predation.\nTaking advantage of the emotionally hurt,\nor those who don't yet have the necessary culture or knowledge to make the correct choices is more likely to prevent a boy from ever becoming a man.\nHere I would like to note that, a college town should not present drugs and alcohol as one of the things to do[1],\nbecause only a monster would do that to a young person, especially a young person under the stress of fake education and very real debt and poverty.\nI propose the name of this class is Love,\nand the starting point for the most tragic subject, can be found in one of Jon Krakauer's books Missoula.\n(I will not read this book, but I trust Mr. Krakauer based on his other works)\nThis is a very important subject, and as deeply sad and tragic it is,\nIt must stand as the first and foremost topic that comes up when speaking about making improvement to world's education systems.\nThe children need to understand that what makes a Human Being mature is not even age,\nit does not matter if someone is 50, if they didn't grow in Knowledge and Wisdom then they are sill a child in their mind.\n\nThe second new Class I propose is called Poverty And Money,\nit's primary purpose it to state in no uncertain terms that:\nHumanity has blindly created an artificial problem,\nthat causes great harm to our family, to our minds, to our bodies, and to our education.\nWithout anybody interning to do so,\nwe have begun advancing humanity by using money and inducing poverty.\nThis unintended consequence,\nis a major cause behind crime, I leave it to the reader to conduct the research or locate the necessary citations - if any.\nWe have been taught, that if money was free,\nthere would be inflation and the nations would collapse.\nI suspect this is correct,\nbut the collapse of nations is a much smaller problem than world poverty, that harms everyone.\nChildren need to understand that this is an artificial problem,\nand they need to come up with a solution.\nThe starting point I propose here,\nis a world bank that does not track debt of the people that use it.\nTo prevent whatever collapse putting food on the table and repairing the world will cause,\nthe card may come with a dignified daily spending limit, the discussion of what that limit should be should start at $100 per day.\nThere will be businesses that will attempt to exploit this,\nbut if they tamper with prices, they will be temporary banned from processing those payments.\nOne important point to notice here is that,\nhaving a $100 per day, will put money into local businesses.\nIt will not shut them down,\nnor will the the upper daily limit, cause any run away inflation.\nThe class should also note that it was previously impossible to create a bank like this,\nfor three reasons.\nCredit cards and computer networks are a new invention, until the invention of cards there was no way to set a spending limit,\nand until computers started running this show, it was impossible to effectively detect and ban businesses tampering with prices and related fraud.\n\nThe third class on my list is called Fake Education,\nit is a class that discusses the differences between fake or ineffective education and a real education.\nOne strong point that must be touched upon here,\nis whether or not the teachers have what they need to teach for real...\nAnd if so,\nwhy is it that they have been blindly participating in a fundamentally broken system[2].\nBeing able to identify fake education is critical,\nto getting a real one, and this is the class that helps the student ask the right question and spot the fake.\nOne of the questions that maybe asked,\nis the importance of staying current with Narrated Version of the Great Books written by contemporary honorable intellectuals, that clearly display a love and concern for humanity.\nAnd a related question,\nof relative importance of overpriced textbooks.\nThe children taking these classes,\nare soon going to become the new intellectuals that create such inspirational and beloved works - why are they denied access to these books.\nAnd why are they forced to low quality disconnected fact textbooks,\nthat are mostly used in rote memorization, if even that.\nChildren must be taught to identify when they are being taken advantage of by means of grades,\ngrades that belong to a system of threats, threat of punishment, threat of being seen as stupid, threat of being held back, threat of being laughed at, threat of being alone.\nIn 2017, 6,241 US Students ended their life,\nplease understand, that school is meant to be the happiest place in our early memories - what we have today is a disgrace.\nIt is a system of abuse, or shame, and a system of destruction of delicate minds,\nminds that are each capable of Greatness, that do operate on genius level, but also minds that will cease to grow if they connect their intelligence with the meaningless GPA.\nMany students see their grade, especially the low GPA,\nas a measure of their intelligence.\nBad grades only come from not memorizing disconnected facts,\nthere is nothing lo learn for real in today's schools as everything is divided up into meaninglessness.\nA child learns by making small steps in the general direction of whatever their next noble pursuit is,\nonly a sick and truly uneducated person could assume that a child learns by hopping from subject to subject five or ten times a day.\nClasses must not be disconnect, they must be self directed, self paced,\nand a child's education must be a road marked by meaningful milestones and achievements that they are proud of, not just during education but for decades after their graduation.\nExamples of such achievements are learning the language of mathematics by having learned programming first and taking to create breathtaking generative art shown in galleries across the world,\nor learning 3D modeling for the purpose of creating and more importantly selling real and unique, and beautiful products.\nUntil we have a better way to identify ineffective education,\nI propose that moneymaking is used as a measure of results and effectiveness of their education.\nFor those of you marking the medical school argument here,\nunderstand that 250,000 possibly 440,000 people in the U.S. die every year from medical errors.\nThe issue of charging for college education must be touched upon here as well,\ncollege is not different from high school, it is just as bad.\nStealing the saving of the families that think their child is getting a real education,\nand putting the student in debt, for years to come - is nothing short evil.\nAnd this notion ob balanced education, must become a symbol of what it really stands for: FRAUD,\nbecause an education that is anything other than integrated is simply a fake education.\n\nThere is a related, somewhat more external subject here,\nand that is the subject of fake and ineffective politics.\nIt is a waste of time to write about it at any length,\nbut I think the starting point here should be the study of crimes committed by politicians.\nHere I would point to the List of American state and local politicians convicted of crimes[3],\nand note that the \"See also\" section should be a starting point for more on the subject.\nMoney, Corruption, and Insider Trading, as well as all the other mistakes in all politics,\nis a subject that must be discussed middle school on.\n\nWhich reads me to a related subject, Indoctrination,\nand here I have to beg a pardon, and ask all the religions people to skip this section.\nThere is an extremely important lesson that every child must fully comprehend,\nand that is the scale on which fantasy institutions thrive.\nIf there is a large institution, that falls within the range of size of a global church,\nthen the church should be all the proof necessary to question it.\nIf a fantasy reality is to be propagated,\nthen everything else can be rationally and fundamentally questioned, by the generation hat IS ABOUT TO INHERIT IT.\nWe must stop propagating mistakes,\nwold poverty, war, suffering, struggling, science denial, ignorance of climate, stockpiling nuclear weapons, and keeping 3,750 active nuclear warheads ready to destroy all major cities[4], MUST STOP WITH US.\nThis is not a problem for children to inherit,\nif anything this is a reason, why they shouldn't hear a word we have to say.\nFurthermore, Richard Dawkins states that religious people,\nthat are bound to a particular religion, are atheists towards all the other religions, and asks that they take that extra step.\nChildren are susceptible to indoctrination, this must not be exploited as children should become better than the previous generation, or there will never be an end to suffering,\nDawkins correctly identifies pushing a child into a particular religion, as a form of abuse.\nThe children are the future of the world,\nthey don't need the crunches of the previous generations, they just need a global end to Poverty, and Knowledge, Wisdom and Greatness.\nFor those of you who use religion to deal with suffering,\neven if it is just loneliness, I encourage you to bring in all the other books, especially their narrated versions into your place of worship.\nThe way out of suffering, the way towards meaning,\nis found in Knowledge, Wisdom and Greatness.\nDo not disgrace the memories of people who were murdered or tortured by the hands of your organization of choice,\nto do them justice and correct history's mistakes, your places of worship should become Great Libraries of Wisdom.\nSuffering, is best prevented,\nor risen from - not lived in.\nI worry that that the elderly are being taken advantage of,\nthat the world has abandoned them - most don't need fantasy, they need a job that is respectful of their skills, and a happy outlook.\nIt seems to me that all the churches are doing for the elderly, is take whatever little money they have left a dollar at a time,\nit is time to transform your organizations and help the elderly to long and happy futures.\n\nThe final subject I mention in this text,\nis Climate and Animals.\nWorld poverty has blinded us,\nthere isn't a single person on planet earth that would wish famine and pandemics on the future generations.\nBut in poverty,\nthe energy withing us that cares about all the future generations, that projects our love thousands of years into the future - has been drained, and we can no longer see that far.\nNot only have we added to destabilized the climate[5],\nwe have done nothing to take care of it for future generations - we will not be forgiven for this, the scientists are warning of untold suffering.\nThere maybe as few as 2,154 tigers left[6], no generation wants to lose a species or large animal,\nlooks like our generation has destroyed the tigers.\nWe did this,\nwith out fake education, our busy live, arrogance & ignorance, and all this hard work under a state of made up, bullshit problem, that could have been avoided, the problem of world poverty draining us of wisdom.\nBecome a teacher, make your voice heard around the world and well into the future, make a difference, begin now,\nthe children and the future generations need a real education so that they may grow in Knowledge, Wisdom, and onward to Greatness.\n\nReferences\n[1]: https://www.youtube.com/watch?v=Chrd0GjBq9o\n[2]: https://www.youtube.com/watch?v=sxyKNMrhEvY\n[3]: https://en.wikipedia.org/wiki/List_of_American_state_and_local_politicians_convicted_of_crimes\n[4]: https://www.youtube.com/watch?v=L7EmLf4Xlq0\n[5]: https://www.ipcc.ch/report/ar6/wg1/\n[6]: https://www.iucnredlist.org/species/15955/50659951",
  "images": [],
  "links": [
    {
      "title": "a college town should not present drugs and alcohol as one of the things to do",
      "url": "https://www.youtube.com/watch?v=Chrd0GjBq9o",
      "hostname": "www.youtube.com"
    },
    {
      "title": "why is it that they have been blindly participating in a fundamentally broken system",
      "url": "https://www.youtube.com/watch?v=sxyKNMrhEvY",
      "hostname": "www.youtube.com"
    },
    {
      "title": "List of American state and local politicians convicted of crimes",
      "url": "https://en.wikipedia.org/wiki/List_of_American_state_and_local_politicians_convicted_of_crimes",
      "hostname": "en.wikipedia.org"
    },
    {
      "title": "3,750 active nuclear warheads ready to destroy all major cities",
      "url": "https://www.youtube.com/watch?v=L7EmLf4Xlq0",
      "hostname": "www.youtube.com"
    },
    {
      "title": "Not only have we added to destabilized the climate",
      "url": "https://www.ipcc.ch/report/ar6/wg1/",
      "hostname": "www.ipcc.ch"
    },
    {
      "title": "There maybe as few as 2,154 tigers left",
      "url": "https://www.iucnredlist.org/species/15955/50659951",
      "hostname": "www.iucnredlist.org"
    }
  ]
}