{
  "name": "furkies-purrkies-poetry-0419",
  "title": "The Simple Architecture Of Real Schools",
  "date": "2021-04-24T01:32:46.872Z",
  "image": "poetry-0419-illustration.jpg",
  "audio": "poetry-0419.mp3",
  "artwork": "https://unsplash.com/",
  "id": "furkies-purrkies-poetry-0419",
  "attachments": {},
  "guid": "5fd39f97-8991-4791-8f8e-525f91477b89",
  "html": "<div class=\"section\">\n  <p>Let me just open by hypothesizing <a href=\"https://www.youtube.com/watch?v=sxyKNMrhEvY\">why schools are not teaching</a>,</p>\n  <p>it is because they don&apos;t actually know how, and <a href=\"https://www.youtube.com/watch?v=5Hh6uHUx728\">since everyone gets paid anyway, they see no reason to fix it</a>.</p>\n</div>\n\n<div class=\"section\">\n  <hr>\n</div>\n\n<div class=\"section\">\n  <p>Let us use, learning a photo editing program, as an example,</p>\n  <p>today schools use multiple choice tests to asses the knowledge of a subject.</p>\n</div>\n\n<div class=\"section\">\n  <p>Instead of evaluating the students by for example asking them to create a fake photo,</p>\n  <p>hide it among real photographs and let the class try to guess which is the fake one.</p>\n</div>\n\n<div class=\"section\">\n  <p>Schools use questions like, what is the purpose of image desaturation?</p>\n  <p>A) making it sharper, B) making it lighter, C) all of the above, D) we&apos;re pretending to teach to take a paycheck home.</p>\n</div>\n\n<div class=\"section\">\n  <p>I know that in a real image editing class, an actual program is used,</p>\n  <p>but the photo editing program we are using here, is an analogy for mathematics, physics, chemistry, and biology.</p>\n</div>\n\n<div class=\"section\">\n  <p>It is meant to demonstrate fake lectures,</p>\n  <p>and matching ineffective tests, in serious subject.</p>\n</div>\n\n<div class=\"section\">\n  <hr>\n</div>\n\n<div class=\"section\">\n  <p>But even in a real photo editing class, the teachers still end up failing the students,</p>\n  <p>because the real grade would have to be opening a successful photography business and making $100.</p>\n</div>\n\n<div class=\"section\">\n  <p>This could be signing up with Unsplash, and using the site to become a Droneographer or a wedding photographer,</p>\n  <p>see, just learning how to use a photo editing program is useless.</p>\n</div>\n\n<div class=\"section\">\n  <p>The class must begin with photography, center around image editing,</p>\n  <p>and passing all the students that now have a functional business.</p>\n</div>\n\n<div class=\"section\">\n  <p>Schools can&apos;t do this, because it would reveal them as ineffective,</p>\n  <p>so as long as we are OK, with them being already ineffective, we are wasting our time, and the time of all the children.</p>\n</div>\n\n<div class=\"section\">\n  <p>Oh and by the, your kid is not supposed work Fast Food, or Retail,</p>\n  <p>those are not jobs for the children that represent the Future of Human Kind.</p>\n</div>\n\n<div class=\"section\">\n  <p>Schools, actually could provide the students with 3 to 10 &quot;side projects&quot;,</p>\n  <p>a side project is a miniature business, that makes about a $100 a month.</p>\n</div>\n\n<div class=\"section\">\n  <hr>\n</div>\n\n<div class=\"section\">\n  <p>To return to our analogy for mathematics, physics, chemistry, and biology,</p>\n  <p>these subjects are not being tested, the only thing that is tested here is the students ability to temporary memorize.</p>\n</div>\n\n<div class=\"section\">\n  <p>This is fraud, math is actually quite testable,</p>\n  <p>but since schools are not teaching, all the children would fail math on a real test.</p>\n</div>\n\n<div class=\"section\">\n  <p>The math nerds, are not a vote for things working out sometimes,</p>\n  <p>they are self taught, they learn about math, math history, and the underlying concepts on their own, they learn for real.</p>\n</div>\n\n<div class=\"section\">\n  <p>The lectures are ineffective, the tests only test memorization and lying,</p>\n  <p>and all the class really teaches is how to cram before a test, which works great for a factory job as well.</p>\n</div>\n\n<div class=\"section\">\n  <p>Imagine a factory, that would give its employees surprise college entry exams,</p>\n  <p>about every month on average - what would that reveal about the employees, would they all continue passing the surprise tests?</p>\n</div>\n\n<div class=\"section\">\n  <p>I would guess,</p>\n  <p>they would all fail with a low score.</p>\n</div>\n\n<div class=\"section\">\n  <p>That is because they only retain what they learned for a few days,</p>\n  <p>they aren&apos;t actually educated, they are memorizing.</p>\n</div>\n\n<div class=\"section\">\n  <hr>\n</div>\n\n<div class=\"section\">\n  <p>Now, that I painted a certain picture for you,</p>\n  <p>and let you make your own conclusions, lets fix this up.</p>\n</div>\n\n<div class=\"section\">\n  <hr>\n</div>\n\n<div class=\"section\">\n  <p>Unfortunately I have to mention every step that led me to this architecture,</p>\n  <p>and the first one is a little creepy, so lets just get it out of the way.</p>\n</div>\n\n<div class=\"section\">\n  <p>In 1985 Orson Scott Card introduced the idea of a game like intelligence test,</p>\n  <p>for Andrew &quot;Ender&quot; Wiggin, in his si-fi book Ender&apos;s Game.</p>\n</div>\n\n<div class=\"section\">\n  <p>When I read the book, I already suspected that creating a game like educational experience,</p>\n  <p>could be useful in real education.</p>\n</div>\n\n<div class=\"section\">\n  <p>About a decade back, one of the science popularized released a game that dealt with space,</p>\n  <p>and currently there is an a game entitled <a href=\"https://youtu.be/F0KiePxOuuc?t=294\">Kerbal Space Program</a> that teachers Orbital Dynamics, this is by a different publisher.</p>\n</div>\n\n<div class=\"section\">\n  <p>About eight years ago I came across the concept of <a href=\"https://en.wikipedia.org/wiki/Gamification\">Gamemification, making serious things game like</a>,</p>\n  <p>wikipedia describes it as:</p>\n</div>\n\n<div class=\"section\">\n  <p>&quot;Gamemification strategic attempt to enhance systems, services, organisations and activities,</p>\n  <p>in order to create similar experiences to those experienced when playing games,</p>\n  <p>in order to motivate and engage users.&quot;</p>\n</div>\n\n<div class=\"section\">\n  <hr>\n</div>\n\n<div class=\"section\">\n  <p>Let us pause here for a moment, and note that Kerbal Space Program like game,</p>\n  <p>is a good example of a real test of knowledge of Mathematics, Physics, and Orbital Dynamics.</p>\n</div>\n\n<div class=\"section\">\n  <p>The student fails an Orbital Dynamics lecture, if they are unable to put a simulated shuttle in earths orbit,</p>\n  <p>this is a real test of real knowledge.</p>\n</div>\n\n<div class=\"section\">\n  <p>The precise scenario the student will be presented will be random, it could be the sun&apos;s orbit,</p>\n  <p>geo stationary orbit, or get a ship nearing mars into the martian orbit.</p>\n</div>\n\n<div class=\"section\">\n  <p>There will be a series of tests and paid internships,</p>\n  <p>that ends in working for NASA or ESA, or some private company.</p>\n</div>\n\n<div class=\"section\">\n  <p>These organizations have a say in the tests that they require,</p>\n  <p>the school will be influenced by industry seeking talent, and not politicians seeking re-elections.</p>\n</div>\n\n<div class=\"section\">\n  <p>The student will see employment statistics,</p>\n  <p>they will be able to make an informed decision about this particular job market.</p>\n</div>\n\n<div class=\"section\">\n  <hr>\n</div>\n\n<div class=\"section\">\n  <p>Not everyone likes space things,</p>\n  <p>space is a cold and dangerous place.</p>\n</div>\n\n<div class=\"section\">\n  <p>We all had music class at some point,</p>\n  <p>and many of us didn&apos;t realize that we could have a side job as a DJ, as a musician.</p>\n</div>\n\n<div class=\"section\">\n  <p>Music composition takes just a couple of days, if not hours,</p>\n  <p>when taught right.</p>\n</div>\n\n<div class=\"section\">\n  <p>The <a href=\"https://www.youtube.com/watch?v=0sRvkaxh8EU\">children can&apos;t be taught musical notation, they have to be taught how to use lmms</a>,</p>\n  <p>teaching children musical notation is fraud, musical notation is for people who are ready to study existing music.</p>\n</div>\n\n<div class=\"section\">\n  <p>Kids just want to compose at first, and they don&apos;t actually know the full picture of what they want,</p>\n  <p>because their songs can make them money, just about all it takes is thinking of a song as six little songs ov varying complexity and instruments, they can upload that to bandcamp.com or similar.</p>\n</div>\n\n<div class=\"section\">\n  <p>There would need to exist a music label for students, so that their music can get on spotify and the radio,</p>\n  <p>I am sure there are many companies that would love to do that for free, passing on all the profits on students, if not one would be created for that purpose.</p>\n</div>\n\n<div class=\"section\">\n  <p>Of course in the music class of today,</p>\n  <p>we are taught nonsense, and pushed along to memorize for the final and put it all behind us, in preparations for poverty resulting from unforgivable student loans.</p>\n</div>\n\n<div class=\"section\">\n  <hr>\n</div>\n\n<div class=\"section\">\n  <p>Finally, before I looked at schools, I realized that Audio Books can help prison inmates a great deal,</p>\n  <p>it is not possible to describe the importance of easy access to beautiful narrated books in prisons.</p>\n</div>\n\n<div class=\"section\">\n  <p>I would ask celebrities, to specifically create a prison version of a narration,</p>\n  <p>a separate narration from what is given to school students.</p>\n</div>\n\n<div class=\"section\">\n  <p>Some people aren&apos;t willing to read for high school kids,</p>\n  <p>but would be greatly honored, and in fact greatly appreciated, if they narrated great books for inmates.</p>\n</div>\n\n<div class=\"section\">\n  <p>This is so important,</p>\n  <p>history will not look kindly at mass incarceration and legal slavery, they will not look kindly at our ignorance and arrogance, and failure to prevent children from becoming criminals.</p>\n</div>\n\n<div class=\"section\">\n  <hr>\n</div>\n\n<div class=\"section\">\n  <p>And here we arrive at an explanation of the very architecture,</p>\n  <p>of the new school.</p>\n</div>\n\n<div class=\"section\">\n  <p>There is no building, no rent, and no fraudulent moochers, or big fat white lice, not to mention spoiled lemons,</p>\n  <p>that pretend to teach children.</p>\n</div>\n\n<div class=\"section\">\n  <p>Parent&apos;s don&apos;t get to use school as a convenient baby sitter,</p>\n  <p>actually the stress of High School and College, exposes children to drugs, school is a pretty nasty baby sitter.</p>\n</div>\n\n<div class=\"section\">\n  <hr>\n</div>\n\n<div class=\"section\">\n  <p>A tablet, large, free to replace, open source Linux Tablet similar to the <a href=\"https://www.pine64.org/pinetab/\">PINETAB</a>,</p>\n  <p>it presented to each student, there is a strong emphasis on socializing, and making friend in real life.</p>\n</div>\n\n<div class=\"section\">\n  <p><a href=\"https://www.youtube.com/watch?v=8vHzUTtmbAM\">But not behind the brick wall of a class room (trigger warning)</a>,</p>\n  <p><a href=\"https://www.youtube.com/watch?v=fmoor8DwqW4\">children are not inmates, they are not meant to sit in rows memorizing noise, so that the teacher can take their fraudulent paycheck home</a>.</p>\n</div>\n\n<div class=\"section\">\n  <p>On the tablet there will be a series of programs, similar to the applications on the <a href=\"https://en.wikipedia.org/wiki/OLPC_XO\">OLPC XO</a>,</p>\n  <p>but there will be one web application that will present a game like educational experience.</p>\n</div>\n\n<div class=\"section\">\n  <p>The students will still have stats, points or grades, this is somewhat kind of, similar to the <a href=\"https://www.youtube.com/watch?v=FACg2r8OcF0\">Dark Souls Player Status</a>,</p>\n  <p>but here we will see things related to education.</p>\n</div>\n\n<div class=\"section\">\n  <p>So passing and re-testing the Orbital Dynamics class,</p>\n  <p>will increase different stats, like math, physics, astrophysics.</p>\n</div>\n\n<div class=\"section\">\n  <p>The student while still in school, will be asked to re-play the challenges,</p>\n  <p>or games, that are used to refresh and refine their knowledge.</p>\n</div>\n\n<div class=\"section\">\n  <p>To mention Kerbal Space Program again,</p>\n  <p>students only need to learn how to get into the orbit once, the test are only there to help retain knowledge.</p>\n</div>\n\n<div class=\"section\">\n  <p>This is a real school and a real education,</p>\n  <p>that is architected in such a way that the students end up getting contracts for well paying jobs, when their stats are high enough to qualify.</p>\n</div>\n\n<div class=\"section\">\n  <p>This is Real Education,</p>\n  <p>and because the student chooses their own path, it also becomes really fun and respectful of their existing predispositions.</p>\n</div>\n\n<div class=\"section\">\n  <p>The kids that get stuck with making music,</p>\n  <p>are my favorite example.</p>\n</div>\n\n<div class=\"section\">\n  <p>Each school district will have a community of music makers,</p>\n  <p>who don&apos;t want to get a job, because they already make a lot of money.</p>\n</div>\n\n<div class=\"section\">\n  <hr>\n</div>\n\n<div class=\"section\">\n  <p>The orbital dynamics class example I give here, requires a little bit more explanation,</p>\n  <p>not all students that end up in the aerospace industry will begin with love for NASA.</p>\n</div>\n\n<div class=\"section\">\n  <p>Orbital Dynamics, is needed for several things, Generative Art Classes, Animation Classes, Computer Game Classes,</p>\n  <p>whatever requires a decent knowledge of Netwon&apos;s calculus.</p>\n</div>\n\n<div class=\"section\">\n  <p>So it is not just this Orbital Dynamics class,</p>\n  <p>that pops up in a class list on their tablet.</p>\n</div>\n\n<div class=\"section\">\n  <p>It is used by many courses,</p>\n  <p>and what makes a course outstanding, is that it helps the student with making money.</p>\n</div>\n\n<div class=\"section\">\n  <p>Due to money being misunderstood,</p>\n  <p>the world is cutting off the oxygen to its collective brain.</p>\n</div>\n\n<div class=\"section\">\n  <p>The classes presented to the students have to help the out of poverty,</p>\n  <p>Generative Art is about selling large beautiful canvas, with intricate high resolution computer art.</p>\n</div>\n\n<div class=\"section\">\n  <p>Some of those graphics, will be created by trails of objects that use Newton&apos;s Calculus,</p>\n  <p>animation classes lead to a job in graphic arts, providing videos for advertising purposes, or as background to long winded poetry.</p>\n</div>\n\n<div class=\"section\">\n  <p>And computer game classes, help the students sell apps, and games,</p>\n  <p>here lmms is a good example, it helps a person compose in less than an hour, and there are game engines that won&apos;t require years of programming.</p>\n</div>\n\n<div class=\"section\">\n  <p><a href=\"https://www.youtube.com/watch?v=zbtmAjhtPss\">Level design can be a big subject</a>,</p>\n  <p>but a lot of players are a lot better at level design than they assume.</p>\n</div>\n\n<div class=\"section\">\n  <p>The tools that are used for building the levels,</p>\n  <p>are often part of the game, <a href=\"https://www.youtube.com/watch?v=kcREQzsS0Hc\">it just makes sense to be within the walls of the game to make the levels more intricate</a>.</p>\n</div>\n\n<div class=\"section\">\n  <p>Some programming will be required, and that is the area that would call for Orbital Dynamics and Calculus,</p>\n  <p>in a first person shooter the math would be related to animations, in a game like <a href=\"https://www.youtube.com/watch?v=eLKudh3vvsU\">asteroids</a> larger asteroids would attract the smaller ones with the force of gravity.</p>\n</div>\n\n<div class=\"section\">\n  <hr>\n</div>\n\n<div class=\"section\">\n  <p>Graduation is about successfully learning something that results in pushing away poverty,</p>\n  <p>in a perfect world education would be more pure, but in a world that misunderstood how to use money, money making must be taught in school.</p>\n</div>\n\n<div class=\"section\">\n  <p>Jut to repeat my opening remarks,</p>\n  <p>schools shy away from real results and noble aims, because they don&apos;t know how to educate, they are a place where adults go to make money under the protection of a union and an ineffective cirricula.</p>\n</div>\n\n<div class=\"section\">\n  <hr>\n</div>\n\n<div class=\"section\">\n  <p>Real school is a much more personal experience,</p>\n  <p>and the access point is a computer tablet with Open Source software, where companies can&apos;t trick students into paying for what should be free.</p>\n</div>\n\n<div class=\"section\">\n  <p>The removal of stress that students experience when they realize they are being forced to pretend to learn by memorization or fail the class,</p>\n  <p>will already make a big difference.</p>\n</div>\n\n<div class=\"section\">\n  <p>Letting the students choose their own path,</p>\n  <p>and creating paths that help students become financially independent, will take care of the rest.</p>\n</div>",
  "bootstrap": "<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Let me just open by hypothesizing <a href=\"https://www.youtube.com/watch?v=sxyKNMrhEvY\">why schools are not teaching</a>,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">it is because they don't actually know how, and <a href=\"https://www.youtube.com/watch?v=5Hh6uHUx728\">since everyone gets paid anyway, they see no reason to fix it</a>.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Let us use, learning a photo editing program, as an example,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">today schools use multiple choice tests to asses the knowledge of a subject.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Instead of evaluating the students by for example asking them to create a fake photo,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">hide it among real photographs and let the class try to guess which is the fake one.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Schools use questions like, what is the purpose of image desaturation?</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">A) making it sharper, B) making it lighter, C) all of the above, D) we're pretending to teach to take a paycheck home.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I know that in a real image editing class, an actual program is used,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">but the photo editing program we are using here, is an analogy for mathematics, physics, chemistry, and biology.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">It is meant to demonstrate fake lectures,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">and matching ineffective tests, in serious subject.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">But even in a real photo editing class, the teachers still end up failing the students,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">because the real grade would have to be opening a successful photography business and making $100.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">This could be signing up with Unsplash, and using the site to become a Droneographer or a wedding photographer,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">see, just learning how to use a photo editing program is useless.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The class must begin with photography, center around image editing,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">and passing all the students that now have a functional business.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Schools can't do this, because it would reveal them as ineffective,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">so as long as we are OK, with them being already ineffective, we are wasting our time, and the time of all the children.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Oh and by the, your kid is not supposed work Fast Food, or Retail,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">those are not jobs for the children that represent the Future of Human Kind.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Schools, actually could provide the students with 3 to 10 \"side projects\",</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">a side project is a miniature business, that makes about a $100 a month.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">To return to our analogy for mathematics, physics, chemistry, and biology,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">these subjects are not being tested, the only thing that is tested here is the students ability to temporary memorize.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">This is fraud, math is actually quite testable,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">but since schools are not teaching, all the children would fail math on a real test.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The math nerds, are not a vote for things working out sometimes,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">they are self taught, they learn about math, math history, and the underlying concepts on their own, they learn for real.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The lectures are ineffective, the tests only test memorization and lying,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">and all the class really teaches is how to cram before a test, which works great for a factory job as well.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Imagine a factory, that would give its employees surprise college entry exams,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">about every month on average - what would that reveal about the employees, would they all continue passing the surprise tests?</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I would guess,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">they would all fail with a low score.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">That is because they only retain what they learned for a few days,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">they aren't actually educated, they are memorizing.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Now, that I painted a certain picture for you,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">and let you make your own conclusions, lets fix this up.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Unfortunately I have to mention every step that led me to this architecture,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">and the first one is a little creepy, so lets just get it out of the way.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">In 1985 Orson Scott Card introduced the idea of a game like intelligence test,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">for Andrew \"Ender\" Wiggin, in his si-fi book Ender's Game.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">When I read the book, I already suspected that creating a game like educational experience,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">could be useful in real education.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">About a decade back, one of the science popularized released a game that dealt with space,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">and currently there is an a game entitled <a href=\"https://youtu.be/F0KiePxOuuc?t=294\">Kerbal Space Program</a> that teachers Orbital Dynamics, this is by a different publisher.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">About eight years ago I came across the concept of <a href=\"https://en.wikipedia.org/wiki/Gamification\">Gamemification, making serious things game like</a>,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">wikipedia describes it as:</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">\"Gamemification strategic attempt to enhance systems, services, organisations and activities,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">in order to create similar experiences to those experienced when playing games,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">in order to motivate and engage users.\"</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Let us pause here for a moment, and note that Kerbal Space Program like game,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">is a good example of a real test of knowledge of Mathematics, Physics, and Orbital Dynamics.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The student fails an Orbital Dynamics lecture, if they are unable to put a simulated shuttle in earths orbit,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">this is a real test of real knowledge.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The precise scenario the student will be presented will be random, it could be the sun's orbit,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">geo stationary orbit, or get a ship nearing mars into the martian orbit.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">There will be a series of tests and paid internships,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">that ends in working for NASA or ESA, or some private company.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">These organizations have a say in the tests that they require,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">the school will be influenced by industry seeking talent, and not politicians seeking re-elections.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The student will see employment statistics,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">they will be able to make an informed decision about this particular job market.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Not everyone likes space things,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">space is a cold and dangerous place.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">We all had music class at some point,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">and many of us didn't realize that we could have a side job as a DJ, as a musician.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Music composition takes just a couple of days, if not hours,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">when taught right.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The <a href=\"https://www.youtube.com/watch?v=0sRvkaxh8EU\">children can't be taught musical notation, they have to be taught how to use lmms</a>,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">teaching children musical notation is fraud, musical notation is for people who are ready to study existing music.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Kids just want to compose at first, and they don't actually know the full picture of what they want,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">because their songs can make them money, just about all it takes is thinking of a song as six little songs ov varying complexity and instruments, they can upload that to bandcamp.com or similar.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">There would need to exist a music label for students, so that their music can get on spotify and the radio,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I am sure there are many companies that would love to do that for free, passing on all the profits on students, if not one would be created for that purpose.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Of course in the music class of today,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">we are taught nonsense, and pushed along to memorize for the final and put it all behind us, in preparations for poverty resulting from unforgivable student loans.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Finally, before I looked at schools, I realized that Audio Books can help prison inmates a great deal,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">it is not possible to describe the importance of easy access to beautiful narrated books in prisons.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I would ask celebrities, to specifically create a prison version of a narration,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">a separate narration from what is given to school students.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Some people aren't willing to read for high school kids,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">but would be greatly honored, and in fact greatly appreciated, if they narrated great books for inmates.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">This is so important,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">history will not look kindly at mass incarceration and legal slavery, they will not look kindly at our ignorance and arrogance, and failure to prevent children from becoming criminals.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">And here we arrive at an explanation of the very architecture,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">of the new school.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">There is no building, no rent, and no fraudulent moochers, or big fat white lice, not to mention spoiled lemons,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">that pretend to teach children.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Parent's don't get to use school as a convenient baby sitter,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">actually the stress of High School and College, exposes children to drugs, school is a pretty nasty baby sitter.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">A tablet, large, free to replace, open source Linux Tablet similar to the <a href=\"https://www.pine64.org/pinetab/\">PINETAB</a>,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">it presented to each student, there is a strong emphasis on socializing, and making friend in real life.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\"><a href=\"https://www.youtube.com/watch?v=8vHzUTtmbAM\">But not behind the brick wall of a class room (trigger warning)</a>,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\"><a href=\"https://www.youtube.com/watch?v=fmoor8DwqW4\">children are not inmates, they are not meant to sit in rows memorizing noise, so that the teacher can take their fraudulent paycheck home</a>.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">On the tablet there will be a series of programs, similar to the applications on the <a href=\"https://en.wikipedia.org/wiki/OLPC_XO\">OLPC XO</a>,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">but there will be one web application that will present a game like educational experience.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The students will still have stats, points or grades, this is somewhat kind of, similar to the <a href=\"https://www.youtube.com/watch?v=FACg2r8OcF0\">Dark Souls Player Status</a>,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">but here we will see things related to education.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">So passing and re-testing the Orbital Dynamics class,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">will increase different stats, like math, physics, astrophysics.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The student while still in school, will be asked to re-play the challenges,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">or games, that are used to refresh and refine their knowledge.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">To mention Kerbal Space Program again,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">students only need to learn how to get into the orbit once, the test are only there to help retain knowledge.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">This is a real school and a real education,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">that is architected in such a way that the students end up getting contracts for well paying jobs, when their stats are high enough to qualify.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">This is Real Education,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">and because the student chooses their own path, it also becomes really fun and respectful of their existing predispositions.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The kids that get stuck with making music,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">are my favorite example.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Each school district will have a community of music makers,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">who don't want to get a job, because they already make a lot of money.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The orbital dynamics class example I give here, requires a little bit more explanation,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">not all students that end up in the aerospace industry will begin with love for NASA.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Orbital Dynamics, is needed for several things, Generative Art Classes, Animation Classes, Computer Game Classes,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">whatever requires a decent knowledge of Netwon's calculus.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">So it is not just this Orbital Dynamics class,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">that pops up in a class list on their tablet.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">It is used by many courses,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">and what makes a course outstanding, is that it helps the student with making money.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Due to money being misunderstood,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">the world is cutting off the oxygen to its collective brain.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The classes presented to the students have to help the out of poverty,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Generative Art is about selling large beautiful canvas, with intricate high resolution computer art.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Some of those graphics, will be created by trails of objects that use Newton's Calculus,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">animation classes lead to a job in graphic arts, providing videos for advertising purposes, or as background to long winded poetry.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">And computer game classes, help the students sell apps, and games,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">here lmms is a good example, it helps a person compose in less than an hour, and there are game engines that won't require years of programming.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\"><a href=\"https://www.youtube.com/watch?v=zbtmAjhtPss\">Level design can be a big subject</a>,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">but a lot of players are a lot better at level design than they assume.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The tools that are used for building the levels,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">are often part of the game, <a href=\"https://www.youtube.com/watch?v=kcREQzsS0Hc\">it just makes sense to be within the walls of the game to make the levels more intricate</a>.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Some programming will be required, and that is the area that would call for Orbital Dynamics and Calculus,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">in a first person shooter the math would be related to animations, in a game like <a href=\"https://www.youtube.com/watch?v=eLKudh3vvsU\">asteroids</a> larger asteroids would attract the smaller ones with the force of gravity.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Graduation is about successfully learning something that results in pushing away poverty,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">in a perfect world education would be more pure, but in a world that misunderstood how to use money, money making must be taught in school.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Jut to repeat my opening remarks,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">schools shy away from real results and noble aims, because they don't know how to educate, they are a place where adults go to make money under the protection of a union and an ineffective cirricula.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Real school is a much more personal experience,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">and the access point is a computer tablet with Open Source software, where companies can't trick students into paying for what should be free.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The removal of stress that students experience when they realize they are being forced to pretend to learn by memorization or fail the class,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">will already make a big difference.</div>\n  </div>\n</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Letting the students choose their own path,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">and creating paths that help students become financially independent, will take care of the rest.</div>\n  </div>\n</div>",
  "print": "<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Let me just open by hypothesizing <span>why schools are not teaching<sup>[1]</sup></span>,</div>\n  <div class=\"paragraph\">it is because they don't actually know how, and <span>since everyone gets paid anyway, they see no reason to fix it<sup>[2]</sup></span>.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Let us use, learning a photo editing program, as an example,</div>\n  <div class=\"paragraph\">today schools use multiple choice tests to asses the knowledge of a subject.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Instead of evaluating the students by for example asking them to create a fake photo,</div>\n  <div class=\"paragraph\">hide it among real photographs and let the class try to guess which is the fake one.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Schools use questions like, what is the purpose of image desaturation?</div>\n  <div class=\"paragraph\">A) making it sharper, B) making it lighter, C) all of the above, D) we're pretending to teach to take a paycheck home.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">I know that in a real image editing class, an actual program is used,</div>\n  <div class=\"paragraph\">but the photo editing program we are using here, is an analogy for mathematics, physics, chemistry, and biology.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">It is meant to demonstrate fake lectures,</div>\n  <div class=\"paragraph\">and matching ineffective tests, in serious subject.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">But even in a real photo editing class, the teachers still end up failing the students,</div>\n  <div class=\"paragraph\">because the real grade would have to be opening a successful photography business and making $100.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">This could be signing up with Unsplash, and using the site to become a Droneographer or a wedding photographer,</div>\n  <div class=\"paragraph\">see, just learning how to use a photo editing program is useless.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">The class must begin with photography, center around image editing,</div>\n  <div class=\"paragraph\">and passing all the students that now have a functional business.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Schools can't do this, because it would reveal them as ineffective,</div>\n  <div class=\"paragraph\">so as long as we are OK, with them being already ineffective, we are wasting our time, and the time of all the children.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Oh and by the, your kid is not supposed work Fast Food, or Retail,</div>\n  <div class=\"paragraph\">those are not jobs for the children that represent the Future of Human Kind.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Schools, actually could provide the students with 3 to 10 \"side projects\",</div>\n  <div class=\"paragraph\">a side project is a miniature business, that makes about a $100 a month.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">To return to our analogy for mathematics, physics, chemistry, and biology,</div>\n  <div class=\"paragraph\">these subjects are not being tested, the only thing that is tested here is the students ability to temporary memorize.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">This is fraud, math is actually quite testable,</div>\n  <div class=\"paragraph\">but since schools are not teaching, all the children would fail math on a real test.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">The math nerds, are not a vote for things working out sometimes,</div>\n  <div class=\"paragraph\">they are self taught, they learn about math, math history, and the underlying concepts on their own, they learn for real.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">The lectures are ineffective, the tests only test memorization and lying,</div>\n  <div class=\"paragraph\">and all the class really teaches is how to cram before a test, which works great for a factory job as well.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Imagine a factory, that would give its employees surprise college entry exams,</div>\n  <div class=\"paragraph\">about every month on average - what would that reveal about the employees, would they all continue passing the surprise tests?</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">I would guess,</div>\n  <div class=\"paragraph\">they would all fail with a low score.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">That is because they only retain what they learned for a few days,</div>\n  <div class=\"paragraph\">they aren't actually educated, they are memorizing.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Now, that I painted a certain picture for you,</div>\n  <div class=\"paragraph\">and let you make your own conclusions, lets fix this up.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Unfortunately I have to mention every step that led me to this architecture,</div>\n  <div class=\"paragraph\">and the first one is a little creepy, so lets just get it out of the way.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">In 1985 Orson Scott Card introduced the idea of a game like intelligence test,</div>\n  <div class=\"paragraph\">for Andrew \"Ender\" Wiggin, in his si-fi book Ender's Game.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">When I read the book, I already suspected that creating a game like educational experience,</div>\n  <div class=\"paragraph\">could be useful in real education.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">About a decade back, one of the science popularized released a game that dealt with space,</div>\n  <div class=\"paragraph\">and currently there is an a game entitled <span>Kerbal Space Program<sup>[3]</sup></span> that teachers Orbital Dynamics, this is by a different publisher.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">About eight years ago I came across the concept of <span>Gamemification, making serious things game like<sup>[4]</sup></span>,</div>\n  <div class=\"paragraph\">wikipedia describes it as:</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">\"Gamemification strategic attempt to enhance systems, services, organisations and activities,</div>\n  <div class=\"paragraph\">in order to create similar experiences to those experienced when playing games,</div>\n  <div class=\"paragraph\">in order to motivate and engage users.\"</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Let us pause here for a moment, and note that Kerbal Space Program like game,</div>\n  <div class=\"paragraph\">is a good example of a real test of knowledge of Mathematics, Physics, and Orbital Dynamics.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">The student fails an Orbital Dynamics lecture, if they are unable to put a simulated shuttle in earths orbit,</div>\n  <div class=\"paragraph\">this is a real test of real knowledge.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">The precise scenario the student will be presented will be random, it could be the sun's orbit,</div>\n  <div class=\"paragraph\">geo stationary orbit, or get a ship nearing mars into the martian orbit.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">There will be a series of tests and paid internships,</div>\n  <div class=\"paragraph\">that ends in working for NASA or ESA, or some private company.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">These organizations have a say in the tests that they require,</div>\n  <div class=\"paragraph\">the school will be influenced by industry seeking talent, and not politicians seeking re-elections.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">The student will see employment statistics,</div>\n  <div class=\"paragraph\">they will be able to make an informed decision about this particular job market.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Not everyone likes space things,</div>\n  <div class=\"paragraph\">space is a cold and dangerous place.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">We all had music class at some point,</div>\n  <div class=\"paragraph\">and many of us didn't realize that we could have a side job as a DJ, as a musician.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Music composition takes just a couple of days, if not hours,</div>\n  <div class=\"paragraph\">when taught right.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">The <span>children can't be taught musical notation, they have to be taught how to use lmms<sup>[5]</sup></span>,</div>\n  <div class=\"paragraph\">teaching children musical notation is fraud, musical notation is for people who are ready to study existing music.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Kids just want to compose at first, and they don't actually know the full picture of what they want,</div>\n  <div class=\"paragraph\">because their songs can make them money, just about all it takes is thinking of a song as six little songs ov varying complexity and instruments, they can upload that to bandcamp.com or similar.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">There would need to exist a music label for students, so that their music can get on spotify and the radio,</div>\n  <div class=\"paragraph\">I am sure there are many companies that would love to do that for free, passing on all the profits on students, if not one would be created for that purpose.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Of course in the music class of today,</div>\n  <div class=\"paragraph\">we are taught nonsense, and pushed along to memorize for the final and put it all behind us, in preparations for poverty resulting from unforgivable student loans.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Finally, before I looked at schools, I realized that Audio Books can help prison inmates a great deal,</div>\n  <div class=\"paragraph\">it is not possible to describe the importance of easy access to beautiful narrated books in prisons.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">I would ask celebrities, to specifically create a prison version of a narration,</div>\n  <div class=\"paragraph\">a separate narration from what is given to school students.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Some people aren't willing to read for high school kids,</div>\n  <div class=\"paragraph\">but would be greatly honored, and in fact greatly appreciated, if they narrated great books for inmates.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">This is so important,</div>\n  <div class=\"paragraph\">history will not look kindly at mass incarceration and legal slavery, they will not look kindly at our ignorance and arrogance, and failure to prevent children from becoming criminals.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">And here we arrive at an explanation of the very architecture,</div>\n  <div class=\"paragraph\">of the new school.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">There is no building, no rent, and no fraudulent moochers, or big fat white lice, not to mention spoiled lemons,</div>\n  <div class=\"paragraph\">that pretend to teach children.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Parent's don't get to use school as a convenient baby sitter,</div>\n  <div class=\"paragraph\">actually the stress of High School and College, exposes children to drugs, school is a pretty nasty baby sitter.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">A tablet, large, free to replace, open source Linux Tablet similar to the <span>PINETAB<sup>[6]</sup></span>,</div>\n  <div class=\"paragraph\">it presented to each student, there is a strong emphasis on socializing, and making friend in real life.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\"><span>But not behind the brick wall of a class room (trigger warning)<sup>[7]</sup></span>,</div>\n  <div class=\"paragraph\"><span>children are not inmates, they are not meant to sit in rows memorizing noise, so that the teacher can take their fraudulent paycheck home<sup>[8]</sup></span>.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">On the tablet there will be a series of programs, similar to the applications on the <span>OLPC XO<sup>[9]</sup></span>,</div>\n  <div class=\"paragraph\">but there will be one web application that will present a game like educational experience.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">The students will still have stats, points or grades, this is somewhat kind of, similar to the <span>Dark Souls Player Status<sup>[10]</sup></span>,</div>\n  <div class=\"paragraph\">but here we will see things related to education.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">So passing and re-testing the Orbital Dynamics class,</div>\n  <div class=\"paragraph\">will increase different stats, like math, physics, astrophysics.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">The student while still in school, will be asked to re-play the challenges,</div>\n  <div class=\"paragraph\">or games, that are used to refresh and refine their knowledge.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">To mention Kerbal Space Program again,</div>\n  <div class=\"paragraph\">students only need to learn how to get into the orbit once, the test are only there to help retain knowledge.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">This is a real school and a real education,</div>\n  <div class=\"paragraph\">that is architected in such a way that the students end up getting contracts for well paying jobs, when their stats are high enough to qualify.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">This is Real Education,</div>\n  <div class=\"paragraph\">and because the student chooses their own path, it also becomes really fun and respectful of their existing predispositions.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">The kids that get stuck with making music,</div>\n  <div class=\"paragraph\">are my favorite example.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Each school district will have a community of music makers,</div>\n  <div class=\"paragraph\">who don't want to get a job, because they already make a lot of money.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">The orbital dynamics class example I give here, requires a little bit more explanation,</div>\n  <div class=\"paragraph\">not all students that end up in the aerospace industry will begin with love for NASA.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Orbital Dynamics, is needed for several things, Generative Art Classes, Animation Classes, Computer Game Classes,</div>\n  <div class=\"paragraph\">whatever requires a decent knowledge of Netwon's calculus.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">So it is not just this Orbital Dynamics class,</div>\n  <div class=\"paragraph\">that pops up in a class list on their tablet.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">It is used by many courses,</div>\n  <div class=\"paragraph\">and what makes a course outstanding, is that it helps the student with making money.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Due to money being misunderstood,</div>\n  <div class=\"paragraph\">the world is cutting off the oxygen to its collective brain.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">The classes presented to the students have to help the out of poverty,</div>\n  <div class=\"paragraph\">Generative Art is about selling large beautiful canvas, with intricate high resolution computer art.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Some of those graphics, will be created by trails of objects that use Newton's Calculus,</div>\n  <div class=\"paragraph\">animation classes lead to a job in graphic arts, providing videos for advertising purposes, or as background to long winded poetry.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">And computer game classes, help the students sell apps, and games,</div>\n  <div class=\"paragraph\">here lmms is a good example, it helps a person compose in less than an hour, and there are game engines that won't require years of programming.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\"><span>Level design can be a big subject<sup>[11]</sup></span>,</div>\n  <div class=\"paragraph\">but a lot of players are a lot better at level design than they assume.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">The tools that are used for building the levels,</div>\n  <div class=\"paragraph\">are often part of the game, <span>it just makes sense to be within the walls of the game to make the levels more intricate<sup>[12]</sup></span>.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Some programming will be required, and that is the area that would call for Orbital Dynamics and Calculus,</div>\n  <div class=\"paragraph\">in a first person shooter the math would be related to animations, in a game like <span>asteroids<sup>[13]</sup></span> larger asteroids would attract the smaller ones with the force of gravity.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Graduation is about successfully learning something that results in pushing away poverty,</div>\n  <div class=\"paragraph\">in a perfect world education would be more pure, but in a world that misunderstood how to use money, money making must be taught in school.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Jut to repeat my opening remarks,</div>\n  <div class=\"paragraph\">schools shy away from real results and noble aims, because they don't know how to educate, they are a place where adults go to make money under the protection of a union and an ineffective cirricula.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Real school is a much more personal experience,</div>\n  <div class=\"paragraph\">and the access point is a computer tablet with Open Source software, where companies can't trick students into paying for what should be free.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">The removal of stress that students experience when they realize they are being forced to pretend to learn by memorization or fail the class,</div>\n  <div class=\"paragraph\">will already make a big difference.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Letting the students choose their own path,</div>\n  <div class=\"paragraph\">and creating paths that help students become financially independent, will take care of the rest.</div>\n</div>\n<div class=\"break-after\">&nbsp;</div>\n<div>\n  <div class=\"section\" style=\"padding-bottom: 1rem;\">References</div>\n  <div>[1]: https://www.youtube.com/watch?v=sxyKNMrhEvY</div>\n  <div>[2]: https://www.youtube.com/watch?v=5Hh6uHUx728</div>\n  <div>[3]: https://youtu.be/F0KiePxOuuc?t=294</div>\n  <div>[4]: https://en.wikipedia.org/wiki/Gamification</div>\n  <div>[5]: https://www.youtube.com/watch?v=0sRvkaxh8EU</div>\n  <div>[6]: https://www.pine64.org/pinetab/</div>\n  <div>[7]: https://www.youtube.com/watch?v=8vHzUTtmbAM</div>\n  <div>[8]: https://www.youtube.com/watch?v=fmoor8DwqW4</div>\n  <div>[9]: https://en.wikipedia.org/wiki/OLPC_XO</div>\n  <div>[10]: https://www.youtube.com/watch?v=FACg2r8OcF0</div>\n  <div>[11]: https://www.youtube.com/watch?v=zbtmAjhtPss</div>\n  <div>[12]: https://www.youtube.com/watch?v=kcREQzsS0Hc</div>\n  <div>[13]: https://www.youtube.com/watch?v=eLKudh3vvsU</div>\n</div>",
  "text": "Let me just open by hypothesizing why schools are not teaching[1],\nit is because they don't actually know how, and since everyone gets paid anyway, they see no reason to fix it[2].\n\nLet us use, learning a photo editing program, as an example,\ntoday schools use multiple choice tests to asses the knowledge of a subject.\nInstead of evaluating the students by for example asking them to create a fake photo,\nhide it among real photographs and let the class try to guess which is the fake one.\nSchools use questions like, what is the purpose of image desaturation?\nA) making it sharper, B) making it lighter, C) all of the above, D) we're pretending to teach to take a paycheck home.\nI know that in a real image editing class, an actual program is used,\nbut the photo editing program we are using here, is an analogy for mathematics, physics, chemistry, and biology.\nIt is meant to demonstrate fake lectures,\nand matching ineffective tests, in serious subject.\n\nBut even in a real photo editing class, the teachers still end up failing the students,\nbecause the real grade would have to be opening a successful photography business and making $100.\nThis could be signing up with Unsplash, and using the site to become a Droneographer or a wedding photographer,\nsee, just learning how to use a photo editing program is useless.\nThe class must begin with photography, center around image editing,\nand passing all the students that now have a functional business.\nSchools can't do this, because it would reveal them as ineffective,\nso as long as we are OK, with them being already ineffective, we are wasting our time, and the time of all the children.\nOh and by the, your kid is not supposed work Fast Food, or Retail,\nthose are not jobs for the children that represent the Future of Human Kind.\nSchools, actually could provide the students with 3 to 10 \"side projects\",\na side project is a miniature business, that makes about a $100 a month.\n\nTo return to our analogy for mathematics, physics, chemistry, and biology,\nthese subjects are not being tested, the only thing that is tested here is the students ability to temporary memorize.\nThis is fraud, math is actually quite testable,\nbut since schools are not teaching, all the children would fail math on a real test.\nThe math nerds, are not a vote for things working out sometimes,\nthey are self taught, they learn about math, math history, and the underlying concepts on their own, they learn for real.\nThe lectures are ineffective, the tests only test memorization and lying,\nand all the class really teaches is how to cram before a test, which works great for a factory job as well.\nImagine a factory, that would give its employees surprise college entry exams,\nabout every month on average - what would that reveal about the employees, would they all continue passing the surprise tests?\nI would guess,\nthey would all fail with a low score.\nThat is because they only retain what they learned for a few days,\nthey aren't actually educated, they are memorizing.\n\nNow, that I painted a certain picture for you,\nand let you make your own conclusions, lets fix this up.\n\nUnfortunately I have to mention every step that led me to this architecture,\nand the first one is a little creepy, so lets just get it out of the way.\nIn 1985 Orson Scott Card introduced the idea of a game like intelligence test,\nfor Andrew \"Ender\" Wiggin, in his si-fi book Ender's Game.\nWhen I read the book, I already suspected that creating a game like educational experience,\ncould be useful in real education.\nAbout a decade back, one of the science popularized released a game that dealt with space,\nand currently there is an a game entitled Kerbal Space Program[3] that teachers Orbital Dynamics, this is by a different publisher.\nAbout eight years ago I came across the concept of Gamemification, making serious things game like[4],\nwikipedia describes it as:\n\"Gamemification strategic attempt to enhance systems, services, organisations and activities,\nin order to create similar experiences to those experienced when playing games,\nin order to motivate and engage users.\"\n\nLet us pause here for a moment, and note that Kerbal Space Program like game,\nis a good example of a real test of knowledge of Mathematics, Physics, and Orbital Dynamics.\nThe student fails an Orbital Dynamics lecture, if they are unable to put a simulated shuttle in earths orbit,\nthis is a real test of real knowledge.\nThe precise scenario the student will be presented will be random, it could be the sun's orbit,\ngeo stationary orbit, or get a ship nearing mars into the martian orbit.\nThere will be a series of tests and paid internships,\nthat ends in working for NASA or ESA, or some private company.\nThese organizations have a say in the tests that they require,\nthe school will be influenced by industry seeking talent, and not politicians seeking re-elections.\nThe student will see employment statistics,\nthey will be able to make an informed decision about this particular job market.\n\nNot everyone likes space things,\nspace is a cold and dangerous place.\nWe all had music class at some point,\nand many of us didn't realize that we could have a side job as a DJ, as a musician.\nMusic composition takes just a couple of days, if not hours,\nwhen taught right.\nThe children can't be taught musical notation, they have to be taught how to use lmms[5],\nteaching children musical notation is fraud, musical notation is for people who are ready to study existing music.\nKids just want to compose at first, and they don't actually know the full picture of what they want,\nbecause their songs can make them money, just about all it takes is thinking of a song as six little songs ov varying complexity and instruments, they can upload that to bandcamp.com or similar.\nThere would need to exist a music label for students, so that their music can get on spotify and the radio,\nI am sure there are many companies that would love to do that for free, passing on all the profits on students, if not one would be created for that purpose.\nOf course in the music class of today,\nwe are taught nonsense, and pushed along to memorize for the final and put it all behind us, in preparations for poverty resulting from unforgivable student loans.\n\nFinally, before I looked at schools, I realized that Audio Books can help prison inmates a great deal,\nit is not possible to describe the importance of easy access to beautiful narrated books in prisons.\nI would ask celebrities, to specifically create a prison version of a narration,\na separate narration from what is given to school students.\nSome people aren't willing to read for high school kids,\nbut would be greatly honored, and in fact greatly appreciated, if they narrated great books for inmates.\nThis is so important,\nhistory will not look kindly at mass incarceration and legal slavery, they will not look kindly at our ignorance and arrogance, and failure to prevent children from becoming criminals.\n\nAnd here we arrive at an explanation of the very architecture,\nof the new school.\nThere is no building, no rent, and no fraudulent moochers, or big fat white lice, not to mention spoiled lemons,\nthat pretend to teach children.\nParent's don't get to use school as a convenient baby sitter,\nactually the stress of High School and College, exposes children to drugs, school is a pretty nasty baby sitter.\n\nA tablet, large, free to replace, open source Linux Tablet similar to the PINETAB[6],\nit presented to each student, there is a strong emphasis on socializing, and making friend in real life.\nBut not behind the brick wall of a class room (trigger warning)[7],\nchildren are not inmates, they are not meant to sit in rows memorizing noise, so that the teacher can take their fraudulent paycheck home[8].\nOn the tablet there will be a series of programs, similar to the applications on the OLPC XO[9],\nbut there will be one web application that will present a game like educational experience.\nThe students will still have stats, points or grades, this is somewhat kind of, similar to the Dark Souls Player Status[10],\nbut here we will see things related to education.\nSo passing and re-testing the Orbital Dynamics class,\nwill increase different stats, like math, physics, astrophysics.\nThe student while still in school, will be asked to re-play the challenges,\nor games, that are used to refresh and refine their knowledge.\nTo mention Kerbal Space Program again,\nstudents only need to learn how to get into the orbit once, the test are only there to help retain knowledge.\nThis is a real school and a real education,\nthat is architected in such a way that the students end up getting contracts for well paying jobs, when their stats are high enough to qualify.\nThis is Real Education,\nand because the student chooses their own path, it also becomes really fun and respectful of their existing predispositions.\nThe kids that get stuck with making music,\nare my favorite example.\nEach school district will have a community of music makers,\nwho don't want to get a job, because they already make a lot of money.\n\nThe orbital dynamics class example I give here, requires a little bit more explanation,\nnot all students that end up in the aerospace industry will begin with love for NASA.\nOrbital Dynamics, is needed for several things, Generative Art Classes, Animation Classes, Computer Game Classes,\nwhatever requires a decent knowledge of Netwon's calculus.\nSo it is not just this Orbital Dynamics class,\nthat pops up in a class list on their tablet.\nIt is used by many courses,\nand what makes a course outstanding, is that it helps the student with making money.\nDue to money being misunderstood,\nthe world is cutting off the oxygen to its collective brain.\nThe classes presented to the students have to help the out of poverty,\nGenerative Art is about selling large beautiful canvas, with intricate high resolution computer art.\nSome of those graphics, will be created by trails of objects that use Newton's Calculus,\nanimation classes lead to a job in graphic arts, providing videos for advertising purposes, or as background to long winded poetry.\nAnd computer game classes, help the students sell apps, and games,\nhere lmms is a good example, it helps a person compose in less than an hour, and there are game engines that won't require years of programming.\nLevel design can be a big subject[11],\nbut a lot of players are a lot better at level design than they assume.\nThe tools that are used for building the levels,\nare often part of the game, it just makes sense to be within the walls of the game to make the levels more intricate[12].\nSome programming will be required, and that is the area that would call for Orbital Dynamics and Calculus,\nin a first person shooter the math would be related to animations, in a game like asteroids[13] larger asteroids would attract the smaller ones with the force of gravity.\n\nGraduation is about successfully learning something that results in pushing away poverty,\nin a perfect world education would be more pure, but in a world that misunderstood how to use money, money making must be taught in school.\nJut to repeat my opening remarks,\nschools shy away from real results and noble aims, because they don't know how to educate, they are a place where adults go to make money under the protection of a union and an ineffective cirricula.\n\nReal school is a much more personal experience,\nand the access point is a computer tablet with Open Source software, where companies can't trick students into paying for what should be free.\nThe removal of stress that students experience when they realize they are being forced to pretend to learn by memorization or fail the class,\nwill already make a big difference.\nLetting the students choose their own path,\nand creating paths that help students become financially independent, will take care of the rest.\n\nReferences\n[1]: https://www.youtube.com/watch?v=sxyKNMrhEvY\n[2]: https://www.youtube.com/watch?v=5Hh6uHUx728\n[3]: https://youtu.be/F0KiePxOuuc?t=294\n[4]: https://en.wikipedia.org/wiki/Gamification\n[5]: https://www.youtube.com/watch?v=0sRvkaxh8EU\n[6]: https://www.pine64.org/pinetab/\n[7]: https://www.youtube.com/watch?v=8vHzUTtmbAM\n[8]: https://www.youtube.com/watch?v=fmoor8DwqW4\n[9]: https://en.wikipedia.org/wiki/OLPC_XO\n[10]: https://www.youtube.com/watch?v=FACg2r8OcF0\n[11]: https://www.youtube.com/watch?v=zbtmAjhtPss\n[12]: https://www.youtube.com/watch?v=kcREQzsS0Hc\n[13]: https://www.youtube.com/watch?v=eLKudh3vvsU",
  "images": [],
  "links": [
    {
      "title": "why schools are not teaching",
      "url": "https://www.youtube.com/watch?v=sxyKNMrhEvY",
      "hostname": "www.youtube.com"
    },
    {
      "title": "since everyone gets paid anyway, they see no reason to fix it",
      "url": "https://www.youtube.com/watch?v=5Hh6uHUx728",
      "hostname": "www.youtube.com"
    },
    {
      "title": "Kerbal Space Program",
      "url": "https://youtu.be/F0KiePxOuuc?t=294",
      "hostname": "youtu.be"
    },
    {
      "title": "Gamemification, making serious things game like",
      "url": "https://en.wikipedia.org/wiki/Gamification",
      "hostname": "en.wikipedia.org"
    },
    {
      "title": "children can't be taught musical notation, they have to be taught how to use lmms",
      "url": "https://www.youtube.com/watch?v=0sRvkaxh8EU",
      "hostname": "www.youtube.com"
    },
    {
      "title": "PINETAB",
      "url": "https://www.pine64.org/pinetab/",
      "hostname": "www.pine64.org"
    },
    {
      "title": "But not behind the brick wall of a class room (trigger warning)",
      "url": "https://www.youtube.com/watch?v=8vHzUTtmbAM",
      "hostname": "www.youtube.com"
    },
    {
      "title": "children are not inmates, they are not meant to sit in rows memorizing noise, so that the teacher can take their fraudulent paycheck home",
      "url": "https://www.youtube.com/watch?v=fmoor8DwqW4",
      "hostname": "www.youtube.com"
    },
    {
      "title": "OLPC XO",
      "url": "https://en.wikipedia.org/wiki/OLPC_XO",
      "hostname": "en.wikipedia.org"
    },
    {
      "title": "Dark Souls Player Status",
      "url": "https://www.youtube.com/watch?v=FACg2r8OcF0",
      "hostname": "www.youtube.com"
    },
    {
      "title": "Level design can be a big subject",
      "url": "https://www.youtube.com/watch?v=zbtmAjhtPss",
      "hostname": "www.youtube.com"
    },
    {
      "title": "it just makes sense to be within the walls of the game to make the levels more intricate",
      "url": "https://www.youtube.com/watch?v=kcREQzsS0Hc",
      "hostname": "www.youtube.com"
    },
    {
      "title": "asteroids",
      "url": "https://www.youtube.com/watch?v=eLKudh3vvsU",
      "hostname": "www.youtube.com"
    }
  ]
}