{
  "name": "furkies-purrkies-poetry-0547",
  "id": "furkies-purrkies-poetry-0547",
  "title": "Why Is The Teacher Being Mean To Me?",
  "date": "2021-08-29T23:17:39.468Z",
  "image": "poetry-0547-illustration.jpg",
  "artwork": "https://unsplash.com/photos/YZsvNs2GCPU",
  "audio": "poetry-0547.mp3",
  "guid": "3889a5fa-f81a-47db-ae57-d8f24254dcca",
  "html": "<div class=\"section\">\n  <p>First of all let me just say,<br>that schools are for you, the teachers are meant to help you, and not punish or scare you.</p>\n  <p>You are all the Hope and Dreams, and the future of this world,<br>your school does not belong to the principal, or the teachers, or even the state, or the wealthy.</p>\n  <p>It is yours,<br>it is a gift from history's greatest philosophers.</p>\n  <p>If you have a friend,<br>let them keep you company as you go to the principal's office and learn to stand up for justice.</p>\n  <p>All the power that the principal is imbued with,<br>depends on the fact that you feel safe, that you are growing stronger, and that you are truly learning.</p>\n  <p>Tell the principal that changes need to be made,<br>and that you demand an unconditional, and honest apology.</p>\n  <p>Because it is not their paychecks,<br>but your education, that is the point of the school you are in.</p>\n  <p>Tell them that next time, you won't be so easily pacified, and you will demand that the <a href=\"https://www.youtube.com/watch?v=5Hh6uHUx728\">lemon</a> is transferred early,<br>and each class begins showing real and practical results.</p>\n  <p>When you are done making promises to the principal,<br>begin learning to talk to the news.</p>\n  <p>Tell them that you think you are getting a fake education,<br>because nothing you are being taught shows any practical applications - and it does nothing to get you out of poverty.</p>\n  <p>Go to the Radio, TV station, and the still reputable newspapers, talk with whoever is there about the school being fake,<br>and the <a href=\"https://www.youtube.com/watch?v=8jsUj4DqWfU\">teachers doing as little as possible to just get paid</a>.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>It is a mistake for you to assume that you are too young to make demands like this,<br>it is actually your youth that opens the door for you to be heard.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>I have a theory as to what maybe driving your teacher to anger, to being unfair,<br>or even to <a href=\"https://www.youtube.com/watch?v=DzSnvxejenY\">purposefully manipulating your grades</a>, and it maybe a combination of poverty and indoctrination.</p>\n  <p>Even teachers that are very kind are blinded,<br>believing nonsense such as “we need grades to make the students work hard”.</p>\n  <p>To fully answer your question,<br>you have to understand how teachers and adults, and even teenagers, can have their minds clouded to act against their own and Humanity’s best interests.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Fundamentally, the teacher is confused because they lack answers,<br>they are scared, threatened by poverty, unable to get a good grasp on the meaning of education, and they have little grasp on the Human Condition.</p>\n  <p>Understand that growing up has nothing to do with aging,<br>it has to do with Knowledge and Wisdom, and where and how they are moving in life.</p>\n  <p>If all they are is older,<br>then your teachers are just aged and confused children who gave up on making sense of life.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Be it by choice, or by being tricked, or by desperation, the teacher is there to make money,<br>by what many assume is education.</p>\n  <p>But you are not getting an education,<br>your mind is being sold for years and years of paychecks.</p>\n  <p>Real education brings real results,<br>like the time when you were learning to read, or learning numbers and basic math.</p>\n  <p>This gave you the real ability,<br>to slowly read a book about philosophers.</p>\n  <p>Or to use your knowledge of numbers to step into the world of computer programming,<br>where all the calculations are automatically solved for you, and you instead create endless nested formulas.</p>\n  <p>Fake education, is that art class, that only made you hold color pencils,<br>and never taught you how to draw a realistic face, even though that is something that only requires a school or office projector to trace the outlines of a picture you took.</p>\n  <p>A fake class does not leave you with something that is useful at the end,<br>it give you the promise that things will connect but they never do.</p>\n  <p>More than mere promises, you are threatened with bad grades, repeating a class,<br>and then face the more long-term threats of bad GPA or not being able to get into college.</p>\n  <p>You are not just facing fake and corrupt education,<br>you are being tricked to accept it.</p>\n  <p>You may already be aware that you will be paying for college,<br>and you might have already accepted it.</p>\n  <p>Paying for a fake education,<br>is even worse than getting one for free, <a href=\"https://www.youtube.com/watch?v=8ve23i5K334\">it is a sign of getting indoctrinated into a fantasy lifestyle</a>.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Your parents are sending you to school,<br>because they are using school as a babysitter in hopes of controlling your behavior when they are not around.</p>\n  <p>They don’t want you at home alone,<br>because you don’t have enough experience in life to make the correct choices.</p>\n  <p>Usually when an adult is alone,<br>they take to self education, to a search for wisdom, or a search for adventure.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Adults understand that wisdom will protect them from being taken advantage of,<br>young people out of lack of experience, often take the opposite path.</p>\n  <p>The inexperienced will be enchanted by behaviors of movie characters, and celebrities,<br>by things like displays of anger, fist fighting, or drinking a beer.</p>\n  <p>Adults see this kind of behavior,<br>as mimicking stupid things.</p>\n  <p>Even so, paid fake education, fake classes,<br>still got the best of them, often they only see the basics.</p>\n  <p>They do not see the full effects that indoctrination has on them,<br>they may explain that money, politics and borders are required.</p>\n  <p>But they have no explanation for homeless camps, people dying from poverty,<br>mentally ill being thrown into prisons as punishment for their minds falling apart.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p><a href=\"https://en.wikipedia.org/wiki/Loevinger%27s_stages_of_ego_development\">Mimicry is actually normal part of early human development</a>,<br>but it is only healthy when you are surrounded by wise beings.</p>\n  <p>Due to poverty most people are surrounded by pleasant to consume media,<br>which presents a dumbed down, unrealistic personalities.</p>\n  <p>In extreme cases inexperienced people may also face a corrupt local culture,<br>that has evolved to take advantage of them.</p>\n  <p>Some cultures may present drug dealers, corrupt police or officials,<br>as good to the community.</p>\n  <p>In such cases mimicry is used to propagate a culture of crime,<br>in which schools of any kind of any quality are seen as the only way out of that cycle.</p>\n  <p>In most extreme cases, mimicry is exploited to the maximum,<br>and <a href=\"https://www.youtube.com/watch?v=IzZh2wstj88\">it becomes a component in a process of indoctrination</a>.</p>\n  <p>Indoctrination is not just used to propagate religions,<br>but also manufacture consent for various other terrible things.</p>\n  <p>Things like, human trafficking, military recruitment, propagation of misguided politics, the spreading of science denial,<br>and an entire array of subcultures that force human beings to blindly act against their self interests by disabling their judgment.</p>\n  <p>Depending on where you fall on this spectrum,<br>keeping you in school - however ineffective it may be - can increase your chances of not not having your mind hijacked.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>The terrible thing about indoctrination,<br>is that the victims can’t see that they are hijacked.</p>\n  <p>A boy selling drugs will think he is an independent thinker,<br>but not only is he a tool, his entire body of wisdom will be ripped out of him.</p>\n  <p>A deeply religious person will be pushed into slavery during their life,<br>under a promise of paradise after death - not realizing that life <em>is</em> the paradise.</p>\n  <p>Your teachers are also victims or indoctrination,<br>they believe that if they take the same steps everyone else is taking, then everything will work out.</p>\n  <p>But like the boy selling drugs, they are blindly participating,<br>in a fantasy existence.</p>\n  <p>Carter professionals who pushed Real Education, Wisdom, a Meaningful Relationship away for some promotion, or long therm goal that forces them to act against themselves,<br><a href=\"https://www.youtube.com/watch?v=hPSvdKTEZug\">often do not awaken from their bad judgment until they face some life threatening illness</a>.</p>\n  <p>And the entire world out of its own complexity,<br>has also indoctrinated it self into the concept of money.</p>\n  <p>Nobody intended to create a global state of poverty,<br>and force the world into acting against its best self interests.</p>\n  <p>And yet we are ignoring climate change, mass incarceration, fake education,<br>we are even tolerating starvation and homelessness in a world full of empty homes and stores that throw out food to keep their prices high.</p>\n  <p>Even beyond money, we use the concept of national borders,<br>a concept that has shown to induce war, weapons manufacturing, and keeping thousands of active nuclear weapons that are ready to destroy major cities around the world, under the already sick and and dangerously quickly eroding fantasy of Peace by means of Mutually Assured Destruction.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Adults will tell you that borders and money are how the world works,<br>the same way a cult member will recite their creed.</p>\n  <p>Just like a cult member, a victim of indoctrination, of fake education, of a fantasy existence,<br>they will only protest, unable to answer in any coherent way.</p>\n  <p>A victim of indoctrination, can only protect their false beliefs,<br><a href=\"https://www.youtube.com/watch?v=bVV2Zk88beY\">few will ever learn to see outside of themselves</a>.</p>\n  <p>The best way to defeat this vulnerability,<br>is to prevent it’s abuse in the first place.</p>\n  <p>And that can only be accomplished by means of real education,<br>effective education, one that has positive and life changing effects on the student.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Teachers will look you in the eyes and with their clouded mind,<br>will say there is nothing that can be done to change the world.</p>\n  <p>But are just ill, in that regard,<br>they are looking directly at the unbreakable force that has the power to change the world.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>School is not about them,<br>school is for you, because you are the Hope and the Dream.</p>\n  <p>Things got just tangled up,<br>because liars all too easily out compete authentic leaders.</p>\n  <p>That is why the teachers are unfair,<br>that is why you are not getting an education.</p>\n  <p>You are not getting a real education,<br>because the school you are going to is not a real school.</p>\n  <p>The teachers are not teaching you,<br>and your textbooks are not structured to properly present knowledge.</p>\n  <p>The layout of everything past middle school,<br>is artificially slowed down to put on a show and make the maximum amount of money.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Your teachers demand for obedience,<br>is a way to hide all the holes and cracks they are sensing but can’t fully grasp.</p>\n  <p>Your angry teacher is not fully aware that they are selling you out,<br>they will never admit to it, and will angrily resist.</p>\n  <p>The friendly teachers who don’t want to be part of any this,<br>will get transferred if they disrupt the process of your make believe education.</p>\n  <p>The other teachers who are there to make money,<br>will see them as eccentric and will reject anything they have to say.</p>\n  <p>The rebellious more self aware teachers, will either be transferred,<br>made to look like fools, or forced to betray you.</p>\n  <p>Those who participate in the system of replacing real education,<br>with an ineffective theatrical one that provides no results, are not your friends.</p>\n  <p>Your entire school, is a way of processing all the students,<br>into decades of paychecks out of desperation from poverty.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>In order to optimize this process,<br>everything is divided into semesters, classes, lectures and assignments.</p>\n  <p>This division lets the school process the maximum number of students,<br>while retaining state accreditation.</p>\n  <p>The state accreditation allows them to keep getting funding,<br>so that they can continue spreading the money among themselves.</p>\n  <p>The state test are influenced by politicians,<br>and they only <em>appear</em> to test knowledge.</p>\n  <p>Knowledge cannot be tested with pen and pencil,<br>the state tests, are just as big of a fantasy, as the school it self.</p>\n  <p>The state tests are an extension of ineffective and fake education,<br><a href=\"https://www.youtube.com/watch?v=8ve23i5K334\">if those tests were real all the students would fail them today</a>.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Nobody protests any of this,<br>because everyone is trying to get the diplomas anyway.</p>\n  <p>The High School and College diplomas,<br>promise to increase the probability of getting a good job.</p>\n  <p>Almost nobody drops out,<br>out of worries that they will not be able to get a job as an adult.</p>\n  <p>Without a job,<br>you can’t have an apartment, or a home, or put food on your table.</p>\n  <p><a href=\"https://www.youtube.com/watch?v=8ve23i5K334\">People with the fraudulent diplomas and now student debt</a>,<br>will eventually forget how fake the school was, and consider you are a loser.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>There is nothing you can say to the teacher,<br><a href=\"https://www.youtube.com/watch?v=8jsUj4DqWfU\">they will not understand you, they gave up on understanding</a>.</p>\n  <p>That is the full reason for their anger and unfairness,<br>they give up.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>You have to find your own education,<br>little one.</p>\n  <p>Book by book,<br>and narrated books are best.</p>\n  <p>Take a piece of paper and draw a concept map of the things you like,<br>and begin in the beginning, and don’t stop until you come to the end.</p>\n  <p>Your mind is unique,<br>there is a unique sequence of knowledge that you must follow.</p>\n  <p>You have to move at your own pace, in a sequence that matches you best,<br>during the time of day or night that you prefer.</p>\n  <p>Fake education means nothing to even a single authentic lesson,<br>and one book that helps you close to wisdom, can mean more than years of fake schooling.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Please be mindful of poverty,<br>always look to build a complete path from introduction to things that could make money, enough so that you don’t have to fear poverty, or hunger, or homelessness.</p>\n  <p>In your journeys <a href=\"https://www.youtube.com/watch?v=ZoqgAy3h4OM\">aim to become an independent business person</a>,<br>so that your life is not drained from you the way it has been drained from the teachers.</p>\n  <p>What Great Beings exist in the world today,<br>are on your side, and you are walking the same road.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>To help the other students who are like you,<br>to become aware of you...</p>\n  <p><a href=\"https://www.youtube.com/watch?v=0sRvkaxh8EU\">Learn lmms</a><br>and get your music, including workout music you can sell, up on the internet.</p>\n  <p><a href=\"https://www.youtube.com/watch?v=BXW0xgYNxlc\">Use a projector</a>,<br>along with <a href=\"https://www.youtube.com/watch?v=NK4Uo5QvH6M\">the little master painting techniques</a> to start selling people portraits.</p>\n  <p>And <a href=\"https://www.youtube.com/watch?v=gokN9xNG94U\">get a cheap 3D printer</a> to <a href=\"https://www.youtube.com/watch?v=TPrnSACiTJ4\">learn 3D modeling</a>,<br>so that you can prototype at home and sell jewelry online.</p>\n  <p>Build a database of simple brilliant real education things,<br>that help people stop being afraid of being trapped in poverty.</p>\n  <p><a href=\"https://www.youtube.com/watch?v=hPSvdKTEZug\">The real trap of poverty, is a regular job that will destroy your mental health</a>,<br>and get you on prescription drugs, so that you become a better employee.</p>\n  <p>Help your friends,<br>give them the tools that save them from the madness of poverty.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>If the teachers interrupt your education,<br>tell them them to stand aside because the school is for you.</p>\n  <p>If they try to force you by threatening you with failing grades, or repeating classes,<br>tell them that, <a href=\"https://www.youtube.com/watch?v=5Hh6uHUx728\">that kind of thing will only result the principal calling them a lemon and having them do a little dance for failure to teach</a>.</p>\n  <p>Don’t participate in fake education,<br>don’t pretend to learn by memorization, that only helps the leaches and hurts you across your entire lifetime.</p>\n  <p>“In any compromise between good and evil, it is only evil that can profit.”</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Don’t drop out,<br>you have to help the others.</p>\n  <p>The years ahead of you have been set aside for you to learn,<br>but do not go to school assuming that what happens there will teach you anything.</p>\n  <p>Above all,<br>don’t be alone.</p>\n  <p>Go to school, to help others understand what is going on,<br>help the students with bad grades to understand they aren’t stupid.</p>\n  <p>Tell them missing some prerequisites,<br>does not make a person stupid.</p>\n  <p>And that the fact that they didn’t realize that everyone was just memorizing,<br>actually makes them more beautiful.</p>\n  <p>And then help them,<br>help them to Narrated Books at the library.</p>\n  <p>If you can afford it,<br>get them a little mp3 player with Bill Bryson's A Short History Of Nearly Everything.</p>\n  <p>Just imagine them sitting in the back,<br>smiling and actually learning for real from Bryson - while the teacher is mindlessly babbling something,</p>\n  <p>And then begin building,<br>begin building an A-Team, The League Of Extraordinary Ladies And Gentlemen, The Justice League.</p>\n  <p>Bound by knowledge from the worlds most powerful narrated books,<br>equipped with Maker spaces, Hacker spaces, and Fab Labs, that get a kid to go from poverty to selling online with little more than a 3D printer and some Open Source Software.</p>\n  <p>Find a way to build real schools, to save the tigers, to teach the world about all the wrong doings, and how it all leads to poverty and war.</p>\n  <p>Help your crew become Real Teachers, Powerful Artists, Heartbreaking Orators, Hackers, Makers, Polymaths, Authentic Leaders, and Great Beings fueled by Great Wisdom and Vast Knowledge.</p>\n  <p>Make it so that when our generation comes to an end,<br>yours will bring on a lasting global culture of Restraint, Dignity, Nobility, Unbreakability, Fortitude, Courage, Honor, Love;<br>and Insight; and Foresight; and Understanding; and Authenticity; and Great Heroism.</p>\n</div>",
  "bootstrap": "<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">First of all let me just say,<br>that schools are for you, the teachers are meant to help you, and not punish or scare you.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">You are all the Hope and Dreams, and the future of this world,<br>your school does not belong to the principal, or the teachers, or even the state, or the wealthy.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">It is yours,<br>it is a gift from history's greatest philosophers.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">If you have a friend,<br>let them keep you company as you go to the principal's office and learn to stand up for justice.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">All the power that the principal is imbued with,<br>depends on the fact that you feel safe, that you are growing stronger, and that you are truly learning.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Tell the principal that changes need to be made,<br>and that you demand an unconditional, and honest apology.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Because it is not their paychecks,<br>but your education, that is the point of the school you are in.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Tell them that next time, you won't be so easily pacified, and you will demand that the <a href=\"https://www.youtube.com/watch?v=5Hh6uHUx728\">lemon</a> is transferred early,<br>and each class begins showing real and practical results.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">When you are done making promises to the principal,<br>begin learning to talk to the news.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Tell them that you think you are getting a fake education,<br>because nothing you are being taught shows any practical applications - and it does nothing to get you out of poverty.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Go to the Radio, TV station, and the still reputable newspapers, talk with whoever is there about the school being fake,<br>and the <a href=\"https://www.youtube.com/watch?v=8jsUj4DqWfU\">teachers doing as little as possible to just get paid</a>.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">It is a mistake for you to assume that you are too young to make demands like this,<br>it is actually your youth that opens the door for you to be heard.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I have a theory as to what maybe driving your teacher to anger, to being unfair,<br>or even to <a href=\"https://www.youtube.com/watch?v=DzSnvxejenY\">purposefully manipulating your grades</a>, and it maybe a combination of poverty and indoctrination.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Even teachers that are very kind are blinded,<br>believing nonsense such as “we need grades to make the students work hard”.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">To fully answer your question,<br>you have to understand how teachers and adults, and even teenagers, can have their minds clouded to act against their own and Humanity’s best interests.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Fundamentally, the teacher is confused because they lack answers,<br>they are scared, threatened by poverty, unable to get a good grasp on the meaning of education, and they have little grasp on the Human Condition.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Understand that growing up has nothing to do with aging,<br>it has to do with Knowledge and Wisdom, and where and how they are moving in life.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">If all they are is older,<br>then your teachers are just aged and confused children who gave up on making sense of life.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Be it by choice, or by being tricked, or by desperation, the teacher is there to make money,<br>by what many assume is education.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">But you are not getting an education,<br>your mind is being sold for years and years of paychecks.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Real education brings real results,<br>like the time when you were learning to read, or learning numbers and basic math.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">This gave you the real ability,<br>to slowly read a book about philosophers.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Or to use your knowledge of numbers to step into the world of computer programming,<br>where all the calculations are automatically solved for you, and you instead create endless nested formulas.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Fake education, is that art class, that only made you hold color pencils,<br>and never taught you how to draw a realistic face, even though that is something that only requires a school or office projector to trace the outlines of a picture you took.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">A fake class does not leave you with something that is useful at the end,<br>it give you the promise that things will connect but they never do.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">More than mere promises, you are threatened with bad grades, repeating a class,<br>and then face the more long-term threats of bad GPA or not being able to get into college.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">You are not just facing fake and corrupt education,<br>you are being tricked to accept it.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">You may already be aware that you will be paying for college,<br>and you might have already accepted it.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Paying for a fake education,<br>is even worse than getting one for free, <a href=\"https://www.youtube.com/watch?v=8ve23i5K334\">it is a sign of getting indoctrinated into a fantasy lifestyle</a>.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Your parents are sending you to school,<br>because they are using school as a babysitter in hopes of controlling your behavior when they are not around.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">They don’t want you at home alone,<br>because you don’t have enough experience in life to make the correct choices.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Usually when an adult is alone,<br>they take to self education, to a search for wisdom, or a search for adventure.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Adults understand that wisdom will protect them from being taken advantage of,<br>young people out of lack of experience, often take the opposite path.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The inexperienced will be enchanted by behaviors of movie characters, and celebrities,<br>by things like displays of anger, fist fighting, or drinking a beer.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Adults see this kind of behavior,<br>as mimicking stupid things.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Even so, paid fake education, fake classes,<br>still got the best of them, often they only see the basics.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">They do not see the full effects that indoctrination has on them,<br>they may explain that money, politics and borders are required.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">But they have no explanation for homeless camps, people dying from poverty,<br>mentally ill being thrown into prisons as punishment for their minds falling apart.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\"><a href=\"https://en.wikipedia.org/wiki/Loevinger%27s_stages_of_ego_development\">Mimicry is actually normal part of early human development</a>,<br>but it is only healthy when you are surrounded by wise beings.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Due to poverty most people are surrounded by pleasant to consume media,<br>which presents a dumbed down, unrealistic personalities.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">In extreme cases inexperienced people may also face a corrupt local culture,<br>that has evolved to take advantage of them.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Some cultures may present drug dealers, corrupt police or officials,<br>as good to the community.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">In such cases mimicry is used to propagate a culture of crime,<br>in which schools of any kind of any quality are seen as the only way out of that cycle.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">In most extreme cases, mimicry is exploited to the maximum,<br>and <a href=\"https://www.youtube.com/watch?v=IzZh2wstj88\">it becomes a component in a process of indoctrination</a>.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Indoctrination is not just used to propagate religions,<br>but also manufacture consent for various other terrible things.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Things like, human trafficking, military recruitment, propagation of misguided politics, the spreading of science denial,<br>and an entire array of subcultures that force human beings to blindly act against their self interests by disabling their judgment.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Depending on where you fall on this spectrum,<br>keeping you in school - however ineffective it may be - can increase your chances of not not having your mind hijacked.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The terrible thing about indoctrination,<br>is that the victims can’t see that they are hijacked.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">A boy selling drugs will think he is an independent thinker,<br>but not only is he a tool, his entire body of wisdom will be ripped out of him.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">A deeply religious person will be pushed into slavery during their life,<br>under a promise of paradise after death - not realizing that life <em>is</em> the paradise.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Your teachers are also victims or indoctrination,<br>they believe that if they take the same steps everyone else is taking, then everything will work out.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">But like the boy selling drugs, they are blindly participating,<br>in a fantasy existence.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Carter professionals who pushed Real Education, Wisdom, a Meaningful Relationship away for some promotion, or long therm goal that forces them to act against themselves,<br><a href=\"https://www.youtube.com/watch?v=hPSvdKTEZug\">often do not awaken from their bad judgment until they face some life threatening illness</a>.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">And the entire world out of its own complexity,<br>has also indoctrinated it self into the concept of money.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Nobody intended to create a global state of poverty,<br>and force the world into acting against its best self interests.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">And yet we are ignoring climate change, mass incarceration, fake education,<br>we are even tolerating starvation and homelessness in a world full of empty homes and stores that throw out food to keep their prices high.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Even beyond money, we use the concept of national borders,<br>a concept that has shown to induce war, weapons manufacturing, and keeping thousands of active nuclear weapons that are ready to destroy major cities around the world, under the already sick and and dangerously quickly eroding fantasy of Peace by means of Mutually Assured Destruction.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Adults will tell you that borders and money are how the world works,<br>the same way a cult member will recite their creed.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Just like a cult member, a victim of indoctrination, of fake education, of a fantasy existence,<br>they will only protest, unable to answer in any coherent way.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">A victim of indoctrination, can only protect their false beliefs,<br><a href=\"https://www.youtube.com/watch?v=bVV2Zk88beY\">few will ever learn to see outside of themselves</a>.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The best way to defeat this vulnerability,<br>is to prevent it’s abuse in the first place.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">And that can only be accomplished by means of real education,<br>effective education, one that has positive and life changing effects on the student.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Teachers will look you in the eyes and with their clouded mind,<br>will say there is nothing that can be done to change the world.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">But are just ill, in that regard,<br>they are looking directly at the unbreakable force that has the power to change the world.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">School is not about them,<br>school is for you, because you are the Hope and the Dream.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Things got just tangled up,<br>because liars all too easily out compete authentic leaders.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">That is why the teachers are unfair,<br>that is why you are not getting an education.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">You are not getting a real education,<br>because the school you are going to is not a real school.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The teachers are not teaching you,<br>and your textbooks are not structured to properly present knowledge.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The layout of everything past middle school,<br>is artificially slowed down to put on a show and make the maximum amount of money.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Your teachers demand for obedience,<br>is a way to hide all the holes and cracks they are sensing but can’t fully grasp.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Your angry teacher is not fully aware that they are selling you out,<br>they will never admit to it, and will angrily resist.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The friendly teachers who don’t want to be part of any this,<br>will get transferred if they disrupt the process of your make believe education.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The other teachers who are there to make money,<br>will see them as eccentric and will reject anything they have to say.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The rebellious more self aware teachers, will either be transferred,<br>made to look like fools, or forced to betray you.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Those who participate in the system of replacing real education,<br>with an ineffective theatrical one that provides no results, are not your friends.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Your entire school, is a way of processing all the students,<br>into decades of paychecks out of desperation from poverty.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">In order to optimize this process,<br>everything is divided into semesters, classes, lectures and assignments.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">This division lets the school process the maximum number of students,<br>while retaining state accreditation.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The state accreditation allows them to keep getting funding,<br>so that they can continue spreading the money among themselves.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The state test are influenced by politicians,<br>and they only <em>appear</em> to test knowledge.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Knowledge cannot be tested with pen and pencil,<br>the state tests, are just as big of a fantasy, as the school it self.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The state tests are an extension of ineffective and fake education,<br><a href=\"https://www.youtube.com/watch?v=8ve23i5K334\">if those tests were real all the students would fail them today</a>.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Nobody protests any of this,<br>because everyone is trying to get the diplomas anyway.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The High School and College diplomas,<br>promise to increase the probability of getting a good job.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Almost nobody drops out,<br>out of worries that they will not be able to get a job as an adult.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Without a job,<br>you can’t have an apartment, or a home, or put food on your table.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\"><a href=\"https://www.youtube.com/watch?v=8ve23i5K334\">People with the fraudulent diplomas and now student debt</a>,<br>will eventually forget how fake the school was, and consider you are a loser.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">There is nothing you can say to the teacher,<br><a href=\"https://www.youtube.com/watch?v=8jsUj4DqWfU\">they will not understand you, they gave up on understanding</a>.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">That is the full reason for their anger and unfairness,<br>they give up.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">You have to find your own education,<br>little one.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Book by book,<br>and narrated books are best.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Take a piece of paper and draw a concept map of the things you like,<br>and begin in the beginning, and don’t stop until you come to the end.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Your mind is unique,<br>there is a unique sequence of knowledge that you must follow.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">You have to move at your own pace, in a sequence that matches you best,<br>during the time of day or night that you prefer.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Fake education means nothing to even a single authentic lesson,<br>and one book that helps you close to wisdom, can mean more than years of fake schooling.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Please be mindful of poverty,<br>always look to build a complete path from introduction to things that could make money, enough so that you don’t have to fear poverty, or hunger, or homelessness.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">In your journeys <a href=\"https://www.youtube.com/watch?v=ZoqgAy3h4OM\">aim to become an independent business person</a>,<br>so that your life is not drained from you the way it has been drained from the teachers.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">What Great Beings exist in the world today,<br>are on your side, and you are walking the same road.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">To help the other students who are like you,<br>to become aware of you...</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\"><a href=\"https://www.youtube.com/watch?v=0sRvkaxh8EU\">Learn lmms</a><br>and get your music, including workout music you can sell, up on the internet.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\"><a href=\"https://www.youtube.com/watch?v=BXW0xgYNxlc\">Use a projector</a>,<br>along with <a href=\"https://www.youtube.com/watch?v=NK4Uo5QvH6M\">the little master painting techniques</a> to start selling people portraits.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">And <a href=\"https://www.youtube.com/watch?v=gokN9xNG94U\">get a cheap 3D printer</a> to <a href=\"https://www.youtube.com/watch?v=TPrnSACiTJ4\">learn 3D modeling</a>,<br>so that you can prototype at home and sell jewelry online.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Build a database of simple brilliant real education things,<br>that help people stop being afraid of being trapped in poverty.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\"><a href=\"https://www.youtube.com/watch?v=hPSvdKTEZug\">The real trap of poverty, is a regular job that will destroy your mental health</a>,<br>and get you on prescription drugs, so that you become a better employee.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Help your friends,<br>give them the tools that save them from the madness of poverty.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">If the teachers interrupt your education,<br>tell them them to stand aside because the school is for you.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">If they try to force you by threatening you with failing grades, or repeating classes,<br>tell them that, <a href=\"https://www.youtube.com/watch?v=5Hh6uHUx728\">that kind of thing will only result the principal calling them a lemon and having them do a little dance for failure to teach</a>.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Don’t participate in fake education,<br>don’t pretend to learn by memorization, that only helps the leaches and hurts you across your entire lifetime.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">“In any compromise between good and evil, it is only evil that can profit.”</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Don’t drop out,<br>you have to help the others.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The years ahead of you have been set aside for you to learn,<br>but do not go to school assuming that what happens there will teach you anything.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Above all,<br>don’t be alone.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Go to school, to help others understand what is going on,<br>help the students with bad grades to understand they aren’t stupid.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Tell them missing some prerequisites,<br>does not make a person stupid.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">And that the fact that they didn’t realize that everyone was just memorizing,<br>actually makes them more beautiful.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">And then help them,<br>help them to Narrated Books at the library.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">If you can afford it,<br>get them a little mp3 player with Bill Bryson's A Short History Of Nearly Everything.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Just imagine them sitting in the back,<br>smiling and actually learning for real from Bryson - while the teacher is mindlessly babbling something,</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">And then begin building,<br>begin building an A-Team, The League Of Extraordinary Ladies And Gentlemen, The Justice League.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Bound by knowledge from the worlds most powerful narrated books,<br>equipped with Maker spaces, Hacker spaces, and Fab Labs, that get a kid to go from poverty to selling online with little more than a 3D printer and some Open Source Software.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Find a way to build real schools, to save the tigers, to teach the world about all the wrong doings, and how it all leads to poverty and war.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Help your crew become Real Teachers, Powerful Artists, Heartbreaking Orators, Hackers, Makers, Polymaths, Authentic Leaders, and Great Beings fueled by Great Wisdom and Vast Knowledge.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Make it so that when our generation comes to an end,<br>yours will bring on a lasting global culture of Restraint, Dignity, Nobility, Unbreakability, Fortitude, Courage, Honor, Love;<br>and Insight; and Foresight; and Understanding; and Authenticity; and Great Heroism.</div>\n  </div>\n</div>",
  "print": "<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">First of all let me just say,<br>that schools are for you, the teachers are meant to help you, and not punish or scare you.</div>\n  <div class=\"paragraph\">You are all the Hope and Dreams, and the future of this world,<br>your school does not belong to the principal, or the teachers, or even the state, or the wealthy.</div>\n  <div class=\"paragraph\">It is yours,<br>it is a gift from history's greatest philosophers.</div>\n  <div class=\"paragraph\">If you have a friend,<br>let them keep you company as you go to the principal's office and learn to stand up for justice.</div>\n  <div class=\"paragraph\">All the power that the principal is imbued with,<br>depends on the fact that you feel safe, that you are growing stronger, and that you are truly learning.</div>\n  <div class=\"paragraph\">Tell the principal that changes need to be made,<br>and that you demand an unconditional, and honest apology.</div>\n  <div class=\"paragraph\">Because it is not their paychecks,<br>but your education, that is the point of the school you are in.</div>\n  <div class=\"paragraph\">Tell them that next time, you won't be so easily pacified, and you will demand that the <span>lemon<sup>[1]</sup></span> is transferred early,<br>and each class begins showing real and practical results.</div>\n  <div class=\"paragraph\">When you are done making promises to the principal,<br>begin learning to talk to the news.</div>\n  <div class=\"paragraph\">Tell them that you think you are getting a fake education,<br>because nothing you are being taught shows any practical applications - and it does nothing to get you out of poverty.</div>\n  <div class=\"paragraph\">Go to the Radio, TV station, and the still reputable newspapers, talk with whoever is there about the school being fake,<br>and the <span>teachers doing as little as possible to just get paid<sup>[2]</sup></span>.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">It is a mistake for you to assume that you are too young to make demands like this,<br>it is actually your youth that opens the door for you to be heard.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">I have a theory as to what maybe driving your teacher to anger, to being unfair,<br>or even to <span>purposefully manipulating your grades<sup>[3]</sup></span>, and it maybe a combination of poverty and indoctrination.</div>\n  <div class=\"paragraph\">Even teachers that are very kind are blinded,<br>believing nonsense such as “we need grades to make the students work hard”.</div>\n  <div class=\"paragraph\">To fully answer your question,<br>you have to understand how teachers and adults, and even teenagers, can have their minds clouded to act against their own and Humanity’s best interests.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Fundamentally, the teacher is confused because they lack answers,<br>they are scared, threatened by poverty, unable to get a good grasp on the meaning of education, and they have little grasp on the Human Condition.</div>\n  <div class=\"paragraph\">Understand that growing up has nothing to do with aging,<br>it has to do with Knowledge and Wisdom, and where and how they are moving in life.</div>\n  <div class=\"paragraph\">If all they are is older,<br>then your teachers are just aged and confused children who gave up on making sense of life.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Be it by choice, or by being tricked, or by desperation, the teacher is there to make money,<br>by what many assume is education.</div>\n  <div class=\"paragraph\">But you are not getting an education,<br>your mind is being sold for years and years of paychecks.</div>\n  <div class=\"paragraph\">Real education brings real results,<br>like the time when you were learning to read, or learning numbers and basic math.</div>\n  <div class=\"paragraph\">This gave you the real ability,<br>to slowly read a book about philosophers.</div>\n  <div class=\"paragraph\">Or to use your knowledge of numbers to step into the world of computer programming,<br>where all the calculations are automatically solved for you, and you instead create endless nested formulas.</div>\n  <div class=\"paragraph\">Fake education, is that art class, that only made you hold color pencils,<br>and never taught you how to draw a realistic face, even though that is something that only requires a school or office projector to trace the outlines of a picture you took.</div>\n  <div class=\"paragraph\">A fake class does not leave you with something that is useful at the end,<br>it give you the promise that things will connect but they never do.</div>\n  <div class=\"paragraph\">More than mere promises, you are threatened with bad grades, repeating a class,<br>and then face the more long-term threats of bad GPA or not being able to get into college.</div>\n  <div class=\"paragraph\">You are not just facing fake and corrupt education,<br>you are being tricked to accept it.</div>\n  <div class=\"paragraph\">You may already be aware that you will be paying for college,<br>and you might have already accepted it.</div>\n  <div class=\"paragraph\">Paying for a fake education,<br>is even worse than getting one for free, <span>it is a sign of getting indoctrinated into a fantasy lifestyle<sup>[4]</sup></span>.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Your parents are sending you to school,<br>because they are using school as a babysitter in hopes of controlling your behavior when they are not around.</div>\n  <div class=\"paragraph\">They don’t want you at home alone,<br>because you don’t have enough experience in life to make the correct choices.</div>\n  <div class=\"paragraph\">Usually when an adult is alone,<br>they take to self education, to a search for wisdom, or a search for adventure.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Adults understand that wisdom will protect them from being taken advantage of,<br>young people out of lack of experience, often take the opposite path.</div>\n  <div class=\"paragraph\">The inexperienced will be enchanted by behaviors of movie characters, and celebrities,<br>by things like displays of anger, fist fighting, or drinking a beer.</div>\n  <div class=\"paragraph\">Adults see this kind of behavior,<br>as mimicking stupid things.</div>\n  <div class=\"paragraph\">Even so, paid fake education, fake classes,<br>still got the best of them, often they only see the basics.</div>\n  <div class=\"paragraph\">They do not see the full effects that indoctrination has on them,<br>they may explain that money, politics and borders are required.</div>\n  <div class=\"paragraph\">But they have no explanation for homeless camps, people dying from poverty,<br>mentally ill being thrown into prisons as punishment for their minds falling apart.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\"><span>Mimicry is actually normal part of early human development<sup>[5]</sup></span>,<br>but it is only healthy when you are surrounded by wise beings.</div>\n  <div class=\"paragraph\">Due to poverty most people are surrounded by pleasant to consume media,<br>which presents a dumbed down, unrealistic personalities.</div>\n  <div class=\"paragraph\">In extreme cases inexperienced people may also face a corrupt local culture,<br>that has evolved to take advantage of them.</div>\n  <div class=\"paragraph\">Some cultures may present drug dealers, corrupt police or officials,<br>as good to the community.</div>\n  <div class=\"paragraph\">In such cases mimicry is used to propagate a culture of crime,<br>in which schools of any kind of any quality are seen as the only way out of that cycle.</div>\n  <div class=\"paragraph\">In most extreme cases, mimicry is exploited to the maximum,<br>and <span>it becomes a component in a process of indoctrination<sup>[6]</sup></span>.</div>\n  <div class=\"paragraph\">Indoctrination is not just used to propagate religions,<br>but also manufacture consent for various other terrible things.</div>\n  <div class=\"paragraph\">Things like, human trafficking, military recruitment, propagation of misguided politics, the spreading of science denial,<br>and an entire array of subcultures that force human beings to blindly act against their self interests by disabling their judgment.</div>\n  <div class=\"paragraph\">Depending on where you fall on this spectrum,<br>keeping you in school - however ineffective it may be - can increase your chances of not not having your mind hijacked.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">The terrible thing about indoctrination,<br>is that the victims can’t see that they are hijacked.</div>\n  <div class=\"paragraph\">A boy selling drugs will think he is an independent thinker,<br>but not only is he a tool, his entire body of wisdom will be ripped out of him.</div>\n  <div class=\"paragraph\">A deeply religious person will be pushed into slavery during their life,<br>under a promise of paradise after death - not realizing that life <em>is</em> the paradise.</div>\n  <div class=\"paragraph\">Your teachers are also victims or indoctrination,<br>they believe that if they take the same steps everyone else is taking, then everything will work out.</div>\n  <div class=\"paragraph\">But like the boy selling drugs, they are blindly participating,<br>in a fantasy existence.</div>\n  <div class=\"paragraph\">Carter professionals who pushed Real Education, Wisdom, a Meaningful Relationship away for some promotion, or long therm goal that forces them to act against themselves,<br><span>often do not awaken from their bad judgment until they face some life threatening illness<sup>[7]</sup></span>.</div>\n  <div class=\"paragraph\">And the entire world out of its own complexity,<br>has also indoctrinated it self into the concept of money.</div>\n  <div class=\"paragraph\">Nobody intended to create a global state of poverty,<br>and force the world into acting against its best self interests.</div>\n  <div class=\"paragraph\">And yet we are ignoring climate change, mass incarceration, fake education,<br>we are even tolerating starvation and homelessness in a world full of empty homes and stores that throw out food to keep their prices high.</div>\n  <div class=\"paragraph\">Even beyond money, we use the concept of national borders,<br>a concept that has shown to induce war, weapons manufacturing, and keeping thousands of active nuclear weapons that are ready to destroy major cities around the world, under the already sick and and dangerously quickly eroding fantasy of Peace by means of Mutually Assured Destruction.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Adults will tell you that borders and money are how the world works,<br>the same way a cult member will recite their creed.</div>\n  <div class=\"paragraph\">Just like a cult member, a victim of indoctrination, of fake education, of a fantasy existence,<br>they will only protest, unable to answer in any coherent way.</div>\n  <div class=\"paragraph\">A victim of indoctrination, can only protect their false beliefs,<br><span>few will ever learn to see outside of themselves<sup>[8]</sup></span>.</div>\n  <div class=\"paragraph\">The best way to defeat this vulnerability,<br>is to prevent it’s abuse in the first place.</div>\n  <div class=\"paragraph\">And that can only be accomplished by means of real education,<br>effective education, one that has positive and life changing effects on the student.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Teachers will look you in the eyes and with their clouded mind,<br>will say there is nothing that can be done to change the world.</div>\n  <div class=\"paragraph\">But are just ill, in that regard,<br>they are looking directly at the unbreakable force that has the power to change the world.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">School is not about them,<br>school is for you, because you are the Hope and the Dream.</div>\n  <div class=\"paragraph\">Things got just tangled up,<br>because liars all too easily out compete authentic leaders.</div>\n  <div class=\"paragraph\">That is why the teachers are unfair,<br>that is why you are not getting an education.</div>\n  <div class=\"paragraph\">You are not getting a real education,<br>because the school you are going to is not a real school.</div>\n  <div class=\"paragraph\">The teachers are not teaching you,<br>and your textbooks are not structured to properly present knowledge.</div>\n  <div class=\"paragraph\">The layout of everything past middle school,<br>is artificially slowed down to put on a show and make the maximum amount of money.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Your teachers demand for obedience,<br>is a way to hide all the holes and cracks they are sensing but can’t fully grasp.</div>\n  <div class=\"paragraph\">Your angry teacher is not fully aware that they are selling you out,<br>they will never admit to it, and will angrily resist.</div>\n  <div class=\"paragraph\">The friendly teachers who don’t want to be part of any this,<br>will get transferred if they disrupt the process of your make believe education.</div>\n  <div class=\"paragraph\">The other teachers who are there to make money,<br>will see them as eccentric and will reject anything they have to say.</div>\n  <div class=\"paragraph\">The rebellious more self aware teachers, will either be transferred,<br>made to look like fools, or forced to betray you.</div>\n  <div class=\"paragraph\">Those who participate in the system of replacing real education,<br>with an ineffective theatrical one that provides no results, are not your friends.</div>\n  <div class=\"paragraph\">Your entire school, is a way of processing all the students,<br>into decades of paychecks out of desperation from poverty.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">In order to optimize this process,<br>everything is divided into semesters, classes, lectures and assignments.</div>\n  <div class=\"paragraph\">This division lets the school process the maximum number of students,<br>while retaining state accreditation.</div>\n  <div class=\"paragraph\">The state accreditation allows them to keep getting funding,<br>so that they can continue spreading the money among themselves.</div>\n  <div class=\"paragraph\">The state test are influenced by politicians,<br>and they only <em>appear</em> to test knowledge.</div>\n  <div class=\"paragraph\">Knowledge cannot be tested with pen and pencil,<br>the state tests, are just as big of a fantasy, as the school it self.</div>\n  <div class=\"paragraph\">The state tests are an extension of ineffective and fake education,<br><span>if those tests were real all the students would fail them today<sup>[9]</sup></span>.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Nobody protests any of this,<br>because everyone is trying to get the diplomas anyway.</div>\n  <div class=\"paragraph\">The High School and College diplomas,<br>promise to increase the probability of getting a good job.</div>\n  <div class=\"paragraph\">Almost nobody drops out,<br>out of worries that they will not be able to get a job as an adult.</div>\n  <div class=\"paragraph\">Without a job,<br>you can’t have an apartment, or a home, or put food on your table.</div>\n  <div class=\"paragraph\"><span>People with the fraudulent diplomas and now student debt<sup>[10]</sup></span>,<br>will eventually forget how fake the school was, and consider you are a loser.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">There is nothing you can say to the teacher,<br><span>they will not understand you, they gave up on understanding<sup>[11]</sup></span>.</div>\n  <div class=\"paragraph\">That is the full reason for their anger and unfairness,<br>they give up.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">You have to find your own education,<br>little one.</div>\n  <div class=\"paragraph\">Book by book,<br>and narrated books are best.</div>\n  <div class=\"paragraph\">Take a piece of paper and draw a concept map of the things you like,<br>and begin in the beginning, and don’t stop until you come to the end.</div>\n  <div class=\"paragraph\">Your mind is unique,<br>there is a unique sequence of knowledge that you must follow.</div>\n  <div class=\"paragraph\">You have to move at your own pace, in a sequence that matches you best,<br>during the time of day or night that you prefer.</div>\n  <div class=\"paragraph\">Fake education means nothing to even a single authentic lesson,<br>and one book that helps you close to wisdom, can mean more than years of fake schooling.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Please be mindful of poverty,<br>always look to build a complete path from introduction to things that could make money, enough so that you don’t have to fear poverty, or hunger, or homelessness.</div>\n  <div class=\"paragraph\">In your journeys <span>aim to become an independent business person<sup>[12]</sup></span>,<br>so that your life is not drained from you the way it has been drained from the teachers.</div>\n  <div class=\"paragraph\">What Great Beings exist in the world today,<br>are on your side, and you are walking the same road.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">To help the other students who are like you,<br>to become aware of you...</div>\n  <div class=\"paragraph\"><span>Learn lmms<sup>[13]</sup></span><br>and get your music, including workout music you can sell, up on the internet.</div>\n  <div class=\"paragraph\"><span>Use a projector<sup>[14]</sup></span>,<br>along with <span>the little master painting techniques<sup>[15]</sup></span> to start selling people portraits.</div>\n  <div class=\"paragraph\">And <span>get a cheap 3D printer<sup>[16]</sup></span> to <span>learn 3D modeling<sup>[17]</sup></span>,<br>so that you can prototype at home and sell jewelry online.</div>\n  <div class=\"paragraph\">Build a database of simple brilliant real education things,<br>that help people stop being afraid of being trapped in poverty.</div>\n  <div class=\"paragraph\"><span>The real trap of poverty, is a regular job that will destroy your mental health<sup>[18]</sup></span>,<br>and get you on prescription drugs, so that you become a better employee.</div>\n  <div class=\"paragraph\">Help your friends,<br>give them the tools that save them from the madness of poverty.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">If the teachers interrupt your education,<br>tell them them to stand aside because the school is for you.</div>\n  <div class=\"paragraph\">If they try to force you by threatening you with failing grades, or repeating classes,<br>tell them that, <span>that kind of thing will only result the principal calling them a lemon and having them do a little dance for failure to teach<sup>[19]</sup></span>.</div>\n  <div class=\"paragraph\">Don’t participate in fake education,<br>don’t pretend to learn by memorization, that only helps the leaches and hurts you across your entire lifetime.</div>\n  <div class=\"paragraph\">“In any compromise between good and evil, it is only evil that can profit.”</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Don’t drop out,<br>you have to help the others.</div>\n  <div class=\"paragraph\">The years ahead of you have been set aside for you to learn,<br>but do not go to school assuming that what happens there will teach you anything.</div>\n  <div class=\"paragraph\">Above all,<br>don’t be alone.</div>\n  <div class=\"paragraph\">Go to school, to help others understand what is going on,<br>help the students with bad grades to understand they aren’t stupid.</div>\n  <div class=\"paragraph\">Tell them missing some prerequisites,<br>does not make a person stupid.</div>\n  <div class=\"paragraph\">And that the fact that they didn’t realize that everyone was just memorizing,<br>actually makes them more beautiful.</div>\n  <div class=\"paragraph\">And then help them,<br>help them to Narrated Books at the library.</div>\n  <div class=\"paragraph\">If you can afford it,<br>get them a little mp3 player with Bill Bryson's A Short History Of Nearly Everything.</div>\n  <div class=\"paragraph\">Just imagine them sitting in the back,<br>smiling and actually learning for real from Bryson - while the teacher is mindlessly babbling something,</div>\n  <div class=\"paragraph\">And then begin building,<br>begin building an A-Team, The League Of Extraordinary Ladies And Gentlemen, The Justice League.</div>\n  <div class=\"paragraph\">Bound by knowledge from the worlds most powerful narrated books,<br>equipped with Maker spaces, Hacker spaces, and Fab Labs, that get a kid to go from poverty to selling online with little more than a 3D printer and some Open Source Software.</div>\n  <div class=\"paragraph\">Find a way to build real schools, to save the tigers, to teach the world about all the wrong doings, and how it all leads to poverty and war.</div>\n  <div class=\"paragraph\">Help your crew become Real Teachers, Powerful Artists, Heartbreaking Orators, Hackers, Makers, Polymaths, Authentic Leaders, and Great Beings fueled by Great Wisdom and Vast Knowledge.</div>\n  <div class=\"paragraph\">Make it so that when our generation comes to an end,<br>yours will bring on a lasting global culture of Restraint, Dignity, Nobility, Unbreakability, Fortitude, Courage, Honor, Love;<br>and Insight; and Foresight; and Understanding; and Authenticity; and Great Heroism.</div>\n</div>\n<div class=\"break-after\">&nbsp;</div>\n<div>\n  <div class=\"section\" style=\"padding-bottom: 1rem;\">References</div>\n  <div>[1]: https://www.youtube.com/watch?v=5Hh6uHUx728</div>\n  <div>[2]: https://www.youtube.com/watch?v=8jsUj4DqWfU</div>\n  <div>[3]: https://www.youtube.com/watch?v=DzSnvxejenY</div>\n  <div>[4]: https://www.youtube.com/watch?v=8ve23i5K334</div>\n  <div>[5]: https://en.wikipedia.org/wiki/Loevinger%27s_stages_of_ego_development</div>\n  <div>[6]: https://www.youtube.com/watch?v=IzZh2wstj88</div>\n  <div>[7]: https://www.youtube.com/watch?v=hPSvdKTEZug</div>\n  <div>[8]: https://www.youtube.com/watch?v=bVV2Zk88beY</div>\n  <div>[9]: https://www.youtube.com/watch?v=8ve23i5K334</div>\n  <div>[10]: https://www.youtube.com/watch?v=8ve23i5K334</div>\n  <div>[11]: https://www.youtube.com/watch?v=8jsUj4DqWfU</div>\n  <div>[12]: https://www.youtube.com/watch?v=ZoqgAy3h4OM</div>\n  <div>[13]: https://www.youtube.com/watch?v=0sRvkaxh8EU</div>\n  <div>[14]: https://www.youtube.com/watch?v=BXW0xgYNxlc</div>\n  <div>[15]: https://www.youtube.com/watch?v=NK4Uo5QvH6M</div>\n  <div>[16]: https://www.youtube.com/watch?v=gokN9xNG94U</div>\n  <div>[17]: https://www.youtube.com/watch?v=TPrnSACiTJ4</div>\n  <div>[18]: https://www.youtube.com/watch?v=hPSvdKTEZug</div>\n  <div>[19]: https://www.youtube.com/watch?v=5Hh6uHUx728</div>\n</div>",
  "text": "First of all let me just say,\nthat schools are for you, the teachers are meant to help you, and not punish or scare you.\nYou are all the Hope and Dreams, and the future of this world,\nyour school does not belong to the principal, or the teachers, or even the state, or the wealthy.\nIt is yours,\nit is a gift from history's greatest philosophers.\nIf you have a friend,\nlet them keep you company as you go to the principal's office and learn to stand up for justice.\nAll the power that the principal is imbued with,\ndepends on the fact that you feel safe, that you are growing stronger, and that you are truly learning.\nTell the principal that changes need to be made,\nand that you demand an unconditional, and honest apology.\nBecause it is not their paychecks,\nbut your education, that is the point of the school you are in.\nTell them that next time, you won't be so easily pacified, and you will demand that the lemon[1] is transferred early,\nand each class begins showing real and practical results.\nWhen you are done making promises to the principal,\nbegin learning to talk to the news.\nTell them that you think you are getting a fake education,\nbecause nothing you are being taught shows any practical applications - and it does nothing to get you out of poverty.\nGo to the Radio, TV station, and the still reputable newspapers, talk with whoever is there about the school being fake,\nand the teachers doing as little as possible to just get paid[2].\n\nIt is a mistake for you to assume that you are too young to make demands like this,\nit is actually your youth that opens the door for you to be heard.\n\nI have a theory as to what maybe driving your teacher to anger, to being unfair,\nor even to purposefully manipulating your grades[3], and it maybe a combination of poverty and indoctrination.\nEven teachers that are very kind are blinded,\nbelieving nonsense such as “we need grades to make the students work hard”.\nTo fully answer your question,\nyou have to understand how teachers and adults, and even teenagers, can have their minds clouded to act against their own and Humanity’s best interests.\n\nFundamentally, the teacher is confused because they lack answers,\nthey are scared, threatened by poverty, unable to get a good grasp on the meaning of education, and they have little grasp on the Human Condition.\nUnderstand that growing up has nothing to do with aging,\nit has to do with Knowledge and Wisdom, and where and how they are moving in life.\nIf all they are is older,\nthen your teachers are just aged and confused children who gave up on making sense of life.\n\nBe it by choice, or by being tricked, or by desperation, the teacher is there to make money,\nby what many assume is education.\nBut you are not getting an education,\nyour mind is being sold for years and years of paychecks.\nReal education brings real results,\nlike the time when you were learning to read, or learning numbers and basic math.\nThis gave you the real ability,\nto slowly read a book about philosophers.\nOr to use your knowledge of numbers to step into the world of computer programming,\nwhere all the calculations are automatically solved for you, and you instead create endless nested formulas.\nFake education, is that art class, that only made you hold color pencils,\nand never taught you how to draw a realistic face, even though that is something that only requires a school or office projector to trace the outlines of a picture you took.\nA fake class does not leave you with something that is useful at the end,\nit give you the promise that things will connect but they never do.\nMore than mere promises, you are threatened with bad grades, repeating a class,\nand then face the more long-term threats of bad GPA or not being able to get into college.\nYou are not just facing fake and corrupt education,\nyou are being tricked to accept it.\nYou may already be aware that you will be paying for college,\nand you might have already accepted it.\nPaying for a fake education,\nis even worse than getting one for free, it is a sign of getting indoctrinated into a fantasy lifestyle[4].\n\nYour parents are sending you to school,\nbecause they are using school as a babysitter in hopes of controlling your behavior when they are not around.\nThey don’t want you at home alone,\nbecause you don’t have enough experience in life to make the correct choices.\nUsually when an adult is alone,\nthey take to self education, to a search for wisdom, or a search for adventure.\n\nAdults understand that wisdom will protect them from being taken advantage of,\nyoung people out of lack of experience, often take the opposite path.\nThe inexperienced will be enchanted by behaviors of movie characters, and celebrities,\nby things like displays of anger, fist fighting, or drinking a beer.\nAdults see this kind of behavior,\nas mimicking stupid things.\nEven so, paid fake education, fake classes,\nstill got the best of them, often they only see the basics.\nThey do not see the full effects that indoctrination has on them,\nthey may explain that money, politics and borders are required.\nBut they have no explanation for homeless camps, people dying from poverty,\nmentally ill being thrown into prisons as punishment for their minds falling apart.\n\nMimicry is actually normal part of early human development[5],\nbut it is only healthy when you are surrounded by wise beings.\nDue to poverty most people are surrounded by pleasant to consume media,\nwhich presents a dumbed down, unrealistic personalities.\nIn extreme cases inexperienced people may also face a corrupt local culture,\nthat has evolved to take advantage of them.\nSome cultures may present drug dealers, corrupt police or officials,\nas good to the community.\nIn such cases mimicry is used to propagate a culture of crime,\nin which schools of any kind of any quality are seen as the only way out of that cycle.\nIn most extreme cases, mimicry is exploited to the maximum,\nand it becomes a component in a process of indoctrination[6].\nIndoctrination is not just used to propagate religions,\nbut also manufacture consent for various other terrible things.\nThings like, human trafficking, military recruitment, propagation of misguided politics, the spreading of science denial,\nand an entire array of subcultures that force human beings to blindly act against their self interests by disabling their judgment.\nDepending on where you fall on this spectrum,\nkeeping you in school - however ineffective it may be - can increase your chances of not not having your mind hijacked.\n\nThe terrible thing about indoctrination,\nis that the victims can’t see that they are hijacked.\nA boy selling drugs will think he is an independent thinker,\nbut not only is he a tool, his entire body of wisdom will be ripped out of him.\nA deeply religious person will be pushed into slavery during their life,\nunder a promise of paradise after death - not realizing that life is the paradise.\nYour teachers are also victims or indoctrination,\nthey believe that if they take the same steps everyone else is taking, then everything will work out.\nBut like the boy selling drugs, they are blindly participating,\nin a fantasy existence.\nCarter professionals who pushed Real Education, Wisdom, a Meaningful Relationship away for some promotion, or long therm goal that forces them to act against themselves,\noften do not awaken from their bad judgment until they face some life threatening illness[7].\nAnd the entire world out of its own complexity,\nhas also indoctrinated it self into the concept of money.\nNobody intended to create a global state of poverty,\nand force the world into acting against its best self interests.\nAnd yet we are ignoring climate change, mass incarceration, fake education,\nwe are even tolerating starvation and homelessness in a world full of empty homes and stores that throw out food to keep their prices high.\nEven beyond money, we use the concept of national borders,\na concept that has shown to induce war, weapons manufacturing, and keeping thousands of active nuclear weapons that are ready to destroy major cities around the world, under the already sick and and dangerously quickly eroding fantasy of Peace by means of Mutually Assured Destruction.\n\nAdults will tell you that borders and money are how the world works,\nthe same way a cult member will recite their creed.\nJust like a cult member, a victim of indoctrination, of fake education, of a fantasy existence,\nthey will only protest, unable to answer in any coherent way.\nA victim of indoctrination, can only protect their false beliefs,\nfew will ever learn to see outside of themselves[8].\nThe best way to defeat this vulnerability,\nis to prevent it’s abuse in the first place.\nAnd that can only be accomplished by means of real education,\neffective education, one that has positive and life changing effects on the student.\n\nTeachers will look you in the eyes and with their clouded mind,\nwill say there is nothing that can be done to change the world.\nBut are just ill, in that regard,\nthey are looking directly at the unbreakable force that has the power to change the world.\n\nSchool is not about them,\nschool is for you, because you are the Hope and the Dream.\nThings got just tangled up,\nbecause liars all too easily out compete authentic leaders.\nThat is why the teachers are unfair,\nthat is why you are not getting an education.\nYou are not getting a real education,\nbecause the school you are going to is not a real school.\nThe teachers are not teaching you,\nand your textbooks are not structured to properly present knowledge.\nThe layout of everything past middle school,\nis artificially slowed down to put on a show and make the maximum amount of money.\n\nYour teachers demand for obedience,\nis a way to hide all the holes and cracks they are sensing but can’t fully grasp.\nYour angry teacher is not fully aware that they are selling you out,\nthey will never admit to it, and will angrily resist.\nThe friendly teachers who don’t want to be part of any this,\nwill get transferred if they disrupt the process of your make believe education.\nThe other teachers who are there to make money,\nwill see them as eccentric and will reject anything they have to say.\nThe rebellious more self aware teachers, will either be transferred,\nmade to look like fools, or forced to betray you.\nThose who participate in the system of replacing real education,\nwith an ineffective theatrical one that provides no results, are not your friends.\nYour entire school, is a way of processing all the students,\ninto decades of paychecks out of desperation from poverty.\n\nIn order to optimize this process,\neverything is divided into semesters, classes, lectures and assignments.\nThis division lets the school process the maximum number of students,\nwhile retaining state accreditation.\nThe state accreditation allows them to keep getting funding,\nso that they can continue spreading the money among themselves.\nThe state test are influenced by politicians,\nand they only appear to test knowledge.\nKnowledge cannot be tested with pen and pencil,\nthe state tests, are just as big of a fantasy, as the school it self.\nThe state tests are an extension of ineffective and fake education,\nif those tests were real all the students would fail them today[9].\n\nNobody protests any of this,\nbecause everyone is trying to get the diplomas anyway.\nThe High School and College diplomas,\npromise to increase the probability of getting a good job.\nAlmost nobody drops out,\nout of worries that they will not be able to get a job as an adult.\nWithout a job,\nyou can’t have an apartment, or a home, or put food on your table.\nPeople with the fraudulent diplomas and now student debt[10],\nwill eventually forget how fake the school was, and consider you are a loser.\n\nThere is nothing you can say to the teacher,\nthey will not understand you, they gave up on understanding[11].\nThat is the full reason for their anger and unfairness,\nthey give up.\n\nYou have to find your own education,\nlittle one.\nBook by book,\nand narrated books are best.\nTake a piece of paper and draw a concept map of the things you like,\nand begin in the beginning, and don’t stop until you come to the end.\nYour mind is unique,\nthere is a unique sequence of knowledge that you must follow.\nYou have to move at your own pace, in a sequence that matches you best,\nduring the time of day or night that you prefer.\nFake education means nothing to even a single authentic lesson,\nand one book that helps you close to wisdom, can mean more than years of fake schooling.\n\nPlease be mindful of poverty,\nalways look to build a complete path from introduction to things that could make money, enough so that you don’t have to fear poverty, or hunger, or homelessness.\nIn your journeys aim to become an independent business person[12],\nso that your life is not drained from you the way it has been drained from the teachers.\nWhat Great Beings exist in the world today,\nare on your side, and you are walking the same road.\n\nTo help the other students who are like you,\nto become aware of you...\nLearn lmms[13]\nand get your music, including workout music you can sell, up on the internet.\nUse a projector[14],\nalong with the little master painting techniques[15] to start selling people portraits.\nAnd get a cheap 3D printer[16] to learn 3D modeling[17],\nso that you can prototype at home and sell jewelry online.\nBuild a database of simple brilliant real education things,\nthat help people stop being afraid of being trapped in poverty.\nThe real trap of poverty, is a regular job that will destroy your mental health[18],\nand get you on prescription drugs, so that you become a better employee.\nHelp your friends,\ngive them the tools that save them from the madness of poverty.\n\nIf the teachers interrupt your education,\ntell them them to stand aside because the school is for you.\nIf they try to force you by threatening you with failing grades, or repeating classes,\ntell them that, that kind of thing will only result the principal calling them a lemon and having them do a little dance for failure to teach[19].\nDon’t participate in fake education,\ndon’t pretend to learn by memorization, that only helps the leaches and hurts you across your entire lifetime.\n“In any compromise between good and evil, it is only evil that can profit.”\n\nDon’t drop out,\nyou have to help the others.\nThe years ahead of you have been set aside for you to learn,\nbut do not go to school assuming that what happens there will teach you anything.\nAbove all,\ndon’t be alone.\nGo to school, to help others understand what is going on,\nhelp the students with bad grades to understand they aren’t stupid.\nTell them missing some prerequisites,\ndoes not make a person stupid.\nAnd that the fact that they didn’t realize that everyone was just memorizing,\nactually makes them more beautiful.\nAnd then help them,\nhelp them to Narrated Books at the library.\nIf you can afford it,\nget them a little mp3 player with Bill Bryson's A Short History Of Nearly Everything.\nJust imagine them sitting in the back,\nsmiling and actually learning for real from Bryson - while the teacher is mindlessly babbling something,\nAnd then begin building,\nbegin building an A-Team, The League Of Extraordinary Ladies And Gentlemen, The Justice League.\nBound by knowledge from the worlds most powerful narrated books,\nequipped with Maker spaces, Hacker spaces, and Fab Labs, that get a kid to go from poverty to selling online with little more than a 3D printer and some Open Source Software.\nFind a way to build real schools, to save the tigers, to teach the world about all the wrong doings, and how it all leads to poverty and war.\nHelp your crew become Real Teachers, Powerful Artists, Heartbreaking Orators, Hackers, Makers, Polymaths, Authentic Leaders, and Great Beings fueled by Great Wisdom and Vast Knowledge.\nMake it so that when our generation comes to an end,\nyours will bring on a lasting global culture of Restraint, Dignity, Nobility, Unbreakability, Fortitude, Courage, Honor, Love;\nand Insight; and Foresight; and Understanding; and Authenticity; and Great Heroism.\n \nReferences\n[1]: https://www.youtube.com/watch?v=5Hh6uHUx728\n[2]: https://www.youtube.com/watch?v=8jsUj4DqWfU\n[3]: https://www.youtube.com/watch?v=DzSnvxejenY\n[4]: https://www.youtube.com/watch?v=8ve23i5K334\n[5]: https://en.wikipedia.org/wiki/Loevinger%27s_stages_of_ego_development\n[6]: https://www.youtube.com/watch?v=IzZh2wstj88\n[7]: https://www.youtube.com/watch?v=hPSvdKTEZug\n[8]: https://www.youtube.com/watch?v=bVV2Zk88beY\n[9]: https://www.youtube.com/watch?v=8ve23i5K334\n[10]: https://www.youtube.com/watch?v=8ve23i5K334\n[11]: https://www.youtube.com/watch?v=8jsUj4DqWfU\n[12]: https://www.youtube.com/watch?v=ZoqgAy3h4OM\n[13]: https://www.youtube.com/watch?v=0sRvkaxh8EU\n[14]: https://www.youtube.com/watch?v=BXW0xgYNxlc\n[15]: https://www.youtube.com/watch?v=NK4Uo5QvH6M\n[16]: https://www.youtube.com/watch?v=gokN9xNG94U\n[17]: https://www.youtube.com/watch?v=TPrnSACiTJ4\n[18]: https://www.youtube.com/watch?v=hPSvdKTEZug\n[19]: https://www.youtube.com/watch?v=5Hh6uHUx728",
  "images": [],
  "links": [
    {
      "title": "lemon",
      "url": "https://www.youtube.com/watch?v=5Hh6uHUx728",
      "hostname": "www.youtube.com"
    },
    {
      "title": "teachers doing as little as possible to just get paid",
      "url": "https://www.youtube.com/watch?v=8jsUj4DqWfU",
      "hostname": "www.youtube.com"
    },
    {
      "title": "purposefully manipulating your grades",
      "url": "https://www.youtube.com/watch?v=DzSnvxejenY",
      "hostname": "www.youtube.com"
    },
    {
      "title": "it is a sign of getting indoctrinated into a fantasy lifestyle",
      "url": "https://www.youtube.com/watch?v=8ve23i5K334",
      "hostname": "www.youtube.com"
    },
    {
      "title": "Mimicry is actually normal part of early human development",
      "url": "https://en.wikipedia.org/wiki/Loevinger%27s_stages_of_ego_development",
      "hostname": "en.wikipedia.org"
    },
    {
      "title": "it becomes a component in a process of indoctrination",
      "url": "https://www.youtube.com/watch?v=IzZh2wstj88",
      "hostname": "www.youtube.com"
    },
    {
      "title": "often do not awaken from their bad judgment until they face some life threatening illness",
      "url": "https://www.youtube.com/watch?v=hPSvdKTEZug",
      "hostname": "www.youtube.com"
    },
    {
      "title": "few will ever learn to see outside of themselves",
      "url": "https://www.youtube.com/watch?v=bVV2Zk88beY",
      "hostname": "www.youtube.com"
    },
    {
      "title": "if those tests were real all the students would fail them today",
      "url": "https://www.youtube.com/watch?v=8ve23i5K334",
      "hostname": "www.youtube.com"
    },
    {
      "title": "People with the fraudulent diplomas and now student debt",
      "url": "https://www.youtube.com/watch?v=8ve23i5K334",
      "hostname": "www.youtube.com"
    },
    {
      "title": "they will not understand you, they gave up on understanding",
      "url": "https://www.youtube.com/watch?v=8jsUj4DqWfU",
      "hostname": "www.youtube.com"
    },
    {
      "title": "aim to become an independent business person",
      "url": "https://www.youtube.com/watch?v=ZoqgAy3h4OM",
      "hostname": "www.youtube.com"
    },
    {
      "title": "Learn lmms",
      "url": "https://www.youtube.com/watch?v=0sRvkaxh8EU",
      "hostname": "www.youtube.com"
    },
    {
      "title": "Use a projector",
      "url": "https://www.youtube.com/watch?v=BXW0xgYNxlc",
      "hostname": "www.youtube.com"
    },
    {
      "title": "the little master painting techniques",
      "url": "https://www.youtube.com/watch?v=NK4Uo5QvH6M",
      "hostname": "www.youtube.com"
    },
    {
      "title": "get a cheap 3D printer",
      "url": "https://www.youtube.com/watch?v=gokN9xNG94U",
      "hostname": "www.youtube.com"
    },
    {
      "title": "learn 3D modeling",
      "url": "https://www.youtube.com/watch?v=TPrnSACiTJ4",
      "hostname": "www.youtube.com"
    },
    {
      "title": "The real trap of poverty, is a regular job that will destroy your mental health",
      "url": "https://www.youtube.com/watch?v=hPSvdKTEZug",
      "hostname": "www.youtube.com"
    },
    {
      "title": "that kind of thing will only result the principal calling them a lemon and having them do a little dance for failure to teach",
      "url": "https://www.youtube.com/watch?v=5Hh6uHUx728",
      "hostname": "www.youtube.com"
    }
  ]
}