{
  "name": "furkies-purrkies-poetry-0844",
  "id": "furkies-purrkies-poetry-0844",
  "title": "How Can School Be Fake? Or, How Can Mirrors Be Real If Our Eyes Aren't Real?",
  "date": "2022-06-22T10:55:15.608Z",
  "image": "poetry-0844-illustration.jpg",
  "artwork": "https://unsplash.com/photos/FUdBQeW209Y",
  "audio": "poetry-0844.mp3",
  "html": "<div class=\"section\">\n  <p>When we are little we learn that the act of taking a toy apart,<br>is also the act of destroying that toy.</p>\n  <p>Subject divisions destroy education,<br>being told what you should be \"learning\" at any given moment...</p>\n  <p>Actually prevents learning,<br>and forces you into memorization.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Teachers are going along with it,<br>because your education is not the primary reason why they are teachers.</p>\n  <p>They are teachers, to make money,<br>to put food on the table.</p>\n  <p>Sometimes people become teaches,<br>because they feel it tool a lot of effort to memorize all the disconnected facts.</p>\n  <p>And they don't want to learn anything more,<br>they want to turn that effort into profit.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>The presidents and prime ministers, all the world leaders,<br>all the people who would seemingly greatly benefit from fixing schools.</p>\n  <p>Are doing as little as possible to keep their position,<br>they are surrounded by people who want to tear them apart, liars, manipulators, mimics...</p>\n  <p>And eventually,<br>they reach two conclusions.</p>\n  <p>One, do your job without an incident,<br>that is difficult enough.</p>\n  <p>Two, there is nothing you can do here as the position has been bricked,<br>to keep liars from destabilizing all the other positions, and limit the potential damage.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Just because a system is established,<br>it does not mean that it will do what it was designed for.</p>\n  <p>When you take something apart,<br>it is all still there but it won't necessarily serve the purpose it was originally made for.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Half jokingly, if teachers worked for grades, instead of money,<br>then maybe things would change.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>A lot of politicians feel,<br>that they shouldn't worry about the things that you can do on your own.</p>\n  <p>When you are in High School,<br>you'll get a bad education, but as you grow you will fix that by reading real books.</p>\n  <p>A lot of them kind of feel, that it is good enough,<br>to keep you out of prison, give you text books, and work...</p>\n  <p>So that they can be the leaders,<br>and you can be the stuffing, the machinery, the content, the people.</p>\n  <p>This only sounds reasonable, because while they lead, and you get a crappy education,<br>the world's dictators use drug trade to stay in power, and fund nuclear weapons research, while religious extremists do all the rest.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Leaders, by just doing the surface work,<br>are just actors.</p>\n  <p>Just because war didn't broke out during their term,<br>it doesn't mean that they didn't play a big part in making it possible.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Because politics is so clogged up by liars, and pretenders,<br>it is rendered ineffective, right up until the last moment before the war breaks out.</p>\n  <p>That's when everyone turns to the same aim,<br>because is they don't they will be exposed, as liars, profiteering gluttons, or just ineffective leaders.</p>\n  <p>Taking everything up to the last moment,<br>is an extremely dangerous tactic.</p>\n  <p>The correct approach is to apply sanctions several decades ahead,<br>prior to the war breaking out.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Prediction,<br>is a major part of a real leaders job.</p>\n  <p>They can completely erase a war,<br>by collapsing all the things leading up to it.</p>\n  <p>Once the war is close, or begins,<br>the loss is infinitely greater, when compared to prevention.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>This won't really become clear,<br>until you realize how easy prevention is.</p>\n  <p>Prevention, just requires real education,<br>it eliminates the lairs, it creates a culture of dignity and honestly...</p>\n  <p>And the leaders become powerful enough,<br>to practice prevention of tragedy, decades before it happens.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Let me define some terms for you, fake education, is a name I came up with,<br>in response to people using the words \"Fake News\" - it is my way of calling out the liars.</p>\n  <p>The actual term that I am thinking of, is:<br><a href=\"https://www.youtube.com/watch?v=fmoor8DwqW4\">ineffective education</a>.</p>\n  <p>That is when professionals look at the long therm outcome of an educational system,<br>and decide that it did not have the expected result.</p>\n  <p>Because no one is fixing anything,<br>I just call it fake.</p>\n  <p>I suspect that schools cause damage to our natural curiosity about complex things,<br>that without grades and stress of fake school, punishment, poverty, and the threat of not getting a job...</p>\n  <p>When you first truly notice stars, you'll be guided to use the family telescope,<br>and slowly explained how Newton arrived at the laws, with little mechanical machines, and gradual changes to mathematical figures.</p>\n  <p>That with Love and Respect you would be introduced to computation on a computer where you can witness the results,<br>instead of paper, where the results look great when the teacher secretly forces everyone to memorize the formulas so that they can put food on their table.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>That is not to say that being kicked out of school will make a genius,<br>though I can imagine that a lot of geniuses in deed had a start in the most terrible things that humanity can do to them.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>A young person still need the framework,<br>not the content and direction, but the structure and availability of information with <a href=\"https://www.youtube.com/watch?v=mQPEZdBTOeE\">easy on-ramp</a> access.</p>\n  <p>Easy on-ramp access, means that there is an interface for a student,<br>because normally scientists don't need that easy interface, though they always learn at every turn - they don't always need the Teenager explanation.</p>\n  <p>Among well educated professionals it is assumed,<br>that there is a certain level of knowledge that does not require all the explanations.</p>\n  <p>See that is the definition of real school,<br>that assumption is not made among the students, and every subject here, will have a clear and easy to understand on ramp.</p>\n  <p>In schools of today, teachers in their incompetence and insanity invented the crazy fantasy of pre-requsite knowledge,<br>ensuring that if you miss something in the beginning of High School, you will be forced to merely memorize content as you go on, and they will pass you along to make it look legit.</p>\n  <p>After all, they are trying to do as little as possible,<br>while giving a convincing impression of education and educational materials.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>You kind of create a real school, when you go on the internet,<br>and begin researching something for real, and actually assemble that on ramp.</p>\n  <p>But you see, that is the job of school,<br>that is how they should be teaching you, by helping you build up real knowledge, that is relevant to you.</p>\n  <p>You can see how fitting it is to call school fake,<br>when you have to go home and lean on your own, and then use some of that to pass their warped testing.</p>\n  <p>The cute tests with trick questions, will make yo smile,<br>but they are pretty bad for you, knowledge is not a game...</p>\n  <p>Where a bunch of morons come together to throw you off,<br>with moronic questions.</p>\n  <p>Knowledge is delicate, you don not want to be taking tests that try to mix things up,<br>because they will cause harm to delicate distinctions that you are slowly building up.</p>\n  <p>I compare finals with trick questions, to a teacher showing up at your home,<br>and quietly reliving himself in the middle of your living room, with a great big smile of approval, or whatever.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>I just want to underline that the sequence in which you learn is very important,<br>it is critical.</p>\n  <p>You can only learn based on what you know, it is no good for you to learn about memory collection and malloc,<br>when you have determined that you are most powerful when learning high level programming languages that help you to program Visual Programming Languages.</p>\n  <p>Only you can make the determination of where you are going,<br>and that determination will shift as you learn more and more.</p>\n  <p>Real education will alter your decision making, will enhance your personality, refine the choices you are making,<br>and take you to a future that you understand, that makes you feel whole.</p>\n  <p>This is not to say, that you will end up as a Ballerina, instead of a Doctor or Attorney,<br>it means you will become an expert of wherever you go.</p>\n  <p>If you do end up a Ballerina, they you will also run a successful school for athletes,<br>and you will ensure their safety and security, intellectual independence, and greatness.</p>\n  <p>An expert is a person with integrated knowledge,<br>that spans the entire area they are working in, Human Condition first.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>As we transition to even the darker side and close,<br>I want to mention to you a quote by Plutarch</p>\n  <p>\"The mind is not a vessel to be filled,<br>but a fire to be kindled.\"</p>\n  <p>You can see how this makes a distinction between memorizing,<br>and learning, poetically speaking, becoming ravenous for knowledge.</p>\n  <p>Any attempt at tricking students into memorization, including the notion of pre-requisite classes,<br>and especially standardized education, and of course, punishment with grades, and threats of being branded as mentally-late by holding them back - makes for a fake school.</p>\n  <p>This has been well defined, it has been considered,<br>if you are tricked into memorization, your school is fake, and your education will later turn out to be ineffective.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Collapsing education on purpose,<br>has been used to instill violence, create obedient slaves or soldiers, and cause regime change.</p>\n  <p>Schools in well developed nations, as bad as they are,<br>they are not yet evil.</p>\n  <p><a href=\"https://youtu.be/IzZh2wstj88?t=3399\">But creepy schools do exist</a>, and they betray students,<br>for money, for power, out of sickens, out of evil.</p>\n  <p>Here the teachers say, that they don't know if what they are teaching is real,<br>but if their imaginary creatures of might and glory wanted to do something that looks unreal, they could totally do it.</p>\n  <p>The do not accept responsibility for the things they teach, because they know they are not real,<br>and when pressed they will hide themselves behind a major culture, and say, and say X billion people cant be wrong.</p>\n  <p>They do not aim to win the arguments,<br>they aim to avoid them.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Here in closing I wanted to explain the opening line of \"How Can Mirrors Be Real If Our Eyes Aren't Real\",<br>this was uttered by a young person after it was explained to them that our views of the world are influenced by our upbringing.</p>\n  <p>He looked in a mirror, and said, if my eyes are lying to me,<br>then how can my reflection truly show who I am.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>The only way to become the person that the adult you should be,<br>is by means of real education.</p>\n  <p>Real and meaningful life changing education,<br>will refine your decision making, to truly make it your own.</p>\n  <p>So that your older self will be proud of and at peace with,<br>that you in your youth and middle age have made.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>This closing point shows you how critical real education is,<br>and more importantly, it shows how important it is that you get a real education as soon as possible.</p>\n  <p>The delaying of the onset of your wisdom by a moderate teacher in a well developed nation,<br>is as evil, as purposefully warping the minds of trusting students in order to cause regime change or raise a generation of slaves or soldiers.</p>\n</div>\n<div class=\"section\">\n  <hr>\n</div>\n<div class=\"section\">\n  <p>Get your mittens at narrated books that are held in high esteem by all the worlds intellectuals,<br>don't pay too much attention to their flaws yet, it is a wonder that they exist at all.</p>\n  <p>Allow yourself to grow up surrounded by wisdom,<br>inherit lifetimes of knowledge from powerful biographies and non fiction.</p>\n  <p>Once your eyes begin seeing through the wisdom that does your elder self justice,<br>you will then, make the mirrors real.</p>\n  <p>And what is more, you will then be able to explain,<br>how the letters on your shirt are mirrored and go right to left, but, BUT, BuUuT, your left hand is still your left hand in your mirror image.</p>\n  <p>How can mirrors be real if they only reverse text,<br>and NOT your left and right hand side?</p>\n  <p>Grrrrrr....</p>\n</div>",
  "bootstrap": "<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">When we are little we learn that the act of taking a toy apart,<br>is also the act of destroying that toy.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Subject divisions destroy education,<br>being told what you should be \"learning\" at any given moment...</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Actually prevents learning,<br>and forces you into memorization.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Teachers are going along with it,<br>because your education is not the primary reason why they are teachers.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">They are teachers, to make money,<br>to put food on the table.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Sometimes people become teaches,<br>because they feel it tool a lot of effort to memorize all the disconnected facts.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">And they don't want to learn anything more,<br>they want to turn that effort into profit.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The presidents and prime ministers, all the world leaders,<br>all the people who would seemingly greatly benefit from fixing schools.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Are doing as little as possible to keep their position,<br>they are surrounded by people who want to tear them apart, liars, manipulators, mimics...</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">And eventually,<br>they reach two conclusions.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">One, do your job without an incident,<br>that is difficult enough.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Two, there is nothing you can do here as the position has been bricked,<br>to keep liars from destabilizing all the other positions, and limit the potential damage.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Just because a system is established,<br>it does not mean that it will do what it was designed for.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">When you take something apart,<br>it is all still there but it won't necessarily serve the purpose it was originally made for.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Half jokingly, if teachers worked for grades, instead of money,<br>then maybe things would change.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">A lot of politicians feel,<br>that they shouldn't worry about the things that you can do on your own.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">When you are in High School,<br>you'll get a bad education, but as you grow you will fix that by reading real books.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">A lot of them kind of feel, that it is good enough,<br>to keep you out of prison, give you text books, and work...</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">So that they can be the leaders,<br>and you can be the stuffing, the machinery, the content, the people.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">This only sounds reasonable, because while they lead, and you get a crappy education,<br>the world's dictators use drug trade to stay in power, and fund nuclear weapons research, while religious extremists do all the rest.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Leaders, by just doing the surface work,<br>are just actors.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Just because war didn't broke out during their term,<br>it doesn't mean that they didn't play a big part in making it possible.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Because politics is so clogged up by liars, and pretenders,<br>it is rendered ineffective, right up until the last moment before the war breaks out.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">That's when everyone turns to the same aim,<br>because is they don't they will be exposed, as liars, profiteering gluttons, or just ineffective leaders.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Taking everything up to the last moment,<br>is an extremely dangerous tactic.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The correct approach is to apply sanctions several decades ahead,<br>prior to the war breaking out.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Prediction,<br>is a major part of a real leaders job.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">They can completely erase a war,<br>by collapsing all the things leading up to it.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Once the war is close, or begins,<br>the loss is infinitely greater, when compared to prevention.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">This won't really become clear,<br>until you realize how easy prevention is.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Prevention, just requires real education,<br>it eliminates the lairs, it creates a culture of dignity and honestly...</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">And the leaders become powerful enough,<br>to practice prevention of tragedy, decades before it happens.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Let me define some terms for you, fake education, is a name I came up with,<br>in response to people using the words \"Fake News\" - it is my way of calling out the liars.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The actual term that I am thinking of, is:<br><a href=\"https://www.youtube.com/watch?v=fmoor8DwqW4\">ineffective education</a>.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">That is when professionals look at the long therm outcome of an educational system,<br>and decide that it did not have the expected result.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Because no one is fixing anything,<br>I just call it fake.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I suspect that schools cause damage to our natural curiosity about complex things,<br>that without grades and stress of fake school, punishment, poverty, and the threat of not getting a job...</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">When you first truly notice stars, you'll be guided to use the family telescope,<br>and slowly explained how Newton arrived at the laws, with little mechanical machines, and gradual changes to mathematical figures.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">That with Love and Respect you would be introduced to computation on a computer where you can witness the results,<br>instead of paper, where the results look great when the teacher secretly forces everyone to memorize the formulas so that they can put food on their table.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">That is not to say that being kicked out of school will make a genius,<br>though I can imagine that a lot of geniuses in deed had a start in the most terrible things that humanity can do to them.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">A young person still need the framework,<br>not the content and direction, but the structure and availability of information with <a href=\"https://www.youtube.com/watch?v=mQPEZdBTOeE\">easy on-ramp</a> access.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Easy on-ramp access, means that there is an interface for a student,<br>because normally scientists don't need that easy interface, though they always learn at every turn - they don't always need the Teenager explanation.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Among well educated professionals it is assumed,<br>that there is a certain level of knowledge that does not require all the explanations.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">See that is the definition of real school,<br>that assumption is not made among the students, and every subject here, will have a clear and easy to understand on ramp.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">In schools of today, teachers in their incompetence and insanity invented the crazy fantasy of pre-requsite knowledge,<br>ensuring that if you miss something in the beginning of High School, you will be forced to merely memorize content as you go on, and they will pass you along to make it look legit.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">After all, they are trying to do as little as possible,<br>while giving a convincing impression of education and educational materials.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">You kind of create a real school, when you go on the internet,<br>and begin researching something for real, and actually assemble that on ramp.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">But you see, that is the job of school,<br>that is how they should be teaching you, by helping you build up real knowledge, that is relevant to you.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">You can see how fitting it is to call school fake,<br>when you have to go home and lean on your own, and then use some of that to pass their warped testing.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The cute tests with trick questions, will make yo smile,<br>but they are pretty bad for you, knowledge is not a game...</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Where a bunch of morons come together to throw you off,<br>with moronic questions.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Knowledge is delicate, you don not want to be taking tests that try to mix things up,<br>because they will cause harm to delicate distinctions that you are slowly building up.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I compare finals with trick questions, to a teacher showing up at your home,<br>and quietly reliving himself in the middle of your living room, with a great big smile of approval, or whatever.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">I just want to underline that the sequence in which you learn is very important,<br>it is critical.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">You can only learn based on what you know, it is no good for you to learn about memory collection and malloc,<br>when you have determined that you are most powerful when learning high level programming languages that help you to program Visual Programming Languages.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Only you can make the determination of where you are going,<br>and that determination will shift as you learn more and more.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Real education will alter your decision making, will enhance your personality, refine the choices you are making,<br>and take you to a future that you understand, that makes you feel whole.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">This is not to say, that you will end up as a Ballerina, instead of a Doctor or Attorney,<br>it means you will become an expert of wherever you go.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">If you do end up a Ballerina, they you will also run a successful school for athletes,<br>and you will ensure their safety and security, intellectual independence, and greatness.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">An expert is a person with integrated knowledge,<br>that spans the entire area they are working in, Human Condition first.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">As we transition to even the darker side and close,<br>I want to mention to you a quote by Plutarch</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">\"The mind is not a vessel to be filled,<br>but a fire to be kindled.\"</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">You can see how this makes a distinction between memorizing,<br>and learning, poetically speaking, becoming ravenous for knowledge.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Any attempt at tricking students into memorization, including the notion of pre-requisite classes,<br>and especially standardized education, and of course, punishment with grades, and threats of being branded as mentally-late by holding them back - makes for a fake school.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">This has been well defined, it has been considered,<br>if you are tricked into memorization, your school is fake, and your education will later turn out to be ineffective.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Collapsing education on purpose,<br>has been used to instill violence, create obedient slaves or soldiers, and cause regime change.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Schools in well developed nations, as bad as they are,<br>they are not yet evil.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\"><a href=\"https://youtu.be/IzZh2wstj88?t=3399\">But creepy schools do exist</a>, and they betray students,<br>for money, for power, out of sickens, out of evil.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Here the teachers say, that they don't know if what they are teaching is real,<br>but if their imaginary creatures of might and glory wanted to do something that looks unreal, they could totally do it.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The do not accept responsibility for the things they teach, because they know they are not real,<br>and when pressed they will hide themselves behind a major culture, and say, and say X billion people cant be wrong.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">They do not aim to win the arguments,<br>they aim to avoid them.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Here in closing I wanted to explain the opening line of \"How Can Mirrors Be Real If Our Eyes Aren't Real\",<br>this was uttered by a young person after it was explained to them that our views of the world are influenced by our upbringing.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">He looked in a mirror, and said, if my eyes are lying to me,<br>then how can my reflection truly show who I am.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The only way to become the person that the adult you should be,<br>is by means of real education.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Real and meaningful life changing education,<br>will refine your decision making, to truly make it your own.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">So that your older self will be proud of and at peace with,<br>that you in your youth and middle age have made.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">This closing point shows you how critical real education is,<br>and more importantly, it shows how important it is that you get a real education as soon as possible.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">The delaying of the onset of your wisdom by a moderate teacher in a well developed nation,<br>is as evil, as purposefully warping the minds of trusting students in order to cause regime change or raise a generation of slaves or soldiers.</div>\n  </div>\n</div>\n<div class=\"mb-5 section-spacer\">&nbsp;</div>\n<div class=\"card card-section bg-dark text-warning shadow\">\n  <div class=\"section card-body mb-0 my-2\">\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Get your mittens at narrated books that are held in high esteem by all the worlds intellectuals,<br>don't pay too much attention to their flaws yet, it is a wonder that they exist at all.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Allow yourself to grow up surrounded by wisdom,<br>inherit lifetimes of knowledge from powerful biographies and non fiction.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Once your eyes begin seeing through the wisdom that does your elder self justice,<br>you will then, make the mirrors real.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">And what is more, you will then be able to explain,<br>how the letters on your shirt are mirrored and go right to left, but, BUT, BuUuT, your left hand is still your left hand in your mirror image.</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">How can mirrors be real if they only reverse text,<br>and NOT your left and right hand side?</div>\n    <div class=\"paragraph card-text card-stanza my-5 text-center\">Grrrrrr....</div>\n  </div>\n</div>",
  "print": "<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">When we are little we learn that the act of taking a toy apart,<br>is also the act of destroying that toy.</div>\n  <div class=\"paragraph\">Subject divisions destroy education,<br>being told what you should be \"learning\" at any given moment...</div>\n  <div class=\"paragraph\">Actually prevents learning,<br>and forces you into memorization.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Teachers are going along with it,<br>because your education is not the primary reason why they are teachers.</div>\n  <div class=\"paragraph\">They are teachers, to make money,<br>to put food on the table.</div>\n  <div class=\"paragraph\">Sometimes people become teaches,<br>because they feel it tool a lot of effort to memorize all the disconnected facts.</div>\n  <div class=\"paragraph\">And they don't want to learn anything more,<br>they want to turn that effort into profit.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">The presidents and prime ministers, all the world leaders,<br>all the people who would seemingly greatly benefit from fixing schools.</div>\n  <div class=\"paragraph\">Are doing as little as possible to keep their position,<br>they are surrounded by people who want to tear them apart, liars, manipulators, mimics...</div>\n  <div class=\"paragraph\">And eventually,<br>they reach two conclusions.</div>\n  <div class=\"paragraph\">One, do your job without an incident,<br>that is difficult enough.</div>\n  <div class=\"paragraph\">Two, there is nothing you can do here as the position has been bricked,<br>to keep liars from destabilizing all the other positions, and limit the potential damage.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Just because a system is established,<br>it does not mean that it will do what it was designed for.</div>\n  <div class=\"paragraph\">When you take something apart,<br>it is all still there but it won't necessarily serve the purpose it was originally made for.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Half jokingly, if teachers worked for grades, instead of money,<br>then maybe things would change.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">A lot of politicians feel,<br>that they shouldn't worry about the things that you can do on your own.</div>\n  <div class=\"paragraph\">When you are in High School,<br>you'll get a bad education, but as you grow you will fix that by reading real books.</div>\n  <div class=\"paragraph\">A lot of them kind of feel, that it is good enough,<br>to keep you out of prison, give you text books, and work...</div>\n  <div class=\"paragraph\">So that they can be the leaders,<br>and you can be the stuffing, the machinery, the content, the people.</div>\n  <div class=\"paragraph\">This only sounds reasonable, because while they lead, and you get a crappy education,<br>the world's dictators use drug trade to stay in power, and fund nuclear weapons research, while religious extremists do all the rest.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Leaders, by just doing the surface work,<br>are just actors.</div>\n  <div class=\"paragraph\">Just because war didn't broke out during their term,<br>it doesn't mean that they didn't play a big part in making it possible.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Because politics is so clogged up by liars, and pretenders,<br>it is rendered ineffective, right up until the last moment before the war breaks out.</div>\n  <div class=\"paragraph\">That's when everyone turns to the same aim,<br>because is they don't they will be exposed, as liars, profiteering gluttons, or just ineffective leaders.</div>\n  <div class=\"paragraph\">Taking everything up to the last moment,<br>is an extremely dangerous tactic.</div>\n  <div class=\"paragraph\">The correct approach is to apply sanctions several decades ahead,<br>prior to the war breaking out.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Prediction,<br>is a major part of a real leaders job.</div>\n  <div class=\"paragraph\">They can completely erase a war,<br>by collapsing all the things leading up to it.</div>\n  <div class=\"paragraph\">Once the war is close, or begins,<br>the loss is infinitely greater, when compared to prevention.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">This won't really become clear,<br>until you realize how easy prevention is.</div>\n  <div class=\"paragraph\">Prevention, just requires real education,<br>it eliminates the lairs, it creates a culture of dignity and honestly...</div>\n  <div class=\"paragraph\">And the leaders become powerful enough,<br>to practice prevention of tragedy, decades before it happens.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Let me define some terms for you, fake education, is a name I came up with,<br>in response to people using the words \"Fake News\" - it is my way of calling out the liars.</div>\n  <div class=\"paragraph\">The actual term that I am thinking of, is:<br><span>ineffective education<sup>[1]</sup></span>.</div>\n  <div class=\"paragraph\">That is when professionals look at the long therm outcome of an educational system,<br>and decide that it did not have the expected result.</div>\n  <div class=\"paragraph\">Because no one is fixing anything,<br>I just call it fake.</div>\n  <div class=\"paragraph\">I suspect that schools cause damage to our natural curiosity about complex things,<br>that without grades and stress of fake school, punishment, poverty, and the threat of not getting a job...</div>\n  <div class=\"paragraph\">When you first truly notice stars, you'll be guided to use the family telescope,<br>and slowly explained how Newton arrived at the laws, with little mechanical machines, and gradual changes to mathematical figures.</div>\n  <div class=\"paragraph\">That with Love and Respect you would be introduced to computation on a computer where you can witness the results,<br>instead of paper, where the results look great when the teacher secretly forces everyone to memorize the formulas so that they can put food on their table.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">That is not to say that being kicked out of school will make a genius,<br>though I can imagine that a lot of geniuses in deed had a start in the most terrible things that humanity can do to them.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">A young person still need the framework,<br>not the content and direction, but the structure and availability of information with <span>easy on-ramp<sup>[2]</sup></span> access.</div>\n  <div class=\"paragraph\">Easy on-ramp access, means that there is an interface for a student,<br>because normally scientists don't need that easy interface, though they always learn at every turn - they don't always need the Teenager explanation.</div>\n  <div class=\"paragraph\">Among well educated professionals it is assumed,<br>that there is a certain level of knowledge that does not require all the explanations.</div>\n  <div class=\"paragraph\">See that is the definition of real school,<br>that assumption is not made among the students, and every subject here, will have a clear and easy to understand on ramp.</div>\n  <div class=\"paragraph\">In schools of today, teachers in their incompetence and insanity invented the crazy fantasy of pre-requsite knowledge,<br>ensuring that if you miss something in the beginning of High School, you will be forced to merely memorize content as you go on, and they will pass you along to make it look legit.</div>\n  <div class=\"paragraph\">After all, they are trying to do as little as possible,<br>while giving a convincing impression of education and educational materials.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">You kind of create a real school, when you go on the internet,<br>and begin researching something for real, and actually assemble that on ramp.</div>\n  <div class=\"paragraph\">But you see, that is the job of school,<br>that is how they should be teaching you, by helping you build up real knowledge, that is relevant to you.</div>\n  <div class=\"paragraph\">You can see how fitting it is to call school fake,<br>when you have to go home and lean on your own, and then use some of that to pass their warped testing.</div>\n  <div class=\"paragraph\">The cute tests with trick questions, will make yo smile,<br>but they are pretty bad for you, knowledge is not a game...</div>\n  <div class=\"paragraph\">Where a bunch of morons come together to throw you off,<br>with moronic questions.</div>\n  <div class=\"paragraph\">Knowledge is delicate, you don not want to be taking tests that try to mix things up,<br>because they will cause harm to delicate distinctions that you are slowly building up.</div>\n  <div class=\"paragraph\">I compare finals with trick questions, to a teacher showing up at your home,<br>and quietly reliving himself in the middle of your living room, with a great big smile of approval, or whatever.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">I just want to underline that the sequence in which you learn is very important,<br>it is critical.</div>\n  <div class=\"paragraph\">You can only learn based on what you know, it is no good for you to learn about memory collection and malloc,<br>when you have determined that you are most powerful when learning high level programming languages that help you to program Visual Programming Languages.</div>\n  <div class=\"paragraph\">Only you can make the determination of where you are going,<br>and that determination will shift as you learn more and more.</div>\n  <div class=\"paragraph\">Real education will alter your decision making, will enhance your personality, refine the choices you are making,<br>and take you to a future that you understand, that makes you feel whole.</div>\n  <div class=\"paragraph\">This is not to say, that you will end up as a Ballerina, instead of a Doctor or Attorney,<br>it means you will become an expert of wherever you go.</div>\n  <div class=\"paragraph\">If you do end up a Ballerina, they you will also run a successful school for athletes,<br>and you will ensure their safety and security, intellectual independence, and greatness.</div>\n  <div class=\"paragraph\">An expert is a person with integrated knowledge,<br>that spans the entire area they are working in, Human Condition first.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">As we transition to even the darker side and close,<br>I want to mention to you a quote by Plutarch</div>\n  <div class=\"paragraph\">\"The mind is not a vessel to be filled,<br>but a fire to be kindled.\"</div>\n  <div class=\"paragraph\">You can see how this makes a distinction between memorizing,<br>and learning, poetically speaking, becoming ravenous for knowledge.</div>\n  <div class=\"paragraph\">Any attempt at tricking students into memorization, including the notion of pre-requisite classes,<br>and especially standardized education, and of course, punishment with grades, and threats of being branded as mentally-late by holding them back - makes for a fake school.</div>\n  <div class=\"paragraph\">This has been well defined, it has been considered,<br>if you are tricked into memorization, your school is fake, and your education will later turn out to be ineffective.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Collapsing education on purpose,<br>has been used to instill violence, create obedient slaves or soldiers, and cause regime change.</div>\n  <div class=\"paragraph\">Schools in well developed nations, as bad as they are,<br>they are not yet evil.</div>\n  <div class=\"paragraph\"><span>But creepy schools do exist<sup>[3]</sup></span>, and they betray students,<br>for money, for power, out of sickens, out of evil.</div>\n  <div class=\"paragraph\">Here the teachers say, that they don't know if what they are teaching is real,<br>but if their imaginary creatures of might and glory wanted to do something that looks unreal, they could totally do it.</div>\n  <div class=\"paragraph\">The do not accept responsibility for the things they teach, because they know they are not real,<br>and when pressed they will hide themselves behind a major culture, and say, and say X billion people cant be wrong.</div>\n  <div class=\"paragraph\">They do not aim to win the arguments,<br>they aim to avoid them.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Here in closing I wanted to explain the opening line of \"How Can Mirrors Be Real If Our Eyes Aren't Real\",<br>this was uttered by a young person after it was explained to them that our views of the world are influenced by our upbringing.</div>\n  <div class=\"paragraph\">He looked in a mirror, and said, if my eyes are lying to me,<br>then how can my reflection truly show who I am.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">The only way to become the person that the adult you should be,<br>is by means of real education.</div>\n  <div class=\"paragraph\">Real and meaningful life changing education,<br>will refine your decision making, to truly make it your own.</div>\n  <div class=\"paragraph\">So that your older self will be proud of and at peace with,<br>that you in your youth and middle age have made.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">This closing point shows you how critical real education is,<br>and more importantly, it shows how important it is that you get a real education as soon as possible.</div>\n  <div class=\"paragraph\">The delaying of the onset of your wisdom by a moderate teacher in a well developed nation,<br>is as evil, as purposefully warping the minds of trusting students in order to cause regime change or raise a generation of slaves or soldiers.</div>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <br>\n</div>\n<div class=\"section avoid-break-inside\" style=\"padding-bottom: 2rem;\">\n  <div class=\"paragraph\">Get your mittens at narrated books that are held in high esteem by all the worlds intellectuals,<br>don't pay too much attention to their flaws yet, it is a wonder that they exist at all.</div>\n  <div class=\"paragraph\">Allow yourself to grow up surrounded by wisdom,<br>inherit lifetimes of knowledge from powerful biographies and non fiction.</div>\n  <div class=\"paragraph\">Once your eyes begin seeing through the wisdom that does your elder self justice,<br>you will then, make the mirrors real.</div>\n  <div class=\"paragraph\">And what is more, you will then be able to explain,<br>how the letters on your shirt are mirrored and go right to left, but, BUT, BuUuT, your left hand is still your left hand in your mirror image.</div>\n  <div class=\"paragraph\">How can mirrors be real if they only reverse text,<br>and NOT your left and right hand side?</div>\n  <div class=\"paragraph\">Grrrrrr....</div>\n</div>\n<div class=\"break-after\">&nbsp;</div>\n<div>\n  <div class=\"section\" style=\"padding-bottom: 1rem;\">References</div>\n  <div>[1]: https://www.youtube.com/watch?v=fmoor8DwqW4</div>\n  <div>[2]: https://www.youtube.com/watch?v=mQPEZdBTOeE</div>\n  <div>[3]: https://youtu.be/IzZh2wstj88?t=3399</div>\n</div>",
  "text": "When we are little we learn that the act of taking a toy apart,\nis also the act of destroying that toy.\nSubject divisions destroy education,\nbeing told what you should be \"learning\" at any given moment...\nActually prevents learning,\nand forces you into memorization.\n\nTeachers are going along with it,\nbecause your education is not the primary reason why they are teachers.\nThey are teachers, to make money,\nto put food on the table.\nSometimes people become teaches,\nbecause they feel it tool a lot of effort to memorize all the disconnected facts.\nAnd they don't want to learn anything more,\nthey want to turn that effort into profit.\n\nThe presidents and prime ministers, all the world leaders,\nall the people who would seemingly greatly benefit from fixing schools.\nAre doing as little as possible to keep their position,\nthey are surrounded by people who want to tear them apart, liars, manipulators, mimics...\nAnd eventually,\nthey reach two conclusions.\nOne, do your job without an incident,\nthat is difficult enough.\nTwo, there is nothing you can do here as the position has been bricked,\nto keep liars from destabilizing all the other positions, and limit the potential damage.\n\nJust because a system is established,\nit does not mean that it will do what it was designed for.\nWhen you take something apart,\nit is all still there but it won't necessarily serve the purpose it was originally made for.\n\nHalf jokingly, if teachers worked for grades, instead of money,\nthen maybe things would change.\n\nA lot of politicians feel,\nthat they shouldn't worry about the things that you can do on your own.\nWhen you are in High School,\nyou'll get a bad education, but as you grow you will fix that by reading real books.\nA lot of them kind of feel, that it is good enough,\nto keep you out of prison, give you text books, and work...\nSo that they can be the leaders,\nand you can be the stuffing, the machinery, the content, the people.\nThis only sounds reasonable, because while they lead, and you get a crappy education,\nthe world's dictators use drug trade to stay in power, and fund nuclear weapons research, while religious extremists do all the rest.\n\nLeaders, by just doing the surface work,\nare just actors.\nJust because war didn't broke out during their term,\nit doesn't mean that they didn't play a big part in making it possible.\n\nBecause politics is so clogged up by liars, and pretenders,\nit is rendered ineffective, right up until the last moment before the war breaks out.\nThat's when everyone turns to the same aim,\nbecause is they don't they will be exposed, as liars, profiteering gluttons, or just ineffective leaders.\nTaking everything up to the last moment,\nis an extremely dangerous tactic.\nThe correct approach is to apply sanctions several decades ahead,\nprior to the war breaking out.\n\nPrediction,\nis a major part of a real leaders job.\nThey can completely erase a war,\nby collapsing all the things leading up to it.\nOnce the war is close, or begins,\nthe loss is infinitely greater, when compared to prevention.\n\nThis won't really become clear,\nuntil you realize how easy prevention is.\nPrevention, just requires real education,\nit eliminates the lairs, it creates a culture of dignity and honestly...\nAnd the leaders become powerful enough,\nto practice prevention of tragedy, decades before it happens.\n\nLet me define some terms for you, fake education, is a name I came up with,\nin response to people using the words \"Fake News\" - it is my way of calling out the liars.\nThe actual term that I am thinking of, is:\nineffective education[1].\nThat is when professionals look at the long therm outcome of an educational system,\nand decide that it did not have the expected result.\nBecause no one is fixing anything,\nI just call it fake.\nI suspect that schools cause damage to our natural curiosity about complex things,\nthat without grades and stress of fake school, punishment, poverty, and the threat of not getting a job...\nWhen you first truly notice stars, you'll be guided to use the family telescope,\nand slowly explained how Newton arrived at the laws, with little mechanical machines, and gradual changes to mathematical figures.\nThat with Love and Respect you would be introduced to computation on a computer where you can witness the results,\ninstead of paper, where the results look great when the teacher secretly forces everyone to memorize the formulas so that they can put food on their table.\n\nThat is not to say that being kicked out of school will make a genius,\nthough I can imagine that a lot of geniuses in deed had a start in the most terrible things that humanity can do to them.\n\nA young person still need the framework,\nnot the content and direction, but the structure and availability of information with easy on-ramp[2] access.\nEasy on-ramp access, means that there is an interface for a student,\nbecause normally scientists don't need that easy interface, though they always learn at every turn - they don't always need the Teenager explanation.\nAmong well educated professionals it is assumed,\nthat there is a certain level of knowledge that does not require all the explanations.\nSee that is the definition of real school,\nthat assumption is not made among the students, and every subject here, will have a clear and easy to understand on ramp.\nIn schools of today, teachers in their incompetence and insanity invented the crazy fantasy of pre-requsite knowledge,\nensuring that if you miss something in the beginning of High School, you will be forced to merely memorize content as you go on, and they will pass you along to make it look legit.\nAfter all, they are trying to do as little as possible,\nwhile giving a convincing impression of education and educational materials.\n\nYou kind of create a real school, when you go on the internet,\nand begin researching something for real, and actually assemble that on ramp.\nBut you see, that is the job of school,\nthat is how they should be teaching you, by helping you build up real knowledge, that is relevant to you.\nYou can see how fitting it is to call school fake,\nwhen you have to go home and lean on your own, and then use some of that to pass their warped testing.\nThe cute tests with trick questions, will make yo smile,\nbut they are pretty bad for you, knowledge is not a game...\nWhere a bunch of morons come together to throw you off,\nwith moronic questions.\nKnowledge is delicate, you don not want to be taking tests that try to mix things up,\nbecause they will cause harm to delicate distinctions that you are slowly building up.\nI compare finals with trick questions, to a teacher showing up at your home,\nand quietly reliving himself in the middle of your living room, with a great big smile of approval, or whatever.\n\nI just want to underline that the sequence in which you learn is very important,\nit is critical.\nYou can only learn based on what you know, it is no good for you to learn about memory collection and malloc,\nwhen you have determined that you are most powerful when learning high level programming languages that help you to program Visual Programming Languages.\nOnly you can make the determination of where you are going,\nand that determination will shift as you learn more and more.\nReal education will alter your decision making, will enhance your personality, refine the choices you are making,\nand take you to a future that you understand, that makes you feel whole.\nThis is not to say, that you will end up as a Ballerina, instead of a Doctor or Attorney,\nit means you will become an expert of wherever you go.\nIf you do end up a Ballerina, they you will also run a successful school for athletes,\nand you will ensure their safety and security, intellectual independence, and greatness.\nAn expert is a person with integrated knowledge,\nthat spans the entire area they are working in, Human Condition first.\n\nAs we transition to even the darker side and close,\nI want to mention to you a quote by Plutarch\n\"The mind is not a vessel to be filled,\nbut a fire to be kindled.\"\nYou can see how this makes a distinction between memorizing,\nand learning, poetically speaking, becoming ravenous for knowledge.\nAny attempt at tricking students into memorization, including the notion of pre-requisite classes,\nand especially standardized education, and of course, punishment with grades, and threats of being branded as mentally-late by holding them back - makes for a fake school.\nThis has been well defined, it has been considered,\nif you are tricked into memorization, your school is fake, and your education will later turn out to be ineffective.\n\nCollapsing education on purpose,\nhas been used to instill violence, create obedient slaves or soldiers, and cause regime change.\nSchools in well developed nations, as bad as they are,\nthey are not yet evil.\nBut creepy schools do exist[3], and they betray students,\nfor money, for power, out of sickens, out of evil.\nHere the teachers say, that they don't know if what they are teaching is real,\nbut if their imaginary creatures of might and glory wanted to do something that looks unreal, they could totally do it.\nThe do not accept responsibility for the things they teach, because they know they are not real,\nand when pressed they will hide themselves behind a major culture, and say, and say X billion people cant be wrong.\nThey do not aim to win the arguments,\nthey aim to avoid them.\n\nHere in closing I wanted to explain the opening line of \"How Can Mirrors Be Real If Our Eyes Aren't Real\",\nthis was uttered by a young person after it was explained to them that our views of the world are influenced by our upbringing.\nHe looked in a mirror, and said, if my eyes are lying to me,\nthen how can my reflection truly show who I am.\n\nThe only way to become the person that the adult you should be,\nis by means of real education.\nReal and meaningful life changing education,\nwill refine your decision making, to truly make it your own.\nSo that your older self will be proud of and at peace with,\nthat you in your youth and middle age have made.\n\nThis closing point shows you how critical real education is,\nand more importantly, it shows how important it is that you get a real education as soon as possible.\nThe delaying of the onset of your wisdom by a moderate teacher in a well developed nation,\nis as evil, as purposefully warping the minds of trusting students in order to cause regime change or raise a generation of slaves or soldiers.\n\nGet your mittens at narrated books that are held in high esteem by all the worlds intellectuals,\ndon't pay too much attention to their flaws yet, it is a wonder that they exist at all.\nAllow yourself to grow up surrounded by wisdom,\ninherit lifetimes of knowledge from powerful biographies and non fiction.\nOnce your eyes begin seeing through the wisdom that does your elder self justice,\nyou will then, make the mirrors real.\nAnd what is more, you will then be able to explain,\nhow the letters on your shirt are mirrored and go right to left, but, BUT, BuUuT, your left hand is still your left hand in your mirror image.\nHow can mirrors be real if they only reverse text,\nand NOT your left and right hand side?\nGrrrrrr....\n\nReferences\n[1]: https://www.youtube.com/watch?v=fmoor8DwqW4\n[2]: https://www.youtube.com/watch?v=mQPEZdBTOeE\n[3]: https://youtu.be/IzZh2wstj88?t=3399",
  "images": [],
  "links": [
    {
      "title": "ineffective education",
      "url": "https://www.youtube.com/watch?v=fmoor8DwqW4",
      "hostname": "www.youtube.com"
    },
    {
      "title": "easy on-ramp",
      "url": "https://www.youtube.com/watch?v=mQPEZdBTOeE",
      "hostname": "www.youtube.com"
    },
    {
      "title": "But creepy schools do exist",
      "url": "https://youtu.be/IzZh2wstj88?t=3399",
      "hostname": "youtu.be"
    }
  ]
}